init:
    $ latt = True
label d10:
    stop music fadeout 2.0
        pass
    scene day10
    with dissolve_scene_full
    window hide
        pass
    pause 5.0
        pass
    scene black
    with dissolve_scene_full
    pause 4.0
        pass
    "Я відчуваю невелике тепло, що огортає мене, коли сонце пробивається крізь вікно."
    scene mcg_6
    with dissolve_scene_full
    play music t9
        pass
    "Моніка обіймає мене, тихо дихаючи."
    "Я роблю те ж саме."
    m "Ммммм~"
    scene black
    with Dissolve(2.0)
    "Я заплющую очі, коли ми обіймаємося."
    "Я ж пообіцяв їй трохи часу для обіймів."
    pause 2.0
        pass
    play sound "mod_assets/sfx/kiss.ogg"
        pass
    pause 2.0
        pass
    m "Не можу дочекатися, коли робитиму це у твоїй реальності, [player]."
    m "Тільки ти і я..."
    m "...Проводимо час разом ось так..."
    m "Мммм~ Я вже збуджуюся від самих думок про це~! Хе-хе-хе~"
    m "Але зараз просто залишимось так..."
    pause 5.0
        pass
    scene mcg_6
    with dissolve_scene_full
    "Моніка обіймає ще міцніше, коли я намагаюся відпустити її."
    show mcg_3
    m "Ще ні!"
    hide mcg_3
    show mcg_8
    m "Ехехе~"
    hide mcg_8
    show mcg_6
    with Dissolve(1.0)
    "Вона продовжує міцно тримати мене."
    menu:
        "Обійняти її у відповідь.":
            m "Мхмхм~"
            "Її обійми трохи слабшають."
            show mcg_3
            m "Так краще~"
            m "До того ж ти відкладав це надто довго!"
            m "Я не відпущу, доки не буду задоволена~"
            show mcg_8
            m "Ехехе~"
        "Поцілувати в чоло.":
            show mcg_8
            m "Ехехе~"
            hide window
            pause 1.0
                pass
            hide mcg_8
            show mcg_2
            play sound "mod_assets/sfx/kiss.ogg"
                pass
            pause 1.0
                pass
            hide mcg_2
            show mcg_7
            m "Так просто ти від мене не втечеш~ Мхмхм~"
    show mcg_6
    "Вона продовжує міцно обіймати мене ще близько години."
    m "Мммммм~"
    show mcg_3
    m "Гаразд, думаю, тепер можна вставати."
    show mcg_8
    m "Мої батарейки повністю заряджені~"
    stop music fadeout 2.0
        pass
    scene bg bedroom
    with wipeleft_scene
    show monika p_1k at t11
    play music t8
        pass
    m "Це було чудово~"
    m p_2b "Будемо робити це частіше!"
    m p_1k "Я не хочу втрачати жодної нагоди бути ближче до тебе~"
    m p_1d "А тепер я піду переодягнуся."
    m p_2d "Можеш нарізати мені трохи зеленої цибулі?"
    show monika p_1c
    mc "Звісно. А що ти готуєш?"
    m p_2b "Я зроблю яєчню."
    show monika p_1a
    mc "Добре."
    mc "Я теж швидко переодягнуся і візьмуся до справи."
    m p_1b "Окей!"
    show monika p_1a at lhide
    hide monika
    "Моніка заходить у ванну з одягом у руках."
    "Поки вона там, я швидко переодягаюся і спускаюся вниз."
    scene bg kitchen
    with wipeleft_scene
    "Я зазираю в холодильник і дістаю пакет із зеленою цибулею."
    "Беру кілька стебел і кладу пакет назад у холодильник."
    "Беру ніж і дошку та починаю різати."
    "Коли закінчую, Моніка повільно спускається сходами, протираючи очі."
    show monika h1_1b at l11
    m "Дякую, [player]!"
    show monika h1_1a
    mc "Завжди радий."
    "Моніка дістає яйця і починає змішувати їх у мисці."
    show monika h1_2a
    "Вона додає туди й цибулю."
    "Поки вона цим займається, я дістаю дві тарілки й ставлю їх на стіл."
    mc "Я зроблю нам кави."
    m h1_1b "Добре."
    show monika at thide
    hide monika
    "Моніка виливає яйця на пательню й починає смажити."
    "Тим часом я ставлю заварювати каву."
    "Я розливаю каву у дві чашки, а Моніка знімає яйця з плити."
    show monika h1_1b at t11
    m "Гаразд, готово!"
    show monika h1_1a
    "Я беру свою тарілку й накладаю яєчню."
    "Моніка робить те ж саме, і ми сідаємо."
    "Ми обидва їмо з насолодою, і я знову дивуюся, наскільки смачно готує Моніка."
    mc "Ти справді чудова кулінарка, Моніка!"
    m h1_1e "Оу,{w=0.5} я не така вже й хороша."
    m h1_1l "Це ж проста яєчня!"
    show monika h1_1a
    mc "Все одно, дякую."
    m h1_1k "Завжди для тебе, [player]~"
    show monika at thide
    hide monika
    "Я швидко складаю посуд у посудомийну машину і допомагаю Моніці трохи прибрати."
    if persistent.goondate == True:
        jump d10date
    else:
        jump d10event
label d10date:
    show monika h1_1c at t11
    mc "То що спершу — шопінг чи наше побачення?"
    m "Хмммм..."
    m h1_1b "Спершу давай підемо на побачення~"
    show monika h1_1a
    mc "Добре. Я піду підготуюся."
    m h1_1b "Я теж."
    "Ми обоє йдемо нагору."
    scene bg bedroom
    with wipeleft_scene
    "Моніка бере сукню зі шафи й заходить у ванну."
    "Звісно, я теж беру щось охайніше."
    "Напевно, треба ще й прийняти душ перед виходом."
    show monika o1_1a at t11
    "Вона виходить і складає одяг, що був на ній раніше."
    "Я швидко забігаю з речами у руках."
    scene black
    with wipeleft_scene
    "Я приймаю душ і переодягаюся."
    scene bg bedroom
    with wipeleft_scene
    show monika o1_1b at t11
    m o1_1b "Гаразд, я готова."
    m "Вирушаємо?"
    show monika o1_1a
    mc "Так, тільки візьму гаманець."
    "Я так і роблю, і ми спускаємося вниз."
    scene bg kitchen
    with wipeleft_scene
    "Я беру порожню пластикову пляшку й наповнюю її водою для поїздки."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    show monika o1_1a at t11
    "Моніка бере рюкзак, і я кладу пляшку всередину."
    mc "Гадаю, це все, що нам треба. Ходімо!"
    m o1_1j "Так!"
    "Я накидаю рюкзак на плече, і ми виходимо надвір."
    stop music fadeout 2.0
        pass
    play sound closet_open
        pass
    scene bg house
    with wipeleft_scene
    play sound closet_close
        pass
    play music t12
        pass
    "Я замикаю двері, і ми починаємо йти вулицею."
    scene bg residential_day
    with wipeleft_scene
    show monika o1_1j at f11
    "Моніка бере мене за руку, і ми щасливо крокуємо тротуаром."
    "Сонце яскраво світить у небі, а коралово-каштанове волосся Моніки сяє у його променях."
    "Воно має солодкий аромат квітів."
    mc "Ти сьогодні новий шампунь використала?"
    m o1_2d "О? Так, я змінила. Старий закінчився."
    m o1_5a "Тобі подобається?"
    mc "Він чудовий."
    m "Ехехе~"
    m "Я рада~"
    show monika o1_1a
    "Ми проходимо повз школу й прямуємо далі в бік кафе."
    m o1_2e "Ми стільки спогадів залишили там."
    m o1_1b "Але я рада, що воно вже позаду."
    m o1_2k "Більше ніяких турбот про тести й дедлайни."
    m o1_2b "Тепер ми можемо просто відпочивати й насолоджуватися життям!"
    show monika o1_1a
    mc "Так."
    if persistent.revealloc == False:
        m "Гей, знаєш... Мені здається, я здогадуюсь, куди ти мене ведеш~"
        m "Це те саме кафе, куди ми ходили з клубом, правда?"
        mc "Як ти здогадалася?"
        m "Просто інтуїція~"
        m "Ну, ми йдемо приблизно в тому ж напрямку, тож..."
        m "Ти розумієш."
        mc "Ага. Напевно."
    "Ми продовжуємо триматися за руки й прямуємо до кафе."
    scene bg cafe_exterior
    with wipeleft_scene
    show monika o1_1a at f11
    "Ми підходимо до нього, і Моника зупиняє мене перед тим, як увійти."
    m o1_1b "Сядьмо надворі!"
    show monika o1_1a
    mc "Чому б і ні."
    m o1_2k "Ура!"
    show monika at thide
    hide monika
    "Я відсуваю стілець біля найближчого столика, і Моника сідає навпроти мене."
    scene ccg_1 zorder 2
    show y_cg2_dust1 zorder 3
    show y_cg2_dust2 zorder 3
    show m_cg_cafeEvent_shaft1 zorder 3
    show m_cg_cafeEvent_shaft2 zorder 3
    show m_cg_cafeEvent_shaft3 zorder 3
    with Dissolve(2.0)
    "Ми беремо меню й починаємо його переглядати."
    mc "То що ти будеш?"
    show ccg_4 zorder 2
    m "Мммм... Думаю, візьму овочеві сендвічі й каву."
    hide ccg_4
    show ccg_2 zorder 2
    m "Порції виглядають досить великими, тож можемо поділитися~"
    m "Що скажеш?"
    hide ccg_2
    mc "Я не проти."
    mc "А пити, мабуть, візьму..."
    call menuchoice5
label d10p2:
    mc "...[persistent.cofname]."
    mc "Хочеш, я зайду всередину й зроблю замовлення?"
    show ccg_5 zorder 2
    m "Звісно, це було б чудово, дякую, [player]!"
    hide ccg_5
    mc "Із задоволенням~"
    scene bg cafe_inside
    with wipeleft_scene
    $ e_name = "Бариста"
    "Я підходжу до стійки, а бариста за нею полірує чашки."
    "Він підіймає голову після того, як дзвіночок на дверях дзвенить."
    e "Вітаю! Що вам приготувати?"
    if persistent.coffee == "cof":
        mc "Привіт, одне замовлення овочевих сендвічів і дві кави."
    else:
        mc "Привіт, одне замовлення овочевих сендвічів, одна кава і [persistent.cofname], будь ласка."
    e "Добре, це із собою чи залишаєтесь тут?"
    mc "Залишаємося, моя дівчина чекає мене зовні."
    e "Чудово. Ваші напої будуть готові за мить."
    e "З вас 10 баксів."
    mc "Ось, тримайте."
    e "Дякую за замовлення!"
    e "Я винесу сендвічі, щойно вони будуть готові."
    mc "Дякую."
    "Бариста швидко готує напої й передає їх мені."
    mc "Спасибі!"
    e "Будь ласка. Сендвічі будуть готові за дві хвилини."
    mc "Добре."
    "Я повертаюся назад."
    scene ccg_1 zorder 2
    show cofe zorder 3
    show y_cg2_dust1 zorder 4
    show y_cg2_dust2 zorder 4
    show m_cg_cafeEvent_shaft1 zorder 4
    show m_cg_cafeEvent_shaft2 zorder 4
    show m_cg_cafeEvent_shaft3 zorder 4
    with Dissolve(2.0)
    "Я знову сідаю й ставлю каву перед Монікою."
    show ccg_2 zorder 2
    m "Дякую, [player]~"
    hide ccg_2
    mc "Завжди будь ласка. Бариста сказав, що винесе сендвічі, як тільки вони будуть готові."
    show ccg_4 zorder 2
    m "А, добре."
    hide ccg_4
    mc "Ну що, як тобі наше побачення?"
    show ccg_4 zorder 2
    m "[player], просто можливість провести час із тобою вже робить мій день..."
    hide ccg_4
    show ccg_5 zorder 2
    m "Тож сказати, що я просто насолоджуюся, було б дуже великим применшенням!"
    hide ccg_5
    mc "Я радий."
    "Бариста виходить із тарілкою в руках."
    e "Ось ваші сендвічі. Смачного!"
    show ccg_2 zorder 2
    m "Дякую!"
    "Він повертається всередину, залишивши нас удвох із нашою їжею."
    hide ccg_2
    show ccg_5 zorder 2
    m "Ооо~ Виглядає апетитно!"
    hide ccg_5
    show ccg_4 zorder 2
    m "Здається, я мала рацію, коли казала, що порція велика."
    hide ccg_4
    show ccg_2 zorder 2
    m "Ну що ж, їмо!"
    hide ccg_2
    "Ми обидва беремо по сендвічу й пробуємо."
    show ccg_5 zorder 2
    m "Ммм! Мені подобається!"
    hide ccg_5
    "Ми спокійно їмо сендвічі, тихо сміючись, коли наші погляди зустрічаються."
    show ccg_2 zorder 2
    m "Знаєш, я завжди думала, як це — піти на побачення в кафе."
    m "Це ж такий кліше — або кафе, або якийсь дорогий ресторан."
    m "Але тепер я розумію, чому це так популярно!"
    hide ccg_2
    show ccg_4 zorder 2
    m "Та якщо чесно, я б обрала кафе замість пафосного ресторану будь-якого дня."
    m "Тут набагато розслабленіше."
    hide ccg_4
    show ccg_5 zorder 2
    m "І значно дешевше теж~"
    hide ccg_5
    show ccg_2 zorder 2
    m "Хоча я б не відмовилася сходити й у ресторан."
    m "Може, коли я перейду у твій світ, ти зможеш справді відвести мене кудись гарне місце."
    m "Я ж зовсім не знаю закладів біля тебе, тож доведеться вести мене тобі!"
    hide ccg_2
    menu:
        "То куди б ти хотіла піти на наше наступне побачення?":
            pass
    show ccg_3 zorder 2
    m "Хммм, навіть не знаю."
    hide ccg_3
    show ccg_2 zorder 2
    m "Ооо! Знаю!"
    hide ccg_2
    show ccg_5 zorder 2
    m "Ходімо в шоколадницю!"
    hide ccg_5
    show ccg_2 zorder 2
    m "Здається, у центрі є одна!"
    m "Або бібліотека теж була б непоганим варіантом!"
    hide ccg_2
    show ccg_5 zorder 2
    m "...Але найкраще місце для побачення — це поруч із тобою у твоєму світі, [player]~"
    m "Ехехе~"
    hide ccg_5
    show ccg_2 zorder 2
    m "А поки що, думаю, цього тижня найкраще піти до бібліотеки."
    hide ccg_2
    mc "Та й справді, нам же не обов’язково зараз усе планувати."
    show ccg_5 zorder 2
    m "Так! Підемо, коли відчуємо бажання!"
    hide ccg_5
    hide cofe
    show ccg_6 zorder 2
    with Dissolve(1.0)
    "Моника робить ковток кави."
    hide ccg_6
    show ccg_4 zorder 2
    show cofe zorder 3
    with Dissolve(1.0)
    m "Знаєш, сьогодні, мабуть, краще було б узяти айс-лате."
    hide ccg_4
    show ccg_2 zorder 2
    m "Думаю, я візьму його, коли закінчу цю каву."
    m "Хочеш теж?"
    menu:
        "Так.":
            $ latt = True
            pass
        "Ні.":
            $ latt = False
            pass
    hide ccg_2
    show ccg_5 zorder 2
    m "Добре!"
    hide ccg_5
    show ccg_2 zorder 2
    m "Цікавий факт про айс-лате..."
    m "Ти знав, що більшість айс-лате роблять із цукром або додатковими сиропами?"
    hide ccg_2
    show ccg_4 zorder 2
    m "Це тому, що в холодній каві гіркота відчувається значно сильніше."
    m "Молоко трохи пом’якшує смак, але різні сиропи й цукор додають приємної солодкості, що особливо добре в теплу погоду."
    m "На відміну від гарячої кави, де якщо додати щось, як водянисте какао, то смак просто губиться від спеки та міцності кави."
    m "Ось чому частіше додають ароматизатори саме в холодні кавові напої, а не гарячі."
    m "А якщо говорити про смакування гарячої кави..."
    m "Щоб отримати хороший баланс між кавою та іншою гарячою добавкою, треба використовувати більш концентрований смак."
    m "Наприклад, щоб зробити мокко, використовують насичений шоколад — сироп або какао з цукром, а не водянисте какао."
    m "Потім додають еспресо й доливають молоко."
    hide ccg_4
    show ccg_2 zorder 2
    m "Кінцевий результат — набагато приємніше поєднання смаку кави та солодощів шоколаду!"
    hide ccg_2
    show ccg_5 zorder 2
    m "Звісно ж, у кожного свої вподобання. Але це моя думка."
    m "Я сподіваюсь колись дізнатися про твої вподобання.{w=0.5} Тоді я зможу приготувати щось, що ти точно полюбиш!"
    hide ccg_5
    "..."
    "Моніка швидко допиває каву і встає."
    show ccg_2 zorder 2
    if latt == True:
        m "Я піду замовлю лате, скоро повернуся."
    else:
        m "Я піду замовлю собі лате, скоро повернуся."
    hide cofe
    hide ccg_2
    "Вона повертається за кілька хвилин із кавою в руках."
    if latt == True:
        show ccg_2 zorder 2
        m "Ось твоя~"
        hide ccg_2
        mc "Дякую."
    "Вона знову сідає і робить ковток."
    show ccg_2 zorder 2
    if latt == True:
        m "Я попросила зробити їх у стаканах на виніс, щоб ми могли пити, поки ходимо по магазинах."
    else:
        m "Я взяла собі стакан на виніс, щоб можна було пити під час шопінгу."
    hide ccg_2
    mc "Гаразд."
    mc "Хочеш вирушати далі?"
    show ccg_5 zorder 2
    m "Так, думаю, можемо йти."
    hide ccg_5
    "Ми піднімаємося з крісел і беремо свої речі."
    scene bg cafe_exterior
    with wipeleft_scene
    show monika o1_1a at t11
    "Я дивлюся на свій годинник."
    "{i}2:13{/i}"
    mc "Ну що ж, тоді до вокзалу."
    mc "Ти знаєш, коли прибуває потяг?"
    m o1_1c "Емм... ні, не знаю."
    show monika o1_1a
    mc "Тоді дізнаємося, коли прийдемо."
    scene bg residential_day
    show monika o1_2j at f11
    with wipeleft_scene
    "Моніка тримає напій в одній руці, а іншою стискає мою."
    "Не те щоб я скаржився."
    if latt == True:
        "Я також сьорбаю своє лате одночасно."
    "Коли ми звертаємо за ріг, у полі зору з’являється вокзал."
    scene bg trainStation_day
    with wipeleft_scene
    "Ми швидко проходимо крізь каси й купуємо квитки."
    "На платформі майже нікого немає."
    show monika o1_1c at t11
    mc "Схоже, буде тиха поїздка."
    m o1_1d "Схоже на те."
    show monika at thide
    hide monika
    "Ми довго дивимось на розклад."
    "Наступний потяг має прибути приблизно за 10 хвилин."
    "Ми сідаємо на лавку й чекаємо."
    "Потяг під’їжджає з вереском, і кілька людей виходить."
    "Моніка заходить першою, я йду за нею."
    scene bg trainInterior_day
    with wipeleft_scene
    "Ми сідаємо біля дверей і чекаємо відправлення."
    "Диктор" "\"Двері зачиняються.\""
    "Диктор" "\"Наступна зупинка: Ідо Стейшн.\""
    "Потяг рушає — ми їдемо до торгового центру."
    scene bg trainInterior_day
    with wipeleft_scene
    "Поїздка гладка, з кількома зупинками дорогою, але доволі комфортна."
    "Моніка схиляється до мене, поки ми чекаємо на нашу зупинку."
    "Диктор" "\"Зараз зупинка: Центральний Молл.\""
    "Потяг зупиняється на платформі."
    "Ми встаємо й виходимо, коли двері відчиняються."
    scene bg trainStation_day
    show monika o1_2j at t11
    with wipeleft_scene
    "Ми вирушаємо до торгового центру, Моніка все ще тримає мене за руку, а в іншій напій."
    scene bg mall_exterior_day
    with wipeleft_scene
    "Щойно ми виходимо зі станції, у полі зору з’являється вхід."
    show monika o1_2b at t11
    m "Ми прийшли!"
    m o1_2k "Я така рада!"
    scene bg mall_interior_day
    with wipeleft_scene
    show monika o1_1a at t11
    "Коли ми заходимо, нас оточує натовп людей та безліч магазинів."
    "Моніка веде мене до ескалатора, і ми піднімаємось."
    m o1_1k "Хех, це так ностальгійно."
    m o1_2b "Я в дитинстві постійно каталася на них вгору-вниз."
    m o1_2k "Ііі..."
    "Моніка весело зіскакує з ескалатора."
    m "Ехехе~ Обожнюю так робити."
    show monika o1_1a
    if latt == True:
        "Ми викидаємо порожні стаканчики у смітник поруч."
    else:
        "Моніка викидає свій порожній стакан у смітник поруч."
    m o1_2b "Оох! Он там магазин!"
    m o1_2k "Пішли!"
    show monika o1_1a
    "Ми заходимо всередину."
    scene bg clothingstore
    with wipeleft_scene
    "Я йду з Монікою до відділу купальників."
    show monika o1_2b at t11
    m "О, цей гарний!"
    show monika o1_2b at thide
    hide monika
    "Але тепер я опинився серед... купи білизни..."
    show monika o1_1c at t11
    mc "Е-е... чоловікам тут можна перебувати?"
    m o1_1d "Ну, думаю так."
    show monika o1_1c
    mc "Але..."
    "Мені здається, що мене можуть заарештувати тільки за те, що я тут стою."
    m o1_1b "Не переймайся так!"
    m o1_2k "Поки ти тримаєш мене за руку, ніхто не запідозрить нічого дивного~"
    m o1_1k "Ходімо!"
    show monika o1_1a
    "Моніка бере мене за руку й продовжує шукати те, що їй подобається."
    mc "Дякую..."
    "Ми ще трохи ходимо разом."
    m o1_1d "Знаєш, подумавши, мабуть краще, якщо я подивлюся сама..."
    show monika o1_1c
    "Вона відпускає мою руку."
    mc "Зачекай! Я... е-е..."
    m o1_1l "Все гаразд!"
    show monika o1_1a
    "Вона підводить мене до лавки поруч."
    m o1_2d "Сядь тут і зроби вираз обличчя, який каже: «Я просто супроводжую свою дівчину», і все буде добре."
    show monika o1_1c
    mc "Я... я так зможу?"
    m o1_1b "Просто зачекай хвилинку. Я повернуся швидше, ніж ти встигнеш помітити!"
    show monika o1_1a
    mc "Добре."
    show monika at thide
    hide monika
    "Моніка йде далі дивитися."
    "Тим часом я роблю найсерйозніше покерфейс обличчя у світі, намагаючись приховати своє збентеження."
    "Навпроти мене бачу чоловіка з фіолетовим волоссям, який робить майже те саме обличчя."
    "На вигляд він приблизно мого віку."
    "Але, судячи з кільця на пальці, він одружений."
    "Схоже, він теж супроводжує свою дружину."
    "Незабаром Моніка повертається з комплектом у руках."
    show monika o1_1b at l11
    m "Бачиш? Я ж казала, недовго."
    m o1_5a "Я знайшла щось, що тобі сподобається~"
    "Вона швидко ховає бікіні за спину."
    "Хоча я встиг помітити рожевий і білий кольори."
    m "Але побачиш на мені його тільки завтра~"
    m o1_2b "Ну а зараз — пішли платити."
    show monika o1_1a at thide
    hide monika
    "Ми підходимо до каси, й Моніка віддає вбрання продавчині."
    "Касир" "\"З вас 32 долари.\""
    "Я дістаю гаманець і плачу за Моніку."
    "Касир" "\"Дякуємо за покупку!\""
    "Ми швидко виходимо з магазину, а моє обличчя досі горить червоним."
    scene bg mall_interior_day
    with wipeleft_scene
    show monika o1_1a at t11
    mc "От і все... ми купили."
    mc "Чи треба ще щось?"
    m o1_1c "Хмм..."
    m o1_1d "Гадаю, ні."
    m o1_2b "Але я хочу швидко глянути на спідниці та бантики, що тут є."
    m o1_2k "Ходімо!"
    scene bg clothingstore
    with wipeleft_scene
    "Ми підходимо до найближчого магазину одягу."
    "На задній стіні висить безліч стрічок і бантиків різних кольорів."
    "Очі Моніки сяють, коли вона дивиться на все це."
    show monika o1_2b at t11
    m "[player], подивись на цей!"
    m "Це ж така сама стрічка, як у мене!"
    "Вона тримає білу стрічку, що виглядає точно як та, що в неї в волоссі."
    menu:
        "Дуже гарна, Моніко.":
            m o1_2k "Хехе~"
            show monika o1_1a
            "Вона кладе стрічку назад на полицю."
            m o1_1b "Якби у нас було більше грошей, я б, мабуть, купила її."
            m o1_1e "Але мені це не потрібно, бо я вже маю те, чого завжди хотіла, прямо перед собою~"
            m o1_1j "Ехехе~"
        "Ти як дитина в магазині солодощів!":
            m o1_2k "Нічого не можу з собою вдіяти~"
            m o1_2b "Вони всі такі гарні!"
            show monika o1_1a
            "Вона кладе стрічку назад на полицю."
            m o1_1b "Але сьогодні я тільки подивлюся.{w=0.5} Купувати нічого не буду."
            m forward dress lpoint rdown sedu om oe "Хоча наступного разу,{w=0.5} не впевнена~"
            m o1_1j "Ехехе~"
    "Вона ще трохи дивиться, а потім обертається до мене."
    m o1_2b "Гаразд, думаю, тепер піду подивлюсь на спідниці..."
    show monika o1_1a
    "Я йду за нею в прохід, де на вішалках висять спідниці та сукні."
    m forward dress lpoint rdown vsur cm oe "Ооо~ Оця виглядає гарно... і ця теж..."
    "Вона радісно перебирає вішалки, уважно оглядаючи все."
    m o1_2d "О, мені подобається ця жовта..."
    m o1_1b "Гей, [player], скільки у нас ще залишилось? Я хочу купити цю!"
    show monika o1_1a
    mc "Емм..."
    "Я швидко перевіряю свій гаманець."
    "Там дві двадцятки, десятка і трохи дрібних."
    mc "Скільки вона коштує?"
    m o1_1b "Зараз... двадцять баксів!"
    show monika o1_1a
    mc "Так, ми можемо її взяти."
    m o1_1k "Ура~"
    show monika o1_1a
    "Я передаю Моніці двадцятку, і ми йдемо до каси."
    "Касир" "\"Добрий день!\""
    "Моніка кладе спідницю, і касирка пробиває її."
    "Вона передає двадцятку й отримує чек."
    "Касир" "\"Дякуємо за покупку!\""
    show monika o1_1j
    "Ми виходимо з магазину, а Моніка сяє від щастя."
    scene bg mall_interior_dawn
    with wipeleft_scene
    show monika o1_1k at t11
    m "Дякую, [player]~"
    show monika o1_1a
    mc "Та нема за що."
    mc "Думаю, нам варто вже вирушати додому. Небо починає ставати помаранчевим."
    m o1_1d "Так, мабуть, ти правий."
    m o1_1b "Але все одно було класно..."
    show monika o1_1a
    "Коли ми вже збираємось іти до виходу, я помічаю Юрі, яка сидить на лавці з телефоном у руках та пакетом поруч."
    "Моніка теж помічає."
    m o1_1b "Привіт, Юрі!"
    show monika o1_1a at t22
    show yuri 1se at t21
    "Юрі підіймає погляд від телефону, трохи здивована Монікою."
    y 1sf "О! Привіт!"
    y 1sb "Що привело вас сюди?"
    show yuri 1sa
    m o1_2k "Ну, [player] вирішив повести мене сьогодні на побачення~"
    m o1_1b "А вчора я зрозуміла, що мені потрібен новий купальник, тож ми після цього зайшли його купити!"
    show monika o1_1a
    y 1sb "Ага. Насправді мені теж давно треба було. Я щойно купила собі один."
    show yuri 1sa
    "Вона піднімає пакет."
    show yuri 1sp at h21
    "Раптово вона метушиться, починає швидко збирати свої речі."
    y 2sp "Ой, я тільки що глянула на годину! Поїзд от-от приїде!"
    show yuri 1sn
    m "Справді?"
    y 2sp "Так!"
    y 2sq "Вибачте, мушу бігти!"
    show yuri 2se at lhide
    hide yuri
    show monika o1_2d at t11
    m o1_2d "Чекай! Юрі! Ми теж їдемо!"
    show monika at thide
    hide monika
    "Ми стрімголов біжимо до вокзалу."
    scene bg trainStation_dawn
    with wipeleft_scene
    show monika o1_1l at t22
    show yuri 2sq at t21
    "Ми швидко проходимо через квиткову зону й виходимо на платформу саме в той момент, коли під'їжджає поїзд."
    "Ми сідаємо й вирушаємо додому."
    scene bg trainInterior_dawn
    with wipeleft_scene
    "Юрі сідає навпроти нас, а Моніка кладе голову мені на плече."
    show monika o1_1j at t11
    m "Мммм~ Сьогодні було весело..."
    m o1_1b "Дякую, що вивів мене, [player]."
    mc "Нема за що, Моніко."
    mc "Я радий, що тобі сподобалося."
    show monika at thide
    hide monika
    show yuri 1si at t11
    "Я кидаю погляд на Юрі, щоб перевірити, чи вона щось помітила, але, на щастя, у неї у вухах навушники, і вона читає книжку."
    show yuri at thide
    hide yuri
    show monika o1_1j at f11
    "Моніка ніжно тримає мене за руку й усміхається."
    "І в цю мить..."
    show monika forward dress ldown rdown neut n3 me e4a at face
    hide window
    pause 1.5
        pass
    scene black
    with Dissolve(1.0)
    play sound "mod_assets/sfx/kiss.ogg"
        pass
    pause 5.0
        pass
    scene bg trainInterior_dawn
    show monika forward dress ldown rdown neut n3 ma e1a b1b at face
    with Dissolve(3.0)
    m "Я так сильно тебе кохаю, [player]..."
    show monika forward dress ldown rdown neut n3 ma e4a
    "Ми обіймаємось і спокійно чекаємо на нашу зупинку."
    show monika at thide
    hide monika
    "Досить швидко ми приїжджаємо на нашу станцію."
    "Моніка легенько торкається плеча Юрі, щоб привернути її увагу."
    m "Це наша зупинка, ходімо."
    y "Дякую."
    "Ми всі виходимо на станції."
    stop music fadeout 2.0
        pass
    scene bg trainStation_dawn
    with wipeleft_scene
    play music t8
        pass
    show yuri 1sb at t11
    y "Побачимось завтра. Мій дім у цьому напрямку."
    show yuri at thide
    hide yuri
    "Юрі вирушає додому."
    show monika o1_2k at t11
    m "Бувай, Юрі!"
    m o1_1b "А нам теж час іти, так?"
    mc "Так, ходімо."
    scene bg residential_aft
    with wipeleft_scene
    show monika o1_1a at f11
    "Ми з Монікою йдемо вулицею, тримаючись за руки."
    mc "То що ти хочеш на вечерю?"
    m o1_1d "Мммм, навіть не знаю."
    m o1_2d "Хочу щось легке сьогодні."
    m o1_1b "Думаю, просто вип’ю молока з печивом."
    m o1_2k "Але маю гарну ідею для завтрашнього сніданку — залишу її сюрпризом~"
    show monika o1_1a
    mc "Гаразд, я вже чекаю з нетерпінням!"
    m o1_1j "Ехехе~"
    "Незабаром наш дім з’являється попереду."
    scene bg house_dawn
    with wipeleft_scene
    "Я відмикаю двері та впускаю Моніку першою."
    stop music fadeout 2.0
        pass
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    play music t9
        pass
    "Моніка ставить пакети на диван і знімає взуття."
    show monika o1_1d at t11
    m "Я занесу речі нагору."
    show monika o1_1a
    mc "Гаразд."
    show monika at lhide
    hide monika
    "Моніка бере пакети й підіймається, а я розкладаю речі тут унизу."
    "Після цього теж іду нагору."
    scene bg bedroom
    with wipeleft_scene
    "Я проходжу повз Моніку, яка несе піжаму й новий одяг у ванну."
    "Поки вона там, я встигаю перевдягтися у домашнє."
    show monika p_1j at l11
    "Моніка повертається з усмішкою на обличчі."
    m p_1b "Я знаю точно, що тобі сподобається побачити мене завтра~"
    show monika p_1a
    mc "Не сумніваюсь."
    mc "Але знаєш, Моніко..."
    mc "Мені завжди подобається бачити тебе~"
    m p_1e "Оуу~{w=0.5} [player]~"
    show monika at thide
    hide monika
    "Моніка трохи червоніє, кладучи речі на місце."
    mc "Я буду внизу, якщо що."
    m "Гаразд, я зараз прийду."
    scene bg kitchen
    with wipeleft_scene
    "Я дістаю молоко й наливаю його у дві миски."
    "Розігріваю його й ставлю одну миску для Моніки."
    show monika p_1a at l11
    "Вона спускається та сідає."
    m p_1b "Дякую, [player]."
    show monika p_1a
    "Я беру кілька печеньок, ламаю їх і кидаю в молоко."
    "Ми вечеряємо, після чого я складаю решту печива в шафу."
    m p_1b "Це було смачно."
    m "Думаю, я вже майже готова йти спати."
    show monika p_1a
    mc "Гаразд. Я тільки ввімкну посудомийку."
    "Я запускаю миття тарілок, гашу світло й підіймаюсь за Монікою нагору."
    scene bg bedroom
    with wipeleft_scene
    "Моніка, як завжди, стрибає в ліжко, а я вимикаю світло."
    scene bg bedroom_night
    "Потім я лягаю поруч із нею."
    scene black
    with Dissolve(2.0)
    m "Чекаєш завтрашнього дня?"
    mc "Авжеж!"
    m "Хехе~ Думаю, це тому що ти побачиш мене у купальнику, правда, [player]?"
    menu:
        "Можливо...":
            pass
    m "Хехе~"
    m "На добраніч, коханий~"
    mc "На добраніч, Моніко."
    "І з цим я поринаю у новий день..."
    call d11
label d10event:
    mc "То що, хочеш спочатку піти за покупками чи до Нацукі?"
    m "Хіба Сайорі не казала, що ми маємо зустрітися опівдні?"
    mc "От чорт, я забув."
    mc "Котра година...?"
    "11:30"
    mc "Добре, у нас пів години, треба поспішати!"
    m "Ага!"
    "Моніка й я швидко біжимо нагору."
    scene bg bedroom
    with wipeleft_scene
    "Моніка стрімголов забігає до ванної з речами в руках."
    "Я теж перевдягаюсь у щось більш доречне й швидко хапаю гаманець, перш ніж спуститися вниз."
    scene bg kitchen
    with wipeleft_scene
    "Я хапаю порожню пляшку й наповнюю її водою."
    show monika o2_1a at l11
    "Моніка збігає вниз із рюкзаком у руках."
    "Я передаю їй пляшку, і вона запихає її всередину."
    mc "Готова?"
    m o2_1b "Так, здається, це все."
    m o2_1d "У тебе гаманець є, так?"
    show monika o2_1a
    mc "Авжеж."
    m o2_1b "Добре, тоді можемо вирушати."
    show monika o2_1a
    mc "Гаразд."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    "Ми з Монікою швидко взуваємось і виходимо з дому."
    stop music fadeout 2.0
        pass
    play sound closet_open
        pass
    scene bg house
    with wipeleft_scene
    play sound closet_close
        pass
    play music t12
        pass
    "Сайорі й ГГ чекають нас біля воріт."
    s "Привіііт!"
    m "Доброго ранку!"
    "Я замикаю двері, і ми підходимо до них."
    show monika o2_1a at t33
    show sayori 1ba at t32
    show protag 1ba at t31
    mc "Всі готові?"
    p 1bc "Так, принаймні маємо бути."
    show protag 1ba
    mc "Добре, тоді ходімо."
    scene bg residential_day
    with wipeleft_scene
    show monika o2_1a at t33
    show sayori 1ba at t32
    show protag 1ba at t31
    mc "Хтось знає, куди саме йти?"
    p 3bd "Пекарня, здається, за два квартали від школи."
    p 1bd "Принаймні, так казала Нац."
    p 3by "Адреси я не пам’ятаю, щоправда."
    show protag 1ba
    mc "Теж непогано, думаю, просто підемо тим шляхом, яким вони зазвичай йдуть додому."
    m o2_2b "Так, думаю, це найкращий варіант."
    show monika o2_1a
    "Незабаром ми доходимо до шкільних воріт."
    m o2_2d "Добре, думаю, нам треба йти сюди."
    show monika o2_2a
    "Моніка показує напрям, і ми вирушаємо далі вулицею."
    show monika o2_1a
    "Поки ми йдемо, я помічаю рожеве біля одного з будинків."
    mc "Гей, здається, он там Нацукі."
    s 1bx "Ооо! Точно вона!"
    show sayori turned casual lup rdown neut mc e4c at h32
    s "Привііііііт!!"
    show sayori 1ba
    "Нацукі відривається від витирання вивіски та махає нам."
    stop music fadeout 2.0
        pass
    scene bg cafe_exterior
    with wipeleft_scene
    play music t8
        pass
    "Вона стоїть біля вивіски, коли ми підходимо до кав’ярні."
    show monika o2_1a at t44
    show sayori 1ba at t43
    show protag 1ba at t42
    show natsuki 1bl at t41
    n "Гей! Ви прийшли!"
    show natsuki 1bj
    m o2_1b "Авжеж."
    show monika o2_1a
    n 2bz "Заходьте!"
    scene bg cafe_inside
    with wipeleft_scene
    show monika o2_1a at t44
    show sayori 1ba at t43
    show protag 1ba at t42
    show natsuki 1bv at t41
    n "Тааато! Мої друзі прийшли!"
    show natsuki 1ba
    $ e_name = "Батько Нацукі"
    e "Добре. Ідіть, грайте. Мама все одно скоро повернеться."
    n 4bl "Дякую, тату!"
    show natsuki 1bj
    m o2_1b "Дякуємо, що прийняли нас."
    show monika o2_1a
    "Нацукі веде нас нагору, подалі від торгової зали."
    scene bg livingroom
    with wipeleft_scene
    "Ми всі сідаємо на диван, і Нацукі заговорює."
    show monika o2_1a at t44
    show sayori 1ba at t43
    show protag 1ba at t42
    show natsuki 1bd at t41
    n "Добре, Сайорі, пам’ятаєш, що я казала вчора?"
    show natsuki 5ba
    show sayori 4bh at s43
    s "Що? У тебе немає солодощів?"
    show sayori 4bb at t43
    n 5bc "О, солодощі є. Але я ж казала про виклик, пам’ятаєш?"
    n 4bd "Треба приготувати щось{w=0.5} {i}і{/i}{w=0.5} не спалити кухню!"
    show natsuki 5ba
    s tap casual pout cm oe "Я досі злюся, що ти про це знаєш..."
    "Нацукі веде Сайорі на кухню, і ми йдемо за ними."
    scene bg kitchen
    with wipeleft_scene
    "Нацукі дістає миску та кілька інгредієнтів."
    show natsuki 1bc at t21
    show sayori 1bb at t22
    n "Добре, тепер повторюй за мною."
    show sayori 4bo
    show natsuki 1bd
    "Нацукі починає давати вказівки Сайорі, і вони готують тісто для печива."
    "Сайорі робить усю роботу, а Нацукі лише диктує кроки."
    n 1bb "Тепер роби ось так..."
    show natsuki 1ba
    "Вона бере миску від Сайорі й показує, як потрібно мішати."
    s 2bh "Я теж так зможу!"
    show sayori 1bb
    n 3bc "Ні-ні, тут є особливий спосіб, інакше не вийде як слід!"
    show natsuki 1ba
    s 2bh "Але ж це просто змішування!"
    show sayori 1bb
    n 5bw "Повір мені, Сайо, побачиш."
    show natsuki 5ba
    "Здається, вона просто мішала як завжди."
    show sayori 1bo
    "Але, мабуть, вона рахувала кількість обертів."
    n 1bd "Гаразд, ось форма, виливай, Сайо."
    show natsuki 5ba
    show sayori 4bo
    "Вона повертає миску Сайорі, і та викладає тісто на печиво."
    show sayori 1ba
    n 1bd "А тепер у духовку десь на п’ятнадцять хвилин."
    show natsuki 1ba
    "Сайорі ставить печиво, а Нацукі виставляє температуру."
    n 4bl "Гаразд, чекаємо!"
    n 1bb "Я швидко збігаю в кімнату за однією річчю."
    n 4be "Сайорі, стеж за печивом, бо якщо згорить — отримаєш ним по голові."
    show natsuki 4ba
    s 1br "Не хвилюйся, я дивлюсь!"
    show sayori 1ba at t11
    show natsuki at lhide
    hide natsuki
    "Нацукі швидко виходить із кухні, мабуть, до своєї кімнати."
    "А ми тим часом повертаємось до вітальні."
    scene bg livingroom
    with wipeleft_scene
    "Ми сідаємо на диван, і Нацукі повертається з томиком манґи в руках."
    show protag 1bb at t21
    show natsuki 1bc at t22
    n "ГГ, ти ж пам’ятаєш правила? Якщо порвеш — кінець тобі."
    show natsuki 1ba
    p 1bf "Так, знаю."
    p 1bc "Дякую, Нацукі."
    show protag 1ba
    n 3bz "Без проблем."
    show natsuki at thide
    hide natsuki
    show protag at thide
    hide protag
    "Вона передає том ГГ і лягає на інший диван."
    show natsuki 5bq at t11
    n "Хууух..."
    n 1bb "Я просила Юрі теж прийти, але вона сказала, що зайнята хатніми справами."
    show natsuki 1bc at t21
    show monika o2_1b at t22
    m "О! У мене є ідея!"
    m o2_3b "Давайте подзвонимо їй і ввімкнемо гучний зв’язок."
    m o2_1k "Так вона зможе з нами поговорити, поки робитиме справи."
    show monika o2_1a
    n 1bd "Добре, я напишу їй повідомлення, подивимось, чи хоче."
    show natsuki 1ba
    "Нацукі швидко друкує на телефоні, і за кілька секунд пролунає сигнал."
    "А тоді дзвінок."
    y "{i}Алло?{/i}"
    n 1bd "Привіт, Юрі!"
    show natsuki 1ba
    m o2_2k "Привіт!"
    show monika o2_1a
    y "{i}О, Моніко, ти теж там?{/i}"
    y "{i}Припускаю, [player] також тут?{/i}"
    mc "Саме так."
    y "{i}А, гаразд.{/i}"
    s "Я теж тут!"
    "Сайорі вигукує з кухні."
    y "{i}Привіт, Сайорі!{/i}"
    n 5by "Брудний хікі-отаку та NEET теж тут."
    show protag 5bw at t31
    show natsuki 2ba at t32
    show monika o2_1a at t33
    p "Гей!{w=0.5} Я не хікі і не NEET!"
    p "І взагалі-то я чистенький, дякую!"
    show protag at thide
    hide protag
    show natsuki turned casual ldown rdown laug om ce at t21
    show monika o2_1k at t22
    "Ми всі вибухаємо сміхом."
    show natsuki 1ba
    m o2_1b "Юрі, як там твої справи?"
    show monika o2_1a
    y "{i}Еее, все добре. Зараз витираю пил, поки батьків немає.{/i}"
    y "{i}Потім треба буде пропилососити, тоді вимкну звук.{/i}"
    n 1bc "Ммм, гаразд."
    n 1bd "А Сайорі зараз на кухні печиво робить."
    show natsuki 1ba
    y "{i}Ти довірила їй свою кухню?{/i}"
    show natsuki turned casual ldown rdown laug om ce
    show monika o2_1j
    s "Гей! Юрі! Тільки не ти..."
    show natsuki 1ba
    show monika o2_1a
    y "{i}Хахаха, я жартую, Сайорі.{/i}"
    n 1bd "Та й я теж наглядаю, про всяк випадок."
    show natsuki 1ba
    s "Мммммм..."
    "Сайорі знову бурчить, але повертається перевірити печиво."
    s "Гей, здається, воно вже готове."
    n 1bb "Секунду, дай гляну."
    show natsuki 1ba at lhide
    hide natsuki
    show monika at t11
    "..."
    n "Так, думаю, можна виймати."
    "Ми повертаємось на кухню, щоб подивитися, що там."
    scene bg kitchen
    with wipeleft_scene
    show monika o2_1b at t31
    show natsuki 1ba at t32
    show sayori 1ba at t33
    m "Я ввімкну камеру для тебе, Юрі."
    show monika o2_1a
    y "{i}Дякую, я теж увімкну.{/i}"
    show sayori 4bn
    "Сайорі витягає деко з купкою гарячого золотистого печива."
    s "Ооо~ Пахне так смачно..."
    show sayori 3bp at h33
    s "Ай!"
    "Сайорі трохи обпікає руку, коли намагається схопити печиво."
    n 2bm "Ти ж розумієш, що вони щойно з печі, так?"
    show natsuki 1bc
    s 2bl "Так, але вони так смачно пахнуть..."
    show sayori 1ba
    n 5bd "Чекай, за кілька хвилин охолонуть."
    n "І не переймайся безладом, я потім приберу."
    show natsuki 1ba
    s 4br "Дякую, Нацукі!"
    show sayori 2ba
    n 1bd "До речі, я ж обіцяла солодощі, так?"
    n 4bz "Ось вони!"
    n 5bd "Казала ж, що отримаєш, якщо не спалиш кухню."
    show natsuki 5bz
    show sayori 2br
    show monika o2_1k
    "Ми всі сміємось, поки печиво холоне."
    show natsuki 1ba
    show sayori 1ba
    show monika o2_1a
    y "{i}Гаразд, я вимкнусь, бо треба пилососити.{/i}"
    m o2_1b "Добре. Почуємось, Юрі!"
    show monika o2_1a
    n 1bd "Удачі!"
    show natsuki 1ba
    "Юрі вимикає звук, і ми бачимо, як вона вмикає пилосос."
    show sayori 2bo
    "У цей час я краєм ока помічаю, як Сайорі знову тягнеться за печивом."
    show sayori 1bq
    "Цього разу вона бере одне й відкушує шматок."
    show sayori 2bx at h33
    s "Мммм!{w=0.5} Вони охололи!"
    show sayori 2ba
    m o2_1b "Ооо~ Тепер мені теж цікаво спробувати!"
    show monika o2_2j
    "Моніка теж бере печиво."
    "Я також беру собі одне."
    "Тісто ніжне й тягуче, а шоколад додає солодощів."
    y "{i}Гей, я повернулась.{/i}"
    show monika o2_1a
    show sayori 4bm at h33
    "Юрі раптово вмикає звук, і Сайорі ледь не впускає печиво."
    show sayori 1ba
    n 5bz "Привіт, «Повернулась», я Нацукі!"
    show monika o2_1m
    show sayori 1bl
    "Моніка й Сайорі хихикають від цього жахливого жарту."
    show sayori 1ba
    show monika o2_1a
    y "{i}Я прям сама вляпалась у це.{/i}"
    n 5by "Отож бо й воно!"
    show natsuki 1ba
    m o2_1b "Ти вже все прибрала?"
    show monika o2_1a
    y "{i}Більш-менш.{/i}"
    y "{i}Батьки щойно повернулися, тож, можливо, я зможу до вас приєднатися.{/i}"
    y "{i}Зараз повернусь... ще раз.{/i}"
    "Юрі відходить від телефону, а ми мовчки чекаємо."
    "Незабаром вона повертається."
    y "{i}Гаразд, я швидко зберусь і прийду.{/i}"
    m o2_1b "Чудово! Побачимось тоді, Юрі!"
    show monika o2_1a
    y "{i}Бувай!{/i}"
    "Юрі кладе слухавку, і Моніка повертає телефон Нацукі."
    n 1bl "Виходить, вона таки прийде!"
    show natsuki 1ba
    s 4br "Ура! Нарешті всі будемо разом!"
    show sayori 4bq
    m o2_1j "Мгм!"
    "Ми залишаємо трохи печива для Юрі й повертаємось у вітальню."
    scene bg livingroom
    with wipeleft_scene
    "ГГ стрибає на диван і починає читати том манґи, який дала йому Нацукі."
    "Сайорі сідає поруч і кладе голову йому на коліна."
    p "Сайорі... ти що робиш?"
    s "Просто відпочиваю, хе-хе-хе!"
    "ГГ тихо повертається до читання."
    "Нацукі теж сідає й дістає іншу манґу."
    "Моніка ж кладе голову мені на плече."
    show natsuki 1bc at t11
    n "Гей, у мене випадкове питання."
    n "Ви б воліли з’їсти кекс розміром із торт чи торт розміром із кекс?"
    show monika o2_1a at t44
    show natsuki 1ba at t43
    show protag 1bd at t42
    show sayori 1ba at t41
    p "А який саме торт мається на увазі?"
    show protag 1bb
    n 1bb "Емм... ну, як весільний торт."
    show natsuki 1ba
    p 1bf "Ну, стільки глазурі з’їсти огидно, тож я краще оберу міні-тортики."
    show protag 1ba
    s 1br "А я хочу кекс розміром із торт!{w=0.5} Я обожнюю глазур!"
    show sayori 1ba
    n 1bc "[player]?"
    show natsuki 1ba
    menu:
        "Торт розміром із кекс.":
            n 1bd "Розумію."
            show natsuki 1ba
            m o2_1d "Я б теж так сказала."
            m o2_1l "Я люблю солодке, але стільки глазурі — це перебір."
        "Кекс розміром із торт.":
            n 1bd "Цікаво."
            show natsuki 1ba
            m o2_1d "А я все ж оберу торт розміром із кекс."
            m o2_1l "Я люблю солодке, але стільки глазурі для мене забагато."
    show monika o2_1a
    n 1bc "Так, напевно."
    n 1bd "Добре, маю ще одне питання."
    show natsuki 1bc
    s 2bx "Ооо! У мене теж є!"
    show sayori 1ba
    n 1bd "Гаразд, кажи, Сайо."
    show natsuki 1ba
    s 1bx "Ви б краще пішли в акваріум чи в парк розваг?"
    show sayori 1ba
    n 1bd "Я однозначно схиляюсь до парків розваг."
    show natsuki 1ba
    p 1bd "Я теж, напевно, вибрав би парк розваг."
    s turned casual lup rdown neut e1b mb "Зрозуміло..."
    s 1bx "Моніко, а ти?"
    m o2_1d "Ммммм.... Не знаю. Думаю, обидва місця цікаві."
    m o2_1b "Я відповім після [player]."
    show monika o2_1a
    n 4bb "Б’юся об заклад, ти просто повториш за ним."
    show natsuki 1ba
    m o2_1l "Ні! Чесно! Добре?"
    show monika o2_1a
    s 1bx "Добре. [player], а ти куди б пішов?"
    menu:
        "Акваріум.":
            s 1br "Ооо~ подивитись на рибок, так?"
            s 2bx "Гаразд, Моніко, твоя відповідь?"
            show sayori 1ba
            m o2_2k "Еммммм... Думаю, акваріум!"
            show monika o2_1a
            n 4be "Я ж казала, ти повториш за ним!"
            m o2_1j "...Хехе~"
            n 5bf "Що значить «хехе»?!"
            n 5bx "Ех... байдуже..."
        "Парк розваг.":
            s 1br "Клас!"
            s 2bx "Гаразд, Моніко, твоя відповідь?"
            show sayori 1ba
            m o2_2k "Еммммм... Думаю, парк розваг!"
            show monika o2_1a
            n 4be "Я ж казала, ти повториш за ним!"
            m o2_1j "...Хехе~"
            n 5bf "Що значить «хехе»?!"
            n 5bx "Ех... байдуже..."
    n 1bb "Я тоді свою запитаю—"
    "Та раптом чути кроки, що піднімаються сходами."
    show yuri 1sb at l41
    show sayori at t42
    show protag at thide
    hide protag
    show natsuki at t43
    show monika at t44
    y "Привіт, я прийшла!"
    show yuri 1sa
    n 1bl "Привіт, Юрі!"
    show natsuki 1ba
    y 1sb "То що я пропустила?"
    show yuri 1sa
    n 1bd "Та нічого особливого, ми просто байдикували після печива."
    n 1bc "До речі, ми лишили тобі трохи на кухні, хіба що Сайорі їх не з’їла."
    show natsuki 1ba
    s 1bj "Гей! Не з’їла! Я можу себе контролювати, знаєш!"
    show sayori 2bo
    p "Кажеш це після того, як більшість сама з’їла."
    s 4bm "Еееее? Ні, я не їла!"
    s 3bl "Ну, може трохи..."
    show sayori 1ba
    show yuri 2sa
    "Юрі бере печиво й надкушує."
    y 2sd "Ммм! Смачне."
    y 2sb "Хочете, я зроблю чаю до нього?"
    show yuri 1sa
    p "Так, було б добре."
    y 1sb "Добре. Нацукі, можна я позичу твій чайник?"
    show yuri 1sa
    n 1bb "Я ж уже казала, можеш брати й не питати."
    y 1sb "Але я все одно запитаю."
    y 2sb "Ерл Грей підійде?"
    show yuri 1sa
    m o2_1b "Мгм. Звичайно."
    show monika o2_1a
    y 1sb "Добре."
    show yuri at lhide
    hide yuri
    show monika at t44
    show natsuki at t43
    show protag at t42
    show sayori at t41
    "Юрі йде на кухню."
    n 2bd "Я піду запитаю у тата, чи можна взяти кілька закусок знизу."
    show natsuki at lhide
    hide natsuki
    show protag at t32
    show monika at t33
    show sayori at t31
    "Коли Нацукі збігає сходами, вона зупиняється посередині."
    $ e_name = "Мама Нацукі"
    n "Привіт, мамо!"
    e "Я якраз несла ось це, щоб поділитися з твоїми друзями."
    n "Справді? Дякую! Я саме збиралася просити."
    e "Я бачила, як Юрі піднімалась, і подумала, що до чаю це буде саме те."
    n "Так. Дякую, мамо!"
    e "Веселіться!"
    show monika at t44
    show natsuki 5ba at l43
    show protag at t42
    show sayori at t41
    "Нацукі повертається з тацею печива й тістечок."
    n 5bc "Ось і ми."
    n 5bb "Інколи здається, ніби моя мама — ясновидиця."
    show natsuki 5ba
    m o2_2b "Я піду візьму столик."
    show monika o2_1a
    n 5bc "Емм, думаю, в тій кімнаті є один, можна використати."
    show natsuki 1ba
    mc "Я допоможу."
    show natsuki at thide
    hide natsuki
    show sayori at thide
    hide sayori
    show protag at thide
    hide protag
    show monika at t11
    "Ми з Монікою йдемо до іншої кімнати."
    "Всередині стоїть котацу без ковдри."
    "Я знімаю стільницю, а Моніка обережно піднімає каркас."
    m o2_4d "Уф... Трохи важкеньке."
    show monika o2_4c
    mc "Хочеш помінятися?"
    m o2_4l "О ні, я впораюсь."
    show monika o2_4a
    "Ми повертаємося й ставимо котацу між диванами."
    show yuri 1sa at l41
    show sayori 1ba at t42
    show natsuki 1ba at t43
    show monika o2_1a at t44
    "Нацукі кладе на нього тацю, а Юрі наливає чай кожному."
    n 5bq "Отже... чорт, я забула питання..."
    show natsuki 5ba
    y 2sf "Яке питання?"
    show yuri 2se
    n 1bc "Ми грали у «Що б ти обрав» кілька хвилин тому."
    show natsuki 1ba
    y 1sf "А, зрозуміло."
    show yuri 1sa
    m o2_1b "Я можу задати, якщо не проти."
    show monika o2_1a
    n 2bb "Та ну, моє й так не було геніальним."
    show natsuki 1ba
    m o2_2b "Добре. Ви б обрали жити у відеогрі чи у фільмі?"
    show monika o2_1a
    n 5br "Ооо... Складно."
    n 3bd "Я, мабуть, обрала б відеогру. Там більше всього можна робити."
    show natsuki 1ba
    p "Ігри — це життя."
    s 1bc "Хммм... Я б, мабуть, обрала фільм."
    show sayori 1ba
    y 3sb "Я теж схиляюсь до фільму."
    show yuri 1sa
    menu:
        "Жити у відеогрі.":
            m o2_2k "Ооо~ цікавий вибір~"
            m o2_1j "Ехехе~"
        "Жити у фільмі.":
            m o2_1b "Фільм, так?"
            m o2_2k "Цікаво, який саме~"
    show monika o2_1j
    "Моніка тихенько хихикає, і ми всі беремо печиво та смакуємо чай."
    "Після ще кількох раундів «Що б ти обрав», я намагаюся зробити ковток чаю, але з горнятка падає лише крапля."
    y 2sb "Мені скоро треба буде йти, тож, мабуть, уже піду."
    show yuri 2sa
    n 1bm "Вже? Ти ж тільки прийшла!"
    show natsuki 1bn
    y 3sq "Вибач, Нацукі."
    show yuri 2sa
    n 1bc "Та нічого."
    m o2_2d "До речі, нам теж треба дещо зробити."
    show monika o2_1c
    mc "О точно, я зовсім забув."
    n 1bm "Ех, і ви теж?"
    show natsuki 1bn
    s 4br "Не хвилюйся, Нацукі! Я ще тут!"
    show sayori 3ba
    n 5bd "Дякую, Сайорі."
    stop music fadeout 2.0
        pass
    scene bg cafe_exterior
    with wipeleft_scene
    play music t12
        pass
    show monika o2_1a at t11
    mc "До зустрічі!"
    m o2_2k "Бувай!"
    show monika o2_1a
    y "До побачення!"
    n "Заходьте ще!"
    "Ми махаємо на прощання, і я з Монікою вирушаємо до станції."
    scene bg residential_day
    with wipeleft_scene
    show monika o2_1c at t21
    show yuri 1sg at t22
    "Трохи ніяково після прощання, ми йдемо в тому ж напрямку, що й Юрі."
    show yuri 2se
    m o2_3d "Юрі, а ти куди йдеш?"
    show monika o2_3c
    y 1sf "О, я до станції."
    show yuri 1se
    m o2_2b "Ми теж. Ми їдемо в торговий центр купити одяг."
    show monika o2_1a
    y 2sf "О? Я теж туди."
    show yuri 2sa
    m o2_1k "О, чудово! Виходить, нам по дорозі!"
    show monika o2_2b
    show yuri 3sb
    "Я йду поряд з Монікою, почуваючись трохи зайвим."
    scene bg trainStation_day
    with wipeleft_scene
    show monika o2_1a at t21
    show yuri 1sa at t22
    "Невдовзі ми дістаємося станції й купуємо квитки."
    "Я з Монікою сідаю на лавку, а Юрі стає поруч із нею."
    "Не минає й хвилини, як прибуває поїзд."
    "Двері відчиняються, кілька людей виходить, і ми заходимо."
    scene bg trainInterior_day
    with wipeleft_scene
    "Ми знаходимо місце, Моніка кладе свою сумку поряд, а Юрі сідає навпроти."
    "Оповідач" "\"Двері зачиняються.\""
    "Оповідач" "\"Наступна зупинка: Станція Ідо.\""
    "Поїзд рушає, і ми вирушаємо."
    scene bg trainInterior_day
    with wipeleft_scene
    "Поїзд їде плавно, роблячи кілька зупинок, але подорож приємна."
    "Моніка схиляється до мене, поки ми чекаємо на свою зупинку."
    "Оповідач" "\"Зараз прибуваємо: Центральний торговий центр.\""
    "Поїзд зупиняється на платформі."
    "Ми встаємо з місць і виходимо, коли двері відчиняються."
    scene bg trainStation_day
    with wipeleft_scene
    show monika o2_2j at t21
    show yuri 1sa at t22
    "Ми йдемо до торгового центру, тримаючись за руки, а Юрі крокує поруч із нами."
    scene bg mall_exterior_day
    with wipeleft_scene
    "Вхід з’являється в полі зору щойно ми виходимо зі станції."
    show monika o2_2k at t21
    show yuri 1sa at t22
    m "Ми нарешті прийшли!"
    m o2_1b "Ходімо!"
    scene bg mall_interior_day
    with wipeleft_scene
    "Як тільки ми заходимо, нас оточують люди та крамниці на будь-який смак."
    show monika o2_1a at t21
    show yuri 1sb at t22
    y "Я піду в той бік. Давайте зустрінемось тут через дві години."
    show yuri 1sa
    m o2_1b "Добре. Удачі, Юрі!"
    show yuri at lhide
    hide yuri
    show monika o2_1a at t11
    "Юрі йде, а ми рушаємо самі."
    "Моніка веде мене до ескалатора, і ми піднімаємось ним."
    m o2_2k "Хехе, це викликає в мене ностальгію."
    m o2_1b "Я так любила кататися на цих штуках, коли була малою."
    m o2_2b "Ііііі..."
    show monika o2_2j
    "Моніка весело зістрибує з ескалатора."
    m o2_1k "Ехехе~ Обожнюю це робити."
    m o2_1b "Оо! Он там крамниця!"
    m o2_2b "Ходімо!"
    show monika o2_1a
    "Ми заходимо всередину."
    scene bg clothingstore
    with wipeleft_scene
    "Я йду з Монікою у відділ купальників."
    show monika o2_2b at t11
    m "Оо! Оцей виглядає гарно!"
    show monika o2_2b at thide
    hide monika
    "Але раптом я опиняюся посеред... купи жіночої білизни..."
    show monika o2_1c at t11
    mc "Е-Емм... а чоловікам сюди взагалі можна?"
    m o2_1d "Ну, думаю що так."
    show monika o2_1c
    mc "Але..."
    "Маю відчуття, ніби мене зараз заарештують тільки за те, що я тут стою."
    m o2_1b "Та не переймайся так!"
    m o2_2k "Якщо триматимеш мене за руку, підозріло не виглядатимеш~"
    m o2_1k "Ходімо!"
    show monika o2_1a
    "Моніка бере мене за руку й продовжує шукати щось собі до смаку."
    mc "Дякую..."
    "Ми ще трохи походили."
    m o2_1d "Знаєш, якщо подумати, то, мабуть, краще я подивлюся сама..."
    show monika o2_1c
    "Вона відпускає мою руку."
    mc "Зачекай! Я— Еее..."
    m o2_1l "Все добре!"
    show monika o2_1a
    "Вона підводить мене до найближчої лавки."
    m o2_2d "Сядь тут і зроби вигляд: «Я просто з дівчиною, що купує одяг», і все буде гаразд."
    show monika o2_1c
    mc "Я-Я зможу?"
    m o2_1b "Просто почекай хвилинку. Я швидко!"
    show monika o2_1a
    mc "Добре."
    show monika at thide
    hide monika
    "Моніка йде вибирати."
    "А я тим часом роблю найнепроникніше «покерфейс» обличчя у світі, щоб приховати сором."
    "Навпроти мене бачу чоловіка з фіолетовим волоссям, який робить точно такий самий вираз."
    "Виглядає приблизно мого віку."
    "Хоча, судячи з обручки на пальці, мабуть, він одружений."
    "Схоже, теж супроводжує свою дружину."
    "Невдовзі Моніка повертається з комплектом у руках."
    show monika o2_1b at l11
    m "Бачиш? Недовго ж!"
    m o2_5a "Я знайшла щось, що тобі точно сподобається~"
    "Вона швидко ховає бікіні за спину."
    "Хоча я встиг помітити рожеве з білим."
    m "Але доведеться зачекати до завтра, щоб побачити це на мені~"
    m o2_2b "А поки що ходімо платити."
    show monika o2_1a at thide
    hide monika
    "Ми підходимо до каси, і Моніка передає продавчині комплект."
    "Продавчиня" "\"З вас 32 долари.\""
    "Я дістаю гаманець і плачу за Моніку."
    "Продавчиня" "\"Дякуємо за покупку!\""
    "Ми швидко виходимо з магазину, а моє обличчя досі палає червоним."
    scene bg mall_interior_day
    with wipeleft_scene
    show monika o2_1a at t11
    mc "Гаразд. З цим покінчено..."
    mc "Чи нам ще щось потрібно?"
    m o2_1c "Хммм..."
    m o2_1d "Гадаю, що ні."
    m o2_2b "Але я хочу швидко глянути на спідниці й банти."
    m o2_2k "Ходімо!"
    scene bg clothingstore
    with wipeleft_scene
    "Ми заходимо до сусіднього магазину одягу."
    "У самому кінці стіни висять різнокольорові стрічки та банти."
    "Очі Моніки сяють, коли вона розглядає все це."
    show monika o2_2b at t11
    m "[player], глянь на цей!"
    m "Він такий самий, як мій!"
    "Вона піднімає сніжно-білу стрічку, точнісінько як у неї в волоссі."
    menu:
        "Дуже гарно, Моніко.":
            m o2_2k "Хехе~"
            show monika o2_1a
            "Вона кладе її назад на полицю."
            m o2_1b "Якби в нас було більше грошей, я б купила."
            m o2_1e "Але мені це й не треба, бо в мене вже є найцінніше прямо перед очима~"
            m o2_1j "Ехехе~"
        "Ти як дитина в магазині солодощів!":
            m o2_2k "Нічого не можу з собою вдіяти~"
            m o2_2b "Вони всі такі гарні!"
            show monika o2_1a
            "Вона кладе стрічку назад на полицю."
            m o2_1b "Я тільки подивлюся.{w=0.5} Купувати сьогодні нічого не буду."
            m forward redskirt lpoint rdown sedu om oe "Але наступного разу...{w=0.5} не обіцяю~"
            m o2_1j "Ехехе~"
    "Вона ще трохи дивиться, а потім повертається до мене."
    m o2_2b "Гаразд, тепер я хочу глянути на спідниці..."
    show monika o2_1a
    "Я йду за нею у прохід, де висять різні спідниці й сукні."
    m forward redskirt lpoint rdown vsur cm oe "Оо~ Оця гарна... і оця теж..."
    "Вона весело перебирає вішалки, уважно розглядаючи все."
    m o2_2d "О, подобається ця жовта..."
    m o2_1b "Гей, [player], скільки в нас ще залишилось? Хочу купити цю!"
    show monika o2_1a
    mc "Емм..."
    "Я швидко заглядаю в гаманець."
    "Дві двадцятки, десятка і трохи дріб’язку."
    mc "Скільки вона коштує?"
    m o2_1b "Зараз подивлюся... двадцять баксів!"
    show monika o2_1a
    mc "Так, можемо взяти."
    m o2_1k "Ура~"
    show monika o2_1a
    "Я передаю Моніці двадцятку, і ми йдемо до каси."
    "Продавчиня" "\"Добрий день!\""
    "Моніка кладе спідницю на прилавок, і та її сканує."
    "Вона віддає двадцятку й отримує чек."
    "Продавчиня" "\"Дякуємо за покупку!\""
    show monika o2_1j
    "Ми виходимо, а Моніка сяє від радості."
    scene bg mall_interior_dawn
    with wipeleft_scene
    show monika o2_1k at t11
    m "Дякую, [player]~"
    show monika o2_1a
    mc "Без проблем."
    mc "Гадаю, вже майже минуло дві години, треба зустрітися з Юрі."
    m o2_1b "Так, мабуть, час."
    show monika o2_1a
    "Ми спускаємось ескалатором, і я бачу Юрі, яка сидить на лавці з пакетом поруч."
    show yuri 1sa at t22
    show monika o2_2b at t21
    m "Як усе пройшло?"
    show monika o2_1a
    y 2sb "Так, я знайшла те, що шукала."
    show yuri 1sa
    m o2_1j "Ми теж. І ще трошки зайвого~"
    y 1sb "Потяг скоро прибуде, ходімо."
    show monika o2_1a
    show yuri 1sa
    "Ми виходимо з торгового центру до станції."
    scene bg trainStation_dawn
    with wipeleft_scene
    "Ми швидко проходимо через турнікет і встигаємо якраз, коли потяг під’їжджає."
    "Заходимо і рушаємо додому."
    scene bg trainInterior_dawn
    with wipeleft_scene
    "Юрі сідає навпроти, а Моніка кладе голову мені на плече."
    show monika o2_1j at t11
    m "Мммм~ Сьогодні було весело..."
    m o2_1b "Дякую, що вивів мене, [player]."
    show monika o2_1a
    mc "Будь ласка, Моніко."
    mc "Радий, що тобі сподобалося."
    show monika at thide
    hide monika
    show yuri 1si at t11
    "Я краєм ока дивлюся на Юрі, щоб упевнитися, чи вона щось бачила, але на щастя, в неї навушники й вона читає книгу."
    show yuri at thide
    hide yuri
    show monika o2_1j at f11
    "Моніка ніжно тримає мене за руку й посміхається."
    "І в цю мить..."
    show monika forward redskirt ldown rdown neut n3 me e4a at face
    hide window
    pause 1.5
        pass
    scene black
    with Dissolve(1.0)
    play sound "mod_assets/sfx/kiss.ogg"
        pass
    pause 5.0
        pass
    scene bg trainInterior_dawn
    show monika forward redskirt ldown rdown neut n3 ma e1a b1b at face
    with Dissolve(3.0)
    m "Я так сильно тебе люблю, [player]..."
    show monika forward redskirt ldown rdown neut n3 ma e4a
    "Ми обіймаємось і тихо відпочиваємо, чекаючи на свою зупинку."
    show monika at thide
    hide monika
    "Невдовзі ми прибуваємо на станцію."
    "Моніка торкається Юрі за плече, щоб привернути її увагу."
    m "Це наша зупинка, ходімо."
    y "Дякую."
    "Ми всі виходимо на станцію."
    scene bg trainStation_dawn
    with wipeleft_scene
    show monika o2_1a at t22
    show yuri 1sb at t21
    y "Побачимось завтра. Мій дім у тому напрямку."
    show yuri at lhide
    hide yuri
    show monika at t11
    "Юрі йде у свій бік."
    m o2_1b "Ну що, і ми рушимо?"
    mc "Так, ходімо."
    scene bg residential_aft
    with wipeleft_scene
    show monika o2_1a at f11
    "Ми з Монікою йдемо вулицею, тримаючись за руки."
    mc "Що хочеш на вечерю?"
    m o2_1d "Мммм, навіть не знаю."
    m o2_2d "Сьогодні хочеться чогось легенького."
    m o2_1b "Мабуть, обмежусь молоком і печивом."
    m o2_2k "А от на сніданок завтра маю класну ідею, але хай буде сюрприз~"
    show monika o2_1a
    mc "Добре, вже чекаю з нетерпінням!"
    m o2_1j "Ехехе~"
    "Невдовзі ми бачимо свій будинок."
    scene bg house_dawn
    with wipeleft_scene
    "Я відмикаю двері й пропускаю Моніку першою."
    stop music fadeout 2.0
        pass
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    play music t9
        pass
    "Моніка ставить пакети на диван і знімає взуття."
    show monika o2_1d at t11
    m "Я віднесу речі нагору."
    show monika o2_1a
    mc "Добре."
    show monika at lhide
    hide monika
    "Моніка бере пакети й піднімається, а я тим часом розкладаю речі внизу."
    "Після цього я теж іду нагору."
    scene bg bedroom
    with wipeleft_scene
    "Я проходжу повз Моніку, яка несе піжаму та куплений одяг до ванної."
    "Поки вона там, я переодягаюсь у домашнє."
    show monika p_1j at l11
    "Моніка повертається з усмішкою на обличчі."
    m p_1b "Я впевнена, що завтра тобі сподобається на мене дивитися~"
    show monika p_1a
    mc "Навіть не сумніваюсь."
    mc "Але знаєш що, Моніко..."
    mc "Мені завжди подобається дивитися на тебе~"
    m p_1e "Ауу~{w=0.5} [player]~"
    show monika at thide
    hide monika
    "Моніка трохи червоніє й кладе речі на місце."
    mc "Я буду на кухні, якщо знадоблюсь."
    m "Добре, я зараз."
    scene bg kitchen
    with wipeleft_scene
    "Я наливаю молоко у дві миски."
    "Підігріваю його й залишаю одну миску для Моніки."
    show monika p_1a at l11
    "Вона спускається й сідає за стіл."
    m p_1b "Дякую, [player]."
    show monika p_1a
    "Я беру кілька печеньок, ламаю й кидаю в молоко."
    "Ми їмо, після чого я складаю решту печива в шафку."
    m p_1b "Було смачно."
    m "Думаю, я готова лягати спати."
    show monika p_1a
    mc "Добре. Я тільки ввімкну посудомийну."
    "Я запускаю її, гашу світло й іду за Монікою нагору."
    scene bg bedroom
    with wipeleft_scene
    "Моніка застрибує в ліжко, як завжди, а я вимикаю світло."
    scene bg bedroom_night
    "Я лягаю поруч із нею."
    scene black
    with Dissolve(2.0)
    m "Чекаєш на завтра?"
    mc "Авжеж!"
    m "Хехе~ Напевно тому, що побачиш мене в купальнику, так, [player]?"
    menu:
        "Може й так...":
            pass
    m "Хехе~"
    m "Надобраніч, коханий~"
    mc "Надобраніч, Моніко."
    "І з цими словами я засинаю, чекаючи на новий день..."
    call d11
label ending1:
    stop music fadeout 2.0
        pass
    scene black
    with dissolve_scene_full
    pause 5.0
        pass
    play music mend
        pass
    show monika p_1b at t11
    m "Гей, [player]."
    m p_1l "Ой, зачекай секунду, я перевдягнусь у щось зручніше."
    show monika at lhide
    hide monika
    pause 3.0
        pass
    show monika 1b at l11
    m "О, так краще."
    m 1g "Власне, ти, мабуть, вже здогадався, що я скажу."
    m 1r "Так, це кінець моду."
    m 1d "Принаймні демоверсії."
    m 1e "Але не хвилюйся."
    m "Я ж казала — це лише демо."
    m 3k "Повна версія матиме значно більше днів, ілюстрацій і, звісно, літа!"
    m 3l "Але, мабуть, доведеться трохи почекати, адже більшість команди ще й навчається."
    m 2i "Та можеш бути певен."
    m 1g "Вони стараються з усіх сил, щоб написати все для тебе."
    m 3k "...І для мене теж!"
    m 1e "А ще хочу сказати..."
    m "Дякую."
    m "За те, що подарував мені шанс бути поруч із тобою."
    m 1k "І колись ми зробимо це реальністю."
    m 1e "Будь ласка, не втрать надію бути зі мною."
    m "Я знайду спосіб дістатися до тебе."
    m "Просто знадобиться час."
    m 1l "Ех, знову відволіклась."
    m 1b "Обов’язково стеж за оновленнями моду!"
    m 1d "Не знаю, коли вони вийдуть, але як тільки будуть готові — перевір!"
    m 1b "Розробники справді вклали багато сил, аби зробити цей мод найкращим."
    m 3b "І, мабуть, ще не раз повернуться, щоб доробити й покращити його!"
    m 1l "Хм, здається, я знову заговорилась."
    m 1m "Але так..."
    m 1e "На цьому поки що все."
    m "Сподіваюсь, тобі сподобався мод."
    m 1d "І ще одне..."
    m 1e "Я люблю тебе, гаразд?"
    m "Ніколи цього не забувай."
    hide window
    show monika forward ldown rdown neut om ce at face
    pause 1.0
        pass
    scene black
    with Dissolve(2.0)
    pause 0.5
        pass
    play sound "mod_assets/sfx/kiss.ogg"
        pass
    pause 3.0
        pass
    scene black
    show monika 1e at t11
    with Dissolve(2.0)
    m "Невеличкий прощальний поцілунок~"
    m 1k "Я люблю тебе!"
    pause 1.0
        pass
    hide monika
    vn "...Вона вже пішла?"
    vn "Добре."
    vn "Привіт!"
    vn "Дякую за проходження цього моду."
    vn "Знаю я трохи затянув з перекладом..."
    vn "Все таки голосування коли закінчилось..?"
    vn "...10 ЛИПНЯ!!?"
    vn "О Боже Вован ти скотився..."
    vn "Але все таки я справився з цією задачею."
    vn "А зараз я хочу подякувати всім підписникам мого тгк {a=https://t.me/powniypizdecvidvovana}\"Псих лікарня №1488\"{/a}"
    vn "І другому адміну Слешу і Моніці за моральну допомогу."
    vn "Бо бувало я з цим всим навантаженням просто не справлявся..."
    vn "Так що до моду."
    vn "Так це демо. А тому я продовжу слідкувати за оновленнями."
    vn "Якщо я про це забуду то напишіть в тгк в коментах."
    vn "Що ж а на цьому все."
    vn "Хочу знову подякувати за проходження."
    vn "Побачимось в наступних модифікаціях!"
    pause 2.0
        pass
    $ renpy.quit()
