init:
    $ timer_range = 0
    $ timer_jump = 0
screen countdown:
    timer 0.01:
        repeat True
        action If(time > 0, true=SetVariable('time', time - 0.01), false=[Hide('countdown'), Jump(timer_jump)])
label d2:
    stop music fadeout 2.0
        pass
    scene day2
    with dissolve_scene_full
    window hide
        pass
    pause 5.0
        pass
    scene black
    with dissolve_scene_full
    pause 4.0
        pass
    play sound "mod_assets/sfx/smoke.ogg" loop fadein 10.0
        pass
    pause 5.0
        pass
    "Ух...."
    "Га..?"
    scene bg bedroom
    with wipeleft_scene
    "Я різко підскакую з ліжка, коли чую, як спрацьовує пожежна сигналізація."
    show monika p_1d at t11
    m "Що відбувається?"
    mc "Не знаю, але це не наша сигналізація..."
    mc "Зачекай...."
    show monika pj forward lpoint rdown s_scream
    m "Сайорі!"
    scene bg house
    with wipeleft_scene
    "Ми вибігаємо на вулицю і біжимо до будинку Сайорі."
    scene bg house
    with wipeleft_scene
    "Двері відкриті..."
    "Я бачу трохи диму, що йде зсередини."
    "Я швидко забігаю всередину разом з Монікою."
    scene bg kitchen
    with wipeleft_scene
    show protag 5bv at t21
    show sayori casual turned lup rup cry cm oe at t22
    play music t7
        pass
    "Коли я вбігаю на кухню, бачу, як ГГ гасить дуже чорну сковорідку вогнегасником."
    "Сайорі стоїть у кутку і плаче."
    show sayori casual turned lup rup cry om oe at f22
    s "Вибачте!!"
    show monika pj forward ldown rdown doub cm oe at l31
    show protag 5bw at f32
    show sayori casual turned lup rup cry cm oe at t33
    p "Чорт, Сайорі! Це вже {b}ДРУГИЙ{/b} раз, коли ти мало не спалила будинок!"
    p "Тобі заборонено торкатися плити!"
    show protag 5bv at t32
    stop sound
        pass
    "Коли вогонь згас, у сковорідці залишився дуже чорний, обвуглений... млинець?"
    "Здається, це млинець."
    mc "Ем, Сайорі, це... мало бути млинцем?"
    show sayori casual turned lup rup cry cm oe at f33
    s "...так..."
    s casual turned lup rup cry om oe "Я хотіла здивувати ГГ, але не знала, скільки часу треба..."
    show sayori casual turned lup rup cry cm oe at t33
    mc "Що взагалі сталося?"
    show protag 1bs at s32
    p "*зітхає*"
    show protag 5bx at f32
    p "Я зайшов на кухню, коли відчув запах гару. Коли прийшов..."
    show protag 5bv at t32
    show sayori casual turned lup rup cry om oe at f33
    s "Я випадково залишила млинці на плиті!"
    s "І вони загорілися!"
    show sayori casual turned lup rup cry cm oe at t33
    show monika p_1q at t31
    "..."
    stop music fadeout 2.0
        pass
    show monika p_1b at f31
    show protag 5bb at t32
    play music t8
        pass
    m p_2b "Гей, Сайорі."
    show monika p_2a at t31
    show sayori casual turned lup rup cry cm oe at f33
    s "*шморгає*{w=0.5} Так...?"
    show sayori casual turned lup rup cry cm oe at t33
    show monika p_1l at f31
    m "Давай я допоможу тобі зробити ці млинці?"
    show monika p_1a at t31
    show sayori 4bu at f33
    s "*шморгає*{w=0.5} Добре..."
    scene bg house
    with wipeleft_scene
    "Ми йдемо до нашого будинку, а ГГ залишається прибирати безлад."
    "Сайорі бере із собою те, що залишилося від тіста."
    scene bg kitchen
    with wipeleft_scene
    "Моніка і Сайорі йдуть на кухню."
    show monika p_2l at t22
    show sayori 4bl at t21
    "Сайорі починає смажити млинець, а Моніка показує їй, на що звертати увагу і коли перевертати."
    show sayori 3br
    show monika p_1j
    "Через деякий час, після кількох невдач, вони приносять цілу стопку свіжих млинців."
    "Щойно вони закінчують, ГГ теж заходить у двері."
    show monika p_1j at t33
    show sayori 1bq at t32
    show protag 1ba at l31
    "Всі сідають і беруть собі млинці."
    "Моніка приносить кілька топінгів, і ми додаємо все, що нам подобається."
    "Сайорі набиває свій млинець джемом і вершками."
    "ГГ намазує шоколадну пасту і кленовий сироп."
    "Моніка бере джем і змішує його з кленовим сиропом."
    "Я додаю свої улюблені топінги, і ми всі починаємо їсти."
    show sayori 3br at f32
    s "Смаааачно!"
    s "Вони такі смачні!"
    s 2bx "Дякую, що показала мені, як їх готувати, Моніка!"
    show sayori 1ba at t32
    show monika p_2n at f33
    m "Без проблем, Сайорі."
    m p_2l "Тільки наступного разу не забувай засікати час."
    m "І якщо побачиш дим — знімай з плити."
    m "Інакше ГГ знову розсердиться."
    show monika p_1a at t33
    show sayori 1ba at t32
    show protag 1ba at t31
    "Ми всі доїдаємо сніданок."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    show protag 2bl at t31
    show sayori 4br at t32
    show monika p_1k at t33
    "Сайорі і ГГ йдуть до дверей, а ми виходимо слідом."
    scene bg house
    with wipeleft_scene
    show sayori 1ba at t21
    show protag 1ba at t22
    m "До зустрічі!"
    show sayori 2br at f21
    s "Бувай!"
    show sayori 2br at thide
    hide sayori
    show protag 1ba at thide
    hide protag
    "Вони повертаються до свого будинку."
    "Моніка і я заходимо назад."
    scene bg kitchen
    with wipeleft_scene
    show monika p_1c at t11
    mc "Я помию посуд. А ти можеш піти нагору і підготуватися до дня."
    m p_1b "Добре! Дякую, [player]!"
    show monika p_1b at thide
    hide monika
    "Моніка йде нагору, а я починаю мити посуд."
    show monika h1_2j at t11
    "Через кілька хвилин Моніка повертається і допомагає прибирати стіл."
    "Ми закінчуємо за 5 хвилин і йдемо нагору."
    scene bg bedroom
    with wipeleft_scene
    show monika h1_1a at t11
    mc "Гаразд, давай зробимо ці брошури."
    mc "Якщо закінчимо сьогодні, завтра будемо вільні!"
    m h1_3b "Ось що мені потрібно, щоб ти зробив..."
    "Моніка перераховує всі матеріали і кроки для створення брошур."
    show monika h1_1j
    "Ми беремося до роботи."
    "Нам потрібно близько 15 хвилин, щоб розробити і надрукувати брошури."
    if persistent.cookd2 == True:
        mc "Моніка, ти можеш тут прибрати, поки я почну готувати обід?"
        m h1_1b "Звісно, вперед!"
        show monika h1_1a
        "Я йду на кухню."
    else:
        mc "Моніка, я тут приберу, а ти можеш почати готувати обід."
        m h1_1b "Добре, дякую, [player]!"
        show monika at thide
        hide monika
        "Моніка йде вниз."
        "Я прибираю і складаю брошури у дві стопки."
        "Вимикаю комп'ютер і спускаюся вниз, де вже пахне смачною їжею."
    scene bg kitchen
    with wipeleft_scene
    if persistent.cookd2 == False:
        "Я спускаюся, і Моніка знімає з плити овочеве соте."
        show monika h1_1k at t11
        m "Вчасно!"
        m h1_3b "Я приготувала овочеве соте і суп!"
        show monika h1_1a
        mc "Пахне чудово!"
        m h1_1k "Сподіваюся, тобі сподобається~"
        show monika h1_1a
        "Я беру дві тарілки і сідаю з Монікою."
        "Наливаю суп у свою миску, Моніка теж бере собі."
        m h1_3b "Давай їсти!"
        show monika h1_1j
        "Я пробую ложку."
        "Смак насичений!"
        "Це простий суп, але дуже смачний!"
        mc "Це неймовірно!"
        m h1_1k "Справді? Я рада, що тобі подобається~!"
        show monika h1_1a
        mc "Не тільки сніданок був смачний, а й це."
        mc "Моніка, ти справді талановита кухарка!"
        m h1_1e "Ой~ Дякую, [player]~"
        m h1_1k "Я приготую для тебе будь-коли!"
        "Ми доїдаємо суп, і я беру порцію соте."
        "Я пробую і його."
        "Суміш овочів створює чудовий смак."
        "Не знаю, як вона це робить."
        mc "Смачно!"
        m h1_1j "Хе-хе~"
        m h1_1k "Я рада, що тобі подобається~"
        show monika h1_1a
        mc "Дякую, Моніка."
        mc "Не думаю, що зміг би зробити щось таке смачне."
        m h1_1b "Ну, ти ніколи не дізнаєшся, якщо не спробуєш!"
        show monika h1_1a
        mc "Справедливо."
        show monika h1_1j
        "Ми продовжуємо їсти, і Моніка щасливо усміхається, знаючи, що приготувала дуже ситну страву."
        jump d2ext
    else:
        "Гаразд, давай готувати..."
        call cookinggame1
label d2contcook:
    stop music fadeout 1.0
        pass
    scene bg kitchen
    with wipeleft_scene
    play music t6
        pass
    if reci == "Stirfry":
        "Коли овочі досмажуються, я швидко накриваю на стіл."
        mc "МОНІКА!"
        "Я гукаю Моніку, несучи сковорідку."
        mc "Обід готовий!"
        m "Йду!"
        show monika h1_1j at l11
        m "Ммм~"
        m h1_3b "Пахне смачно!"
        show monika h1_1a
        mc "Радий, що тобі подобається, але перш ніж хвалити, краще спробуй!"
        m h1_4k "Ну, не відмовлюся~"
        show monika h1_1j
        "Ми сідаємо, і Моніка накладає собі овочі."
        "Я роблю так само."
        m h1_2b "Давай їсти~!"
        show monika h1_1q
        "Моніка їсть овочі виделкою."
        show monika forward blueshirt ldown rdown neut n3 mb e2a
        "Її очі сяють від радості!"
        "Здається, мені вдалося!"
        m h1_3k "Це чудово!"
        m "Я й не знала, що ти такий хороший кухар~!"
        show monika h1_1a
        mc "Нічого особливого."
        mc "Але дякую, це багато значить!"
        m h1_1j "Ехехе~!"
        "Вона швидко доїдає все на тарілці."
        m h1_1b "Ще, будь ласка~"
        mc "Ти починаєш звучати як Сайорі."
        m h1_1l "Не можу втриматися!"
        m "Твоя їжа просто надто смачна~!"
        show monika h1_1a
        mc "Ахаха!"
        show monika h1_1j
        "Вона бере ще одну порцію соте."
        "Я, мабуть, найщасливіша людина у світі зараз,{w=0.5} бо можу дивитися, як моя кохана насолоджується їжею, яку я для неї приготував."
        "Ми обидва насолоджуємося обідом разом."
    if reci == "Soup":
        "Поки суп кипить, я трохи думаю."
        "..."
        "Ага!"
        "Кидаю лавровий лист, поки кипить."
        "...або два!"
        "Він продовжує добре кипіти, і я пробую його через кілька хвилин."
        "..."
        "Здається, готово."
        "Вимикаю плиту і накриваю на стіл."
        mc "МОНІКА!"
        "Я гукаю Моніку, несучи каструлю."
        mc "Обід готовий!"
        m "Йду!"
        show monika h1_1j at l11
        m "Ммм~"
        m h1_3b "Пахне смачно!"
        show monika h1_1a
        mc "Радий, що тобі подобається, але перш ніж хвалити, краще спробуй!"
        m h1_4k "Ну, не відмовлюся~"
        show monika h1_1j
        "Ми сідаємо, і Моніка наливає собі суп."
        "Я роблю так само."
        m h1_2b "Давай їсти~!"
        show monika h1_1q
        "Моніка їсть ложку супу."
        show monika forward blueshirt ldown rdown neut n3 mb e2a
        "Її очі сяють від радості!"
        "Здається, мені вдалося!"
        m h1_3k "Це чудово!"
        m "Я й не знала, що ти такий хороший кухар~!"
        show monika h1_1a
        mc "Нічого особливого."
        mc "Але дякую, це багато значить!"
        m h1_1j "Ехехе~!"
        "Вона швидко доїдає все."
        m h1_1b "Ще, будь ласка~"
        mc "Ти починаєш звучати як Сайорі."
        m h1_1l "Не можу втриматися!"
        m "Твоя їжа просто надто смачна~!"
        show monika h1_1a
        mc "Ахаха!"
        show monika h1_1j
        "Вона бере ще одну миску супу."
        "Я, мабуть, найщасливіша людина у світі зараз,{w=0.5} бо можу дивитися, як моя кохана насолоджується їжею, яку я для неї приготував."
        "Ми обидва насолоджуємося обідом разом."
    if reci == "Potato Salad":
        "Я закінчую салат і ставлю його на стіл."
        mc "МОНІКА!"
        "Я гукаю Моніку, накриваючи на стіл."
        mc "Обід готовий!"
        m "Йду!"
        show monika h1_1j at l11
        m "Ммм~"
        m h1_3b "Виглядає смачно!"
        show monika h1_1a
        mc "Радий, що тобі подобається, але перш ніж хвалити, краще спробуй!"
        m h1_4k "Ну, не відмовлюся~"
        show monika h1_1j
        "Ми сідаємо, і Моніка накладає собі салат."
        "Я роблю так само."
        m h1_2b "Давай їсти~!"
        show monika h1_1q
        "Моніка їсть виделкою."
        show monika forward blueshirt ldown rdown neut n3 mb e2a
        "Її очі сяють від радості!"
        "Здається, мені вдалося!"
        m h1_3k "Це чудово!"
        m "Я й не знала, що ти такий хороший кухар~!"
        show monika h1_1a
        mc "Нічого особливого."
        mc "Але дякую, це багато значить!"
        m h1_1j "Ехехе~!"
        "Вона швидко доїдає все на тарілці."
        m h1_1b "Ще, будь ласка~"
        mc "Ти починаєш звучати як Сайорі."
        m h1_1l "Не можу втриматися!"
        m "Твоя їжа просто надто смачна~!"
        show monika h1_1a
        mc "Ахаха!"
        show monika h1_1j
        "Вона бере ще одну порцію салату."
        "Я, мабуть, найщасливіша людина у світі зараз,{w=0.5} бо можу дивитися, як моя кохана насолоджується їжею, яку я для неї приготував."
        "Ми обидва насолоджуємося обідом разом."
    m h1_1d "Гей, {i}[player]{/i}..."
    m h1_2d "Ти добре готуєш у реальному житті?"
    menu:
        "Так.":
            m h1_1b "А яка на смак твоя їжа?"
            menu:
                "Дуже смачна!":
                    m h1_2k "Це чудово!"
                    m h1_1b "Сподіваюся, ти колись приготуєш щось для мене~"
                "Не дуже...":
                    m h1_1j "Хе-хе-хе~ Все добре!"
                    m h1_2b "Коли я перейду у твій світ, ми зможемо спробувати приготувати разом!"
        "Ні.":
            m h1_1m "О, гаразд."
            m h1_4b "А ти хотів би навчитися?"
            menu:
                "Так.":
                    m h1_1k "Чудово!"
                    m h1_1b "Коли я перейду у твій світ, я обов'язково навчу тебе готувати!"
                "Ні.":
                    m h1_3d "О,{w=0.5} чому?"
                    menu:
                        "Я не люблю готувати.":
                            m h1_1l "А..."
                            m h1_2b "А якщо я буду поруч? Хотів би приготувати зі мною?"
                            menu:
                                "Так.":
                                    m h1_1k "Чудово!"
                                    m h1_1b "Я з нетерпінням чекаю цього!"
                                "Ні.":
                                    m h1_1p "О..."
                                    m "Гаразд..."
                        "Я не впевнений, що в мене вийде...":
                            m h1_1l "О..."
                            m h1_1b "Не хвилюйся."
                            m h1_2b "Коли я перейду у твій світ, я навчу тебе готувати!"
                            m h1_1k "Хто знає, може потім ти приготуєш щось сам для мене~"
label d2ext:
    stop music fadeout 2.0
        pass
    scene bg kitchen
    with wipeleft_scene
    play music t8
        pass
    "Коли все закінчено, я мию посуд, а Моніка прибирає зі столу."
    mc "Гей, Моніка?"
    show monika h1_1c at l11
    m "Гм?"
    mc "Коли ми закінчимо тут на кухні, хочеш прогулятися надворі?"
    m h1_2b "Звісно!"
    show monika h1_2b at thide
    hide monika
    "Я починаю прибирати на кухні."
    "Моніка бере кілька тарілок зі столу і починає їх мити."
    scene bg kitchen
    with wipeleft_scene
    "Незабаром ми закінчуємо прибирання."
    "Я швидко готую дві пляшки води для прогулянки."
    show monika h1_2j at t11
    "Я кладу дві пляшки у невеликий рюкзак."
    hide window
    pause 3.0
        pass
    "Я трохи дивлюся на Моніку."
    "Бачу її усмішку."
    show monika h1_2a
    "Вона завжди зігріває моє серце."
    show monika h1_1m
    "Ці красиві зелені очі..."
    "Це чудове коралово-каштанове волосся..."
    m h1_3l "Ем, [player]?"
    mc "Га...?"
    m "Ти трохи задумався~!"
    mc "Ой, вибач..."
    m h1_1m "Все добре."
    m h1_1n "До речі,{w=0.5} я теж часто ловлю себе на тому, що дивлюся на тебе..."
    m h1_1k "Ехехе~!"
    "Вона трохи сміється, а я червонію."
    mc "Гаразд, ти готова йти?"
    m "Ще ні~!"
    m "Я швидко переодягнуся у щось більш підходяще для погоди."
    m "Я зараз повернусь!"
    show monika h1_4j at lhide
    hide monika
    "Моніка біжить нагору."
    "Я б хотів-{nw}"
    m "[player]~!"
    "Моніка гукає з другого поверху."
    m "Можеш піднятися сюди на хвилинку~?"
    mc "Звісно, зараз буду!"
    scene bg bedroom
    with wipeleft_scene
    show monika o2_1b at t11
    m "Ну як? Як тобі?"
    show monika o2_1a
    menu:
        "Ти виглядаєш чудово!":
            m o2_5a "Дякую тобі, любий~"
    menu:
        "Мод дав тобі всі ці наряди?":
            m o2_1k "Так!"
            m o2_1b "І ще кілька інших!"
            menu:
                "Можеш показати їх мені?":
                    m o2_1b "Може, пізніше.{w=0.5} Давай спочатку прогуляємося, гаразд?"
                    menu:
                        "Гаразд!":
                            m o2_1j "Хе-хе-хе~"
                            m o2_1b "Ну,{w=0.5} чого ми чекаємо тоді?"
    scene bg house
    with wipeleft_scene
    show monika o2_1a at t11
    "Я беру рюкзак з пляшками води, і ми виходимо надвір."
    "Я дивлюся на годинник."
    "3:24."
    "Я замикаю двері, і ми йдемо вулицею."
    scene bg residential_day
    with wipeleft_scene
    show monika o2_1b at t11
    m "Сьогодні такий гарний день~"
    show monika o2_1a
    mc "Так і є."
    mc "Ідеальний час, щоб провести його з коханою людиною~"
    m o2_2k "Ахаха~!"
    m o2_1d "До речі, ти знаєш, що наш клас робить на фестивалі?"
    show monika o2_1c
    mc "Я... не зовсім впевнений."
    mc "Чув від однокласників, що ми нічого не будемо робити."
    show monika o2_1o at s11
    m "О..."
    m o2_1p "Я насправді хотіла щось зробити..."
    show monika o2_1o
    mc "Так..."
    show monika o2_1c at t11
    mc "Але дивись на це з позитивного боку!"
    mc "У нас майже весь день разом!"
    mc "І ми все одно будемо виступати з віршами у клубі!"
    mc "Тільки ми удвох, і фестиваль для дослідження!"
    m o2_1q "...Ти правий."
    m o2_4k "У понеділок давай розважимось на повну!"
    show monika o2_1a
    mc "Ось це настрій!"
    "Ми йдемо, поки не доходимо до входу в парк."
    stop music fadeout 2.0
        pass
    scene bg park2
    with wipeleft_scene
    show monika o2_1a at t11
    play music t9
        pass
    "Ми заходимо, і відчувається особливий спокій."
    "Сідаємо на лавку."
    mc "Як тобі прогулянка?"
    m o2_1b "Дуже подобається!"
    m o2_2j "Я рада, що ми можемо провести час разом~!"
    mc "Я теж."
    show monika o2_1a
    "Я дивлюся на Моніку, її волосся трохи розвівається на вітрі."
    scene pcg_1
    with Dissolve(2.0)
    "..."
    "Тиша навколо створює дуже приємний момент."
    "Пташки співають, квіти цвітуть..."
    "А сонце яскраво світить у небі."
    "..."
    show pcg_3
    with Dissolve(1.0)
    $ time = 5
    $ timer_range = 5
    $ timer_jump = 'd2slow'
    show screen countdown
        pass
    menu:
        "Я так сильно тебе люблю...":
            hide screen countdown
                pass
            show pcg_5
            m "...Я..."
            show pcg_4
            m "...Я теж тебе люблю~!"
            jump d2cont
label d2slow:
    "..."
    menu:
        "Давай просто посидимо так ще трохи.":
            "..."
            show pcg_5
            m "Я тебе люблю..."
            $ time = 3
            $ timer_range = 3
            $ timer_jump = 'd2cont'
            show screen countdown
                pass
            menu:
                "Я теж тебе люблю...":
                    hide screen countdown
                        pass
                    jump d2cont
label d2cont:
    scene bg park2
    show monika forward redskirt ldown rdown neut n3 ma e4b at face
    with Dissolve(2.0)
    "Ми обіймаємося і сидимо так кілька хвилин."
    "Я відчуваю її ніжні руки навколо себе і міцно тримаю її, поки ми сидимо на лавці."
    "Чую, як природа навколо нас співає свою спокійну музику."
    "І раптом..."
    show monika forward redskirt ldown rdown neut n3 me e4a
    hide window
    pause 1.5
        pass
    scene black
    with Dissolve(1.0)
    play sound "mod_assets/sfx/kiss.ogg"
        pass
    pause 5.0
        pass
    scene bg park2
    show monika forward redskirt ldown rdown neut n3 ma e1a b1b at face
    with Dissolve(3.0)
    m "Ти знаєш, час ніби сповільнюється, коли я з тобою~"
    mc "Так, і я бажаю, щоб так і залишалося..."
    show monika forward redskirt ldown rdown neut n3 ma e4a b1a
    "Я хочу, щоб цей момент тривав вічно..."
    hide window
    pause 5.0
        pass
    "Ми сидимо так, обнявшись, близько 15 хвилин."
    m "[player]..."
    m forward redskirt ldown rdown neut n3 mb e1a b1b "Я б хотіла, щоб це було насправді..."
    m forward redskirt ldown rdown neut n3 mb e4a b1a "Не з твоїм аватаром, а з реальним тобою..."
    m forward redskirt ldown rdown neut n3 mb e1a b1b "Я б хотіла, щоб цей момент тривав вічно..."
    m forward redskirt ldown rdown flus om oe "Я навіть не відчуваю тепла від твого аватара..."
    m forward redskirt ldown rdown neut me e4d b1b "Особливо поцілунку..."
    menu:
        "Я теж цього хочу...":
            m forward redskirt ldown rdown neut n3 md e4d b1d "..."
            m forward redskirt ldown rdown neut n3 mb e1h b1b "Дякую..."
            m o2_1k "Сподіваюся, це станеться скоро..."
        "Я впевнений, що це станеться скоро...":
            m forward redskirt ldown rdown neut n3 md e4d b1d "..."
            m forward redskirt ldown rdown neut n3 mb e1h b1b "Дякую..."
            m o2_1k "Я люблю тебе...{w=0.5} Я люблю тебе, навіть якщо між нами є бар'єр..."
            menu:
                "Я теж тебе люблю, Моніка.":
                    show monika o2_1j
                    "..."
    scene pcg_3
    with Dissolve(2.0)
    "Я відпускаю її, і вона солодко усміхається мені."
    show pcg_2
    m "Ти знаєш, нам слід частіше виходити сюди!"
    show pcg_4
    m "Так ми зможемо проводити трохи більше часу разом!"
    show pcg_1
    mc "Я б не заперечував."
    "Моніка дивиться на годинник і встає."
    scene bg park2
    with Dissolve(1.0)
    show monika o2_1l at t11
    m "Гаразд, нам, напевно, слід йти..."
    mc "Так, але мушу зізнатися,{w=0.5} було приємно отримати таке обіймище..."
    m o2_1k "Я отримала таку ж насолоду, як і ти~"
    m o2_3k "Тепер, ходімо! Дослідимо трохи!"
    show monika o2_1a at t11
    "Ми обидва встаємо і йдемо далі в парк."
    scene bg park2
    with wipeleft_scene
    "Я тримаю Моніку за руку, поки ми йдемо."
    "..."
    "Пташки співають, поки ми проходимо повз дерево за деревом."
    "Ми перетинаємо невеликий пагорб і продовжуємо йти далі. "
    show monika o2_1d at t11
    m "Ти знаєш,{w=0.5} так приємно бути тут отак."
    m "Погода чудова..."
    m "Пташки... сонце..."
    m "Це так... заспокоює."
    m "На відміну від тиші в класі, тут набагато освіжаюче."
    show monika o2_1a
    mc "Так. Я згоден."
    show monika at thide
    hide monika
    "Ми продовжуємо йти, поки не доходимо до іншого кінця парку."
    show monika o2_1c at t11
    m "О, це кінець стежки..."
    m "Напевно, нам слід повернутися."
    mc "Так..."
    mc "Наступного разу я відведу тебе в більший парк, щоб у нас було більше часу."
    m o2_1a "Добре!"
    show monika o2_1a at thide
    hide monika
    "Ми йдемо назад тією ж дорогою."
    scene bg park2
    with wipeleft_scene
    show monika o2_1a at t11
    "Я швидко п'ю з пляшки води, і передаю Моніці її."
    show monika o2_3j at t11
    "Вона також робить кілька ковтків."
    "Ми продовжуємо йти, поки не доходимо до входу, через який увійшли."
    scene bg residential_day
    with wipeleft_scene
    "Сонце повільно починає заходити, поки ми йдемо вулицею."
    "Наші руки міцно тримаються одна за одну."
    show monika o2_1j at f11
    "Вона солодко усміхається мені."
    "Протягом усього часу нашої прогулянки ми насправді не говорили про багато речей."
    "Натомість, це була комфортна тиша."
    "Разом, між нами немає жодної прірви."
    "Моніка притискається до мене з закритими очима."
    "Вона кладе голову мені на плече, поки ми йдемо."
    "Вона повністю покладається на мене, щоб я вів і захищав її."
    "Я відпускаю її руку і обвиваю руку навколо її плеча."
    "Ми продовжуємо прогулюватися, поки не доходимо до нашого дому."
    scene bg house_dawn
    with wipeleft_scene
    show monika o2_1j at f11
    "Коли ми доходимо додому, сонце повільно заходить за горизонт."
    "Моніка все ще притискається до мене."
    "Я відкриваю двері, і ми заходимо всередину."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    "Я кладу рюкзак на диван."
    mc "Ми просто розігріваємо залишки на вечерю?"
    m "Так, давай просто так і зробимо."
    m "Сьогодні я трохи ледача."
    mc "Гаразд. Я піду розігрію."
    m "Добре!"
    scene bg kitchen
    with wipeleft_scene
    "Я беру трохи їжі з сьогоднішнього обіду і кладу в мікрохвильовку."
    "Шкода, що вона втратить свіжий смак..."
    "Але все ще смачно."
    "Їжа закінчує розігріватися, і я виймаю її."
    "Моніка заходить в кімнату в піжамі."
    show monika p_1b at l11
    m "Вже готово?"
    show monika p_1a
    mc "Так! Смачного!"
    show monika p_2j
    "Ми обидва наїдаємося залишками."
    show monika p_2j at thide
    hide monika
    "Я прибираю тарілки, а Моніка йде в вітальню і вмикає телевізор."
    "Я чую, як вона перебирає канали."
    "Я закінчую прибирання і йду до неї."
    scene bg livingRoom_lightsOff
    with wipeleft_scene
    "Моніка розслабилася, поклавши ноги на диван, і створила приємну атмосферу, щоб подивитися щось разом."
    "Єдине джерело світла — телевізор, який Моніка залишила ввімкненим з шоу, яке ось-ось почнеться."
    mc "Отже, що ми дивимося?"
    m "Я не впевнений, але це привернуло мою увагу."
    m "Це аніме про купу шкільних ідолів, здається."
    m "Я думаю, я десь бачила це, коли переглядала щось онлайн."
    mc "Гаразд. Схоже, цікаво..."
    scene black
    with dissolve_scene_full
    "Я сідаю поруч з нею."
    "Моніка запускає шоу, і ми притискаємося один до одного."
    m "Чесно кажучи, я не дуже думала про аніме."
    m "Я завжди проводила час, читаючи."
    m "Ахаха~"
    "Починається перший епізод, і звучить вступна пісня."
    scene m_cg_tvEvent
    with Dissolve(2.0)
    "Моніка дивиться телевізор з дуже 'зацікавленим' виразом обличчя."
    m "Це, здається, гарне шоу."
    mc "Так, дійсно."
    scene black
    with wipeleft_scene
    "Ми дивимося ще кілька хвилин."
    "Врешті-решт, ми доходимо до моменту, коли наближається кульмінація епізоду."
    scene m_cg_tvEvent
    with Dissolve(2.0)
    m "О, здається, зараз почнеться ще одна пісня!"
    "Наче за командою, дівчата в шоу виходять на сцену і починають виступати."
    "Вставна пісня починається, і дівчата починають співати."
    "TV" "{i}~Я відчуваю, що у нас є шанс~{/i}"
    "TV" "{i}~Так... давай рухатися вперед!~{/i}"
    "TV" "{i}~Я не хочу шкодувати про це пізніше, наше майбутнє попереду~{/i}"
    "Моніка уважно слухає і трохи підспівує під ритм."
    m "Мене дивує, як добре зроблені ці пісні."
    m "Виразно, в їх створення було вкладено багато зусиль."
    m "Композиція, спів, анімація..."
    m "Все так гармонійно поєднується!"
    scene black
    with wipeleft_scene
    "Ми продовжуємо дивитися."
    "Приємно бачити, як Моніка сприймає все це."
    "Мене досі дивує, скільки вона знає про музику."
    "Вона все ще практикує гру на піаніно в школі, але я не думав, що вона так багато про це знає."
    "Скоро я, мабуть, куплю їй піаніно, коли буде нагода."
    "Я думаю, їй би це сподобалося..."
    scene m_cg_tvEvent
    with Dissolve(2.0)
    m "Гей, [player],"
    m "Ти дивишся аніме?"
    menu:
        "Так.":
            m "О, гарно."
            m "Як часто ти його дивишся?"
            menu:
                "Іноді.":
                    m "Це приємно."
                    m "Деякі з них, наскільки я знаю, можуть бути шедеврами."
                    m "Я більше люблю читати."
                    m "Але я б з радістю подивилася твоє улюблене аніме колись~"
                    m "Або, можливо, якесь романтичне..."
                    m "Хе-хе~"
                "Щодня.":
                    m "О..."
                    m "Цілий день, чи тільки вранці або ввечері?"
                    menu:
                        "Цілий день.":
                            m "О..."
                            m "Не те, щоб я міг тебе зупинити чи щось таке..."
                            m "Просто..."
                            m "Я не думаю, що це...{w=0.5}корисно..."
                            m "Вибач..."
                            m "Я не хочу бути грубою..."
                            m "Але чи не міг би ти дивитися це...{w=0.5}трохи менше?"
                            m "Твоїм очам теж потрібно відпочити, а не тільки вночі."
                            m "Добре?"
                            m "До речі, давай повернемося до епізоду..."
                        "Тільки вранці.":
                            m "Ах, гаразд!"
                            m "Це гарний початок дня для тебе!"
                            m "Я впевнений, мені б сподобалося починати свій день, лежачи в ліжку з тобою, дивлячись щось, що тобі подобається!"
                        "Тільки ввечері.":
                            m "Відпочинок після важкого дня?"
                            m "Звучить приємно!"
                            m "Я уявляю, як дивлюся аніме з тобою перед сном~"
                            m "Як зараз~"
                            m "Хе-хе~"
        "Ні.":
            m "О, гаразд."
            m "Чому так?"
            menu:
                "У мене немає часу.":
                    m "О, це зрозуміло."
                    m "Можливо, ти зможеш подивитися це на вихідних."
                    m "Я б з радістю провів з тобою вечір так~"
                "Мені просто не подобається.":
                    m "О, зрозуміло."
                    m "У всіх свої смаки."
                    m "Можливо, ми могли б спробувати подивитися щось романтичне разом, що не є аніме."
                    m "Я б з радістю це зробила!"
                    m "Але поки що давай хоча б закінчимо дивитися цю серію."
    scene bg livingRoom_lightsOff
    with dissolve_scene_full
    "Епізод закінчується, і Моніка трохи зітхає."
    show monika p_1e at t11
    m "Я думаю, нам слід йти спати. Вже пізно..."
    mc "Так, я теж так думаю."
    "Ми повільно йдемо вгору в нашу спальню."
    scene bg bedroom_night
    with wipeleft_scene
    "Я лягаю в ліжко, а Моніка лягає поруч зі мною."
    m "Спокійної ночі, солоденький~"
    mc "Спокійної ночі..."
    "Ми обвиваємо руки один навколо одного, і я закриваю очі."
    scene black
    with Dissolve(2.0)
    "Я починаю дрімати, з новим днем з Монікою попереду..."
    call d3
