label d3:
    stop music fadeout 2.0
        pass
    scene day3
    with dissolve_scene_full
    window hide
        pass
    pause 5.0
        pass
    scene black
    with dissolve_scene_full
    pause 4.0
        pass
    "..."
    scene bg bedroom
    with wipeleft_scene
    "Коли я прокидаюся, Моніки поруч немає, як зазвичай."
    "Однак знизу доноситься певний запах."
    "Поки я сонно прокидаюся, чую дзвін каструль."
    "Моніка, мабуть, готує щось на сніданок."
    "Я вирішую піти прийняти душ і переодягнутися у звичайний одяг."
    "Коли я закінчую, спускаюся вниз, щоб побачити, чим займається Моніка."
    scene bg kitchen
    with wipeleft_scene
    show monika h1_3j at t42
    play music t8
        pass
    "Я заходжу на кухню і бачу свіжозварену каву, а Моніка біля плити готує кашу з корицею і трохи цукру."
    mc "Доброго ранку!"
    m h1_3k "Доброго ранку!"
    show monika h1_3a
    "Я беру дві чашки з шафи."
    "Наливаю нам обом каву."
    show monika h1_3a at t11
    "Моніка вимикає плиту і ставить кашу на стіл."
    "Я ставлю чашки на наші місця, беру дві миски і теж ставлю їх."
    "Обережно, Моніка накладає кашу у миски."
    "Аромат кориці наповнює повітря."
    mc "Ммммм~"
    mc "Пахне смачно!"
    m h1_1b "Сподіваюся, тобі сподобається!"
    show monika h1_2j
    "Ми їмо досхочу."
    "Більшість людей думають, що каша — це нудна і проста їжа..."
    "Але те, як вона її готує, має той самий особливе відчуття."
    "Я бачу, що вона вкладає всю душу у ці страви."
    "І це дає результат!"
    show monika h1_1c
    mc "Моніка, я не знаю, як тобі це вдається."
    show monika h1_1a
    mc "Все, що ти готуєш, має особливий шарм!"
    m h1_4b "Пам’ятаєш, що я казала про їжу, зроблену з любов’ю~?"
    m h1_4k "Ахаха~!"
    "Так, це секретний інгредієнт."
    "Любов."
    "Вона робить будь-яку їжу смачнішою, кожну хвилину разом — справжньою мрією..."
    "...І це визначає наш зв’язок."
    show monika h1_1a
    mc "Вона творить справжні чудеса..."
    scene bg kitchen
    with wipeleft_scene
    "Ми закінчуємо сніданок і беремося мити посуд."
    m "Гей, [player]?"
    mc "Гм?"
    show monika h1_2b at l11
    m "Хочеш сьогодні піти на побачення~?"
    show monika h1_2a
    mc "Звісно!"
    mc "Є ідеї куди?"
    m h1_3b "Так!"
    m h1_1b "Пам’ятаєш парк, куди ти водив мене вчора?"
    mc "Ти хочеш піти туди?"
    m h1_3j "Угу~!"
    m h1_4b "Я подумала, що ми можемо взяти їжу і влаштувати пікнік!"
    show monika h1_4a
    mc "Добре."
    m h1_1a "Можна я приготую їжу?"
    mc "Звісно, чому б і ні?"
    mc "Ти все одно готуєш краще за мене."
    m h1_1g "Ой, не кажи так!"
    m h1_1e "Твоя їжа теж дуже смачна~"
    mc "Дякую, але ти все одно краща."
    mc "Я підготую все необхідне, поки ти готуватимеш."
    m h1_3j "Добре!"
    scene black
    with wipeleft_scene
    "Я починаю збирати все, що може знадобитися."
    "Кошик, плед, крем від сонця, спрей від комах..."
    "Хмм..."
    "Я знаходжу старий фрісбі у шафі."
    menu:
        "Взяти з собою":
            $ persistent.fris = True
            "Можливо, ми зможемо використати його."
        "Залишити тут":
            $ persistent.fris = False
            "Може, наступного разу."
    "Я складаю все у рюкзак."
    show bg kitchen
    with wipeleft_scene
    show monika h1_2j at t42
    "Я ставлю кошик на стіл, і Моніка починає складати туди сендвічі та напої, які вона приготувала."
    m h1_2b "Дякую!"
    show monika h1_2j
    "Я ставлю рюкзак біля входу на кухню."
    "Беру дві тарілки і трохи столових приборів, кладу їх у кошик."
    "Наливаю у термоси свіжу каву, яку щойно зварила Моніка."
    "Ставлю їх у кошик, беру ще сіль і перець."
    "Накриваю все плівкою і теж кладу у кошик."
    "Поки Моніка готує ще їжу, я чую, як вона тихо наспівує 'Твою реальність'."
    "Ми продовжуємо готувати речі, і я починаю підспівувати їй..."
    "{i}Що потрібно,{w=0.5} щоб знайти той особливий день~{/i}"
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    show monika h1_1j at t11
    "Ми ставимо всі речі поруч."
    m h1_1b "Я піду переодягнуся у щось гарніше."
    mc "Добре."
    show monika h1_1b at lhide
    hide monika
    "Моніка йде нагору."
    "Я перевіряю сумки, щоб переконатися, що нічого не забули."
    "Я ще трохи шукаю, поки Моніка повертається у гарній сукні."
    show monika o1_1b at l11
    m "Як тобі ця сукня?"
    menu:
        "Ти виглядаєш чудово!":
            m o1_1j "Хе-хе-хе~"
            m o1_5a "Дуже дякую!"
    mc "Готова йти?"
    m o1_2k "Так!"
    show monika o1_1j
    "Я беру рюкзак і кошик."
    "Добре, що ми не взяли багато, тому не важко нести."
    "Я відкриваю двері для Моніки, і ми виходимо надвір."
    stop music fadeout 1.0
        pass
    scene bg house
    with wipeleft_scene
    "Я замикаю двері вільною рукою, і ми вирушаємо до парку."
    scene bg residential_day
    with wipeleft_scene
    show monika o1_1a at t11
    play music t6
        pass
    mc "Добре, що ми закінчили брошури раніше."
    mc "Тепер можемо займатися такими речами, а не працювати над ними."
    m o1_1b "Так!"
    m o1_1l "Думаю, інші члени клубу тільки зараз починають."
    mc "Мабуть..."
    show monika o1_1j
    "Моніка бере іншу ручку кошика, і ми несемо його разом."
    "Ми йдемо тією ж дорогою, що й учора, і швидко доходимо до входу."
    scene bg park2
    with wipeleft_scene
    show monika o1_1a at t11
    "Ми заходимо у парк, і я шукаю гарне місце."
    "Хмм..."
    "Є невелика відкрита галявина, оточена деревами."
    "Але я також бачу велику відкриту площу."
    "Поруч є ставок, який теж здається гарним місцем."
    "Хммм..."
    "Що обрати?"
    menu:
        "Маленька галявина":
            $ persistent.parkchoice = "s"
            pass
        "Велика площа":
            $ persistent.parkchoice = "b"
            pass
        "Біля ставка":
            $ persistent.parkchoice = "p"
            pass
    mc "Давай підемо туди!"
    m o1_1b "Добре!"
    show monika o1_1a
    "Ми йдемо у центр галявини."
    scene bg park2
    with wipeleft_scene
    show monika o1_1j at t11
    mc "Добре, тут гарне місце!"
    mc "Давай розпакуємося тут."
    m o1_1k "Ок!"
    show monika o1_1a
    "Моніка дістає плед і розстеляє його на траві."
    "Я кладу кошик зверху, а Моніка дістає тарілки і прибори з кошика."
    "Я заглядаю у кошик."
    "Там кілька сендвічів, трохи шоколаду, термос з кавою і салат."
    mc "Виглядає чудово!"
    m o1_1k "Хе-хе~ Сподіваюся, тобі сподобається, коли спробуєш!"
    "Я беру два сендвічі і кладу їх на тарілки, поки Моніка наливає каву."
    mc "Ідеальна погода для такого!"
    m o1_1b "Так, справді!"
    show monika o1_1a
    if persistent.fris == False:
        mc "Я сьогодні бачив старий фрісбі у шафі, коли збирав речі."
        m o1_1b "Чудово!{w=0.5} Ти взяв його?"
        show monika o1_1a
        mc "Н{w=0.2}-ні...{w=0.5} Я не думав, що будемо грати."
        show monika o1_1e at s11
        m "О... нічого страшного,{w=0.5} не хвилюйся.{w=0.5} Головне — провести час разом!"
        show monika o1_1b at t11
        m "А тепер давай їсти!"
    else:
        mc "Я взяв фрісбі, тож після їжі пограємо трохи?"
        m o1_1j "Добре!"
        m o1_5a "Але спочатку їжа!"
    show monika o1_1a
    mc "Не можу дочекатися, щоб спробувати!"
    "Ми їмо сендвічі."
    "Вона також дістає салат, і ми насолоджуємося ним."
    "Я беру шоколад з кошика."
    show monika o1_1c
    "Відламу шматочок і простягаю їй."
    mc "Скажи 'ааа'~"
    show monika o1_1k at f11
    m "Аааа~"
    show monika o1_1j at t11
    m "{i}*ням*{/i}"
    "Моніка їсть шоколад."
    m o1_1b "Тепер моя черга!"
    "Вона теж відламує шматочок."
    show monika o1_2k at f11
    m "Аааа~"
    show monika o1_2j
    "Я теж їм шоколад."
    "Ми по черзі годуємо одне одного шоколадом, поки плитка не закінчується."
    show monika o1_2m at s11
    m "Ой, це все?"
    m "Треба було взяти більше..."
    mc "Не хвилюйся, вдома ще є!"
    show monika o1_1j at t11
    m "Хе-хе~ Добре..."
    if persistent.fris == True:
        mc "Ну, якщо ми закінчили їсти, давай пограємо з фрісбі!"
        m o1_1k "Ахаха~ Добре!"
        "Я дістаю фрісбі з рюкзака, і ми відходимо трохи один від одного."
        show monika o1_1a
        "Я кидаю фрісбі Моніці."
        "Вона ловить і кидає назад."
        "Але вітер зносить фрісбі вбік, і воно падає на землю."
        show monika o1_1k
        "Моніка сміється, поки я біжу за ним."
        m "Ахаха~!"
        mc "Дуже смішно..."
        "Поки вона трохи відволіклася, я кидаю фрісбі сильніше."
        "Цього разу вітер дме мені назустріч, і фрісбі просто перевертається і легко вдаряє мене по голові."
        show monika forward dress lpoint rdown laug om ce
        "Моніка бачить це і починає сміятися."
        m "Ахахаха!"
        "Хммм"
        "Я кидаю фрісбі ще раз."
        "Цього разу, поки Моніка сміється, вітер ніжно підхоплює фрісбі і воно падає їй на голову."
        show monika forward dress ldown rdown vsur cm oe
        "{i}Влучно!{/i}"
        "Вона бере фрісбі з голови."
        m o1_2d "Як ти це зробив?"
        mc "Магія!"
        m o1_2b "Добре, тепер моя черга!"
        show monika o1_2j
        "Вона кидає фрісбі."
        "Поки воно летить, сильний порив вітру відносить його далі."
        show monika o1_1a
        mc "За ним!"
        show monika o1_1j
        "Ми біжимо за фрісбі."
        scene black
        with wipeleft_scene
        "Щойно воно падає, я стрибаю і ловлю його перед землею."
        play sound fall
            pass
        "Я приземляюся з глухим ударом."
        m "Ти в порядку?"
        mc "Ух..."
        mc "Так, все добре."
        "Я перевертаюся на спину."
        "Моніка лягає поруч."
        scene bg sky
        with wipeleft_scene
        m "Ахаха~!"
        mc "Вітер справді творить дива."
        m "Так..."
        m "Я досі не можу повірити, як ти влучно кидаєш фрісбі."
        mc "Та ні, це просто вітер."
    else:
        mc "Ну, якщо ми закінчили їсти, давай трохи відпочинемо."
        m "Звісно!"
        "Ми лягаємо на землю."
        scene bg sky
        with wipeleft_scene
    m "Подивись туди."
    "Вона показує на дивну хмару."
    m "Вона схожа на качку!"
    "Я трохи прищурююсь."
    mc "О, так, справді!"
    mc "Подивись на ту!"
    "Я теж показую на хмару."
    mc "Вона схожа на бантик!"
    "Ми ще трохи показуємо одне одному різні хмари і уявляємо, що це може бути."
    "Ми сміємося, а потім просто тихо тримаємося за руки, дивлячись у гарне синє небо."
    m "Якби це був справжній ти..."
    m "Приємно бути з твоїм аватаром, ніби це ти."
    m "Але я все одно хочу, щоб це було насправді..."
    m "Дивитися на небо... показувати хмари... тримати за руку..."
    menu:
        "Я теж, Моніка...":
            m "..."
            m "Ну..."
            m "Я все одно щаслива."
            m "Я просто завжди хвилююся, що тобі сумно, що ти не зі мною..."
            menu:
                "Не хвилюйся, Моніка.":
                    menu:
                        "Я люблю тебе, незважаючи ні на що.":
                            m "..."
                            m "Я теж тебе люблю..."
                            m "Я люблю тебе всім серцем."
        "Я думав, що це зробить тебе щасливою...":
            m "Я справді щаслива!"
            m "Я просто...{w=0.5} хочу, щоб ти теж був щасливий..."
            menu:
                "Я щасливий.":
                    m "..."
                    menu:
                        "Я щасливий, якщо ти щаслива.":
                            m "..."
                            m "Тоді..."
                            m "Тоді я найщасливіша дівчина у світі!"
                "Дякую...":
                    menu:
                        "Давай будемо сподіватися, що колись ми будемо разом по-справжньому.":
                            m "Так..."
                            m "Я люблю тебе..."
                            menu:
                                "Я теж тебе люблю.":
                                    pass
    "Я дивлюся на годинник."
    "5:24."
    mc "Гей, Моніка..."
    m "Гм?"
    mc "Мабуть, нам слід збиратися."
    mc "Вже вечоріє, а завтра ще фестиваль."
    m "Так, ти правий..."
    m "Шкода, що не можна залишитися довше..."
    "Моніка встає, і я теж."
    scene bg park2
    with wipeleft_scene
    "Я починаю збирати всі речі."
    "Моніка кладе залишки у миску для салату і накриває тарілкою."
    "Я збираю плед і все інше у рюкзак."
    show monika o1_1j at t11
    "Знову ми разом несемо кошик і йдемо додому."
    scene bg residential_day
    with wipeleft_scene
    show monika o1_1a at t11
    mc "Гей, Моніка?"
    m o1_1c "Гм?"
    mc "Завтра давай зробимо все, щоб фестиваль був незабутнім!"
    m o1_1b "Так! Давай!"
    scene bg house_dawn
    with wipeleft_scene
    stop music fadeout 1.0
        pass
    "Ми підходимо до дверей."
    "Я відкриваю їх, і ми заходимо всередину."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    play music t9
        pass
    "Я кладу рюкзак біля дивану, а Моніка несе кошик на кухню."
    "Після того, як вона це робить, вона йде нагору."
    "Я розкладаю всі речі і складаю їх на свої місця."
    "Трохи пізніше вона повертається і знову йде на кухню."
    m "[player], ми просто залишки з сьогоднішнього дня на вечерю?"
    mc "Так. Має бути достатньо."
    m "Добре, я залишу їх на столі."
    mc "Гаразд."
    "Я прибираю рюкзак, і йду нагору, щоб переодягнутися у свою піжаму."
    scene bg bedroom
    with wipeleft_scene
    "Я швидко змінюю одяг і повертаюся вниз."
    scene bg kitchen
    with wipeleft_scene
    show monika p_1j at t11
    "Я заходжу і бачу, як Моніка розігріває залишки сендвічів у маленькому грилі."
    "Я йду і беру два апельсини з комори, і соковижималку."
    "Я беру соковижималку і починаю вичавлювати сік з апельсинів."
    "Потім наливаю його у дві склянки для нас."
    "Моніка дістає сендвічі з грилі і ріже їх навпіл."
    "Вони гарно парують від розтопленого сиру, коли вона викладає їх на тарілки."
    "Ми сідаємо і насолоджуємося вечерею разом."
    scene bg kitchen
    with wipeleft_scene
    "Після цього я йду мити посуд і прибирати на кухні."
    "Я закінчую мити посуд, і Моніка підходить ззаду."
    "Вона обіймає мене ззаду."
    m "Завтра великий день!"
    mc "Так. Не можу дочекатися, щоб провести його з тобою..."
    "Ми залишаємося в такій позі трохи."
    m "Ти вже написав свій вірш?"
    mc "Ще ні..."
    m "Я теж."
    m "Давай підемо нагору і напишемо їх."
    mc "Добре."
    "Ми йдемо нагору."
    scene bg bedroom
    with wipeleft_scene
    "Ми сідаємо за мій стіл і починаємо писати."
    call new_m_poem
    pause 3.0
        pass
    scene bg bedroom
    with wipeleft_scene
    "І на цьому все закінчено."
    "Я кладу свій вірш у сумку і засовую її."
    "Моніка все ще уважно пише."
    m "Вже готово?"
    mc "Так, а ти?"
    m "Майже, я просто додаю кілька останніх штрихів."
    mc "Гаразд."
    "..."
    m "...І готово!"
    "Моніка закриває свій блокнот і кладе його у свою сумку."
    show monika p_1a at t11
    mc "Готова йти спати?"
    m p_1b "Так, давай."
    show monika p_1b at thide
    hide monika
    "Моніка стрибає у ліжко, а я йду вимикати світло."
    scene bg n_bedroom
    "Потім я лягаю в ліжко поруч з Монікою."
    mc "Спокійної ночі, моя любов..."
    m "Спокійної ночі!"
    "І я закриваю очі, відправляючись у країну снів."
    call d4
