init:
    $ timer_range = 0
    $ timer_jump = 0
screen countdown:
    timer 0.01:
        repeat True
        action If(time > 0, true=SetVariable('time', time - 0.01), false=[Hide('countdown'), Jump(timer_jump)])
label d4:
    stop music fadeout 2.0
        pass
    scene day4
    with dissolve_scene_full
    window hide
        pass
    pause 5.0
        pass
    scene black
    with dissolve_scene_full
    pause 4.0
        pass
    play sound "mod_assets/sfx/alarm.mp3" loop
        pass
    pause 2.0
        pass
    "Ух..."
    scene mcg_2
    with Dissolve(2.0)
    stop sound
        pass
    "Я глушу будильник."
    show mcg_9
    with Dissolve(2.0)
    "Моніка повільно відкриває очі та трохи стогне."
    show mcg_6
    "Потім вона обіймає мене і знову заплющує очі."
    hide mcg_6
    show mcg_5
    m "Ммммм... давай просто полежимо так..."
    hide mcg_5
    show mcg_6
    mc "Ми не можемо! Пам'ятаєш, у нас сьогодні фестиваль!"
    m "Ммммммммммм....."
    hide mcg_6
    show mcg_3
    m "Гаразд..."
    scene bg bedroom
    with wipeleft_scene
    "Моніка повільно встає."
    show monika p_1d at t11
    play music t8
        pass
    m "Я піду зроблю каву."
    m "Тобі зробити?"
    show monika p_1c
    mc "Так, будь ласка."
    show monika p_1c at lhide
    hide monika
    "Моніка йде вниз."
    "Я використовую час, щоб переодягнутися та вмитися."
    show monika p_2j at l11
    "Моніка повертається з двома маленькими чашками кави в руках."
    m "Ах, набагато краще."
    m p_2b "Ось твоя чашка!"
    show monika p_2j
    mc "Дякую!"
    "Ми п'ємо каву, перевіряючи все необхідне для фестивалю."
    "Вірші, шкільна сумка, гроші..."
    "...Здається, все на місці."
    mc "Моніко, я швидко приготую сніданок, поки ти збираєшся."
    m p_1b "Добре. Дякую, [player]!"
    scene bg kitchen
    with wipeleft_scene
    "Я йду на кухню і беру тостер."
    "Я кладу два шматочки хліба і дістаю джем з холодильника."
    "{i}*пік*{/i}"
    "Я беру два підсмажених шматочки і кладу ложку джему."
    "Я обережно розмазую його по хлібу і кладу ще два шматочки в тостер."
    "Я також беру трохи молока, наливаю два стакани і підігріваю."
    "{i}*пік*{/i}"
    "Я беру інші два шматочки і кладу ще трохи джему."
    "Закінчивши, я ставлю все на стіл."
    "Моніка спускається зі сумками та речами в руках."
    "Вона ставить їх біля входу і заходить на кухню."
    show monika 1b at l11
    m "Ооо~"
    m "Виглядає чудово!"
    m 3l "Тільки не чекай, що я буду бігти з цим в роті по вулиці, я доїм тут!"
    show monika 1a
    mc "Ахаха!"
    mc "Чесно кажучи, це більше схоже на те, що зробила б Сайорі."
    m 3k "Хаха!{w=0.5} Це так!"
    show monika 1j
    "Ми сідаємо і швидко снідаєм."
    mc "Добре, давай поспішати, а то запізнимося!"
    m 1d "Так, залиш посуд на столі, помиємо, коли повернемося додому."
    mc "Добре."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    show monika 1a at t11
    "Я йду і беру свої речі, і ми ще раз перевіряємо все перед виходом."
    "Здається, все тут, я беру свою сумку і половину брошур."
    mc "Добре, ходімо!"
    stop music fadeout 2.0
        pass
    scene bg house
    with wipeleft_scene
    show monika 1a at t11
    "Ми виходимо на вулицю."
    play music t2
        pass
    s "Гееееей!"
    show protag 3l at t31
    show sayori 4r at t32
    show monika 1a at t33
    "Я обертаюся і бачу Сайорі та ГГ, які чекають на нас біля паркану."
    show sayori 4r at f32
    s "Доброго ранку!"
    show monika 1b at f33
    show sayori 4a at t32
    m "Привіт!"
    show monika 1a at t33
    show sayori 4x at f32
    s "Ви готові до сьогоднішнього дня?"
    show sayori 4a at t32
    show protag 3a at t31
    mc "Так! Мені тільки треба швидко закрити двері."
    "Я замикаю двері, і ми йдемо вулицею до школи."
    scene bg residential_day
    with wipeleft_scene
    show monika 1j at t31
    show sayori 1a at t32
    show protag 3a at t33
    mc "Тож у вас є плакати?"
    show protag 3c at f33
    p "Так, є!"
    show monika 1c
    p 2y "Ми закінчили їх тільки вчора ввечері."
    show protag 3a at t33
    show sayori 5a at f32
    s "Тільки тому, що я трохи переспала..."
    s 5b "...І я трохи забула до останньої хвилини..."
    show sayori 1l at t32
    show monika 1l
    mc "Класична Сайорі..."
    show monika 1a
    show sayori 3x at f32
    s "Ось!{w=0.5} Подивіться!"
    "Сайорі дає мені плакат зі своєї сумки."
    call poem_special_poster
    mc "Гарно, але..."
    mc "Виглядає трохи поспішно."
    s 5b "Так..."
    s 5a "Вибач..."
    show sayori 1a at t32
    mc "Все гаразд."
    show sayori 1q at t32
    "Ми продовжуємо йти до школи."
    "Коли вхід з'являється у полі зору, я бачу барвисті повітряні кулі та прикраси, які повісила студентська рада."
    "Ми заходимо всередину і йдемо до клубної кімнати."
    scene bg corridor
    with wipeleft_scene
    show yuri 1g at t11
    "Коли ми йдемо коридором, я бачу Юрі, яка стоїть біля входу в туалет."
    mc "Доброго ранку!"
    y 2f "О! Доброго ранку і вам!"
    show sayori 1r at l21
    show sayori 1r at f21
    show yuri 2e at t22
    s "Привііііт!"
    "У цей момент Нацукі виходить з туалету."
    show natsuki 1d at l31
    show natsuki 1d at f31
    show sayori 1a at t32
    show yuri 2e at t33
    n "Коли ви всі тут з'явилися?"
    show natsuki 5a at t31
    mc "Кілька хвилин тому."
    mc "У вас теж є все необхідне?"
    show sayori 1a at thide
    hide sayori
    show natsuki 3l at f21
    show yuri 2e at t22
    n "У мене є мої кекси в цьому контейнері."
    show natsuki 3z at t21
    "Вона тримає прозору двошарову пластикову коробку з кексами, акуратно викладеними рядами."
    "Вони прикрашені милою глазур'ю та посипкою."
    mc "Ооо! Виглядають смачно!"
    show natsuki 5a
    show yuri 2b at f22
    y "А у мене в сумці банер."
    show yuri 2a at t22
    "Вона дістає фіолетовий банер з написом золотою фарбою:"
    "{i}Ласкаво просимо до Літературного клубу!{/i}"
    mc "Гарний вибір кольорів!"
    "Я помічаю невеликий пластиковий пакет збоку від неї."
    mc "Що в пакеті?"
    show yuri 3b at f22
    y "О,{w=0.5} це дифузор для ефірних олій."
    y "Я також принесла кілька ароматичних свічок."
    show yuri 1a at t22
    mc "А, добре."
    show yuri 1a at thide
    hide yuri
    show natsuki 5a at thide
    hide natsuki
    "Ми йдемо до клубної кімнати."
    "Ми проходимо повз багато класних кімнат, де учні починають готуватися до того, що вони будуть робити."
    "Я бачу, як деякі готують вбрання, інші розвішують прикраси, а деякі навіть малюють."
    "Ми добираємося до клубної кімнати."
    "На дверях є записка."
    call showpoem(poem_fes, music=False)
    "Моніка теж читає записку."
    "Її очі трохи блищать."
    show monika 4k at t11
    m "Добре, всі!"
    stop music fadeout 2.0
        pass
    m 3b "Ходімо всередину!"
    scene bg club_morning
    with wipeleft_scene
    play music t3
        pass
    "Ми заходимо в клубну кімнату і розпаковуємо наші речі."
    show monika 4b at t11
    m "Добре!"
    m "Давайте підготуємо це місце до фестивалю!"
    scene black
    with wipeleft_scene
    "Я дістаю брошури зі свого рюкзака і починаю класти їх на кожен стіл."
    "Моніка сідає і починає займатися паперами."
    "Юрі дістає банери і вішає їх на стіну."
    "Нацукі починає класти кекси на кожен стіл, на який я кладу брошуру."
    "Сайорі та ГГ виходять з дверей з руками, повними згорнутих плакатів і шпильок."
    "Незабаром клубна кімната гарно прикрашена, і все на своєму місці."
    "Нацукі та я підходимо до Юрі, щоб запитати, чи потрібна їй допомога."
    y "[player], ти міг би взяти той кінець?"
    mc "Вже."
    "Я піднімаю інший кінець банера."
    n "Трохи правіше, [player]."
    "Я рухаю його трохи вправо."
    n "Ось так!"
    "Я спускаюся з драбини і дивлюся на нього."
    "Здається, він у гарному положенні."
    "Юрі бере свої свічки і починає ставити їх по кутах столів."
    "Моніка встає і розкладає свої папери."
    m "Я віднесу це в студентську раду."
    mc "Добре, я подбаю про все тут, поки ти не повернешся."
    m "Дякую, [player]!"
    "Моніка виходить, і я продовжую допомагати з розміщенням речей у клубній кімнаті."
    "Через кілька хвилин вона повертається і починає прибирати все брудне."
    "Незабаром ми закінчуємо прикрашати все для фестивалю."
    scene bg festival
    with dissolve_scene_full
    "І на цьому ми майже готові почати!"
    "Сайорі та ГГ заходять."
    show sayori 4r at l21
    show sayori 4r at f21
    show mc 4a at t22
    s "Оооо!"
    s 3x "Клубна кімната зараз так гарно виглядає!"
    show sayori 3a at t21
    mc "Так, я теж так думаю!"
    show protag 1c at f22
    p "Ми закінчили розвішувати всі плакати."
    show protag 1a at t22
    mc "Чудово!"
    mc "Тепер нам залишається тільки чекати, поки все почнеться."
    show sayori at thide
    hide sayori
    show protag at thide
    hide protag
    show monika 1b at t11
    m "Так."
    m "Я думаю, це все, що нам потрібно підготувати!"
    m "Давайте зробимо цей фестиваль незабутнім!"
    show monika 1b at thide
    hide monika
    stop music fadeout 2.0
        pass
    "Ми всі сідаємо за наші столи і чекаємо, поки учні зайдуть всередину."
    "Я не очікую, що їх буде занадто багато,{w=0.5} тому-{nw}"
    "Дівчина 1" "\"...Привіт!{w=0.5} Це літературний клуб?\""
    show monika 1b at f11
    m "Так!{w=0.5} Це він!{w=0.5} Ласкаво просимо!"
    show monika 1a at t11
    "Дівчина 1" "\"...Я помітила плакат, який ви повісили кілька днів тому...\""
    "Дівчина 1" "\"І я подумала, що напишу вірш, щоб поділитися ним.\""
    show monika 3k at f11
    m "Чудово!{w=0.5} Ви можете просто сісти поки що, як тільки до нас прийде ще кілька людей, ми почнемо діяльність!"
    "Дівчина 1" "\"Добре, дякую...\""
    "Вона йде сідати за порожній стіл."
    "Вона трохи милується кексом, перш ніж відкусити."
    "..."
    "Через кілька хвилин учні заходять по одному."
    "Як тільки ми заповнюємо досить велику частину столів іншими учнями, Моніка виходить на передню частину кімнати."
    show monika 4k at f11
    m "Добре, всі!"
    m 1b "Я думаю, ми можемо почати нашу програму зараз!"
    "У кімнаті стає тихо, коли вона починає говорити."
    m 1r "{i}Кхм...{/i}"
    m 1b "Як багато хто з вас знає, мене звати Моніка, і я президент Літературного клубу."
    m "Від імені всіх моїх членів я хотів би привітати всіх тут на нашому заході!"
    m "Що ми будемо робити, так це читати вірші!"
    m 2b "Це невелика діяльність, яку ми любимо робити разом майже щодня."
    m 3j "Я сподіваюся, що деякі з вас написали вірш, щоб прочитати сьогодні!"
    m 3k "Якщо ви хочете, ви навіть можете подати свій вірш, і ми заповнимо стіну всіма вашими віршами!"
    m 1b "А тепер, без зайвих слів, давайте почнемо ділитися віршами!"
    m "І, здається, оскільки я вже тут, я почну."
    play music tmonika
        pass
    show monika 1q at t11
    "Вона дістає свій вірш і починає його читати."
    show monika 3b at f11
    m "Я називаю його {i}'Ручка і папір'{/i}."
    m 1q "..."
    m 1b "З великою впевненістю я сиджу за столом."
    m 3d "Навколишній шум не закінчується."
    m 2b "Один, два і три."
    m 1b "Кольорові вогні, як різдвяна ялинка."
    m "Маленькі кульки сонячного світла мерехтять навколо."
    m 3k "Навколо жодної хмари."
    m 3d "Чотири і п'ять заходять всередину."
    m 1b "Приносячи світ, ще невідомий."
    m 1r "Я сиджу там, болісно,"
    m 1i "Знаючи, що це ще не закінчено."
    m 3p "Навіть якщо я бачу їх усіх,"
    m 1r "Все ще є тільки один."
    m 1d "Розрізаний папір лежить на моєму столі."
    m "Як король під шахом."
    m 1n "Я хочу його розірвати."
    m 1b "Нехай він буде достатньо широким, щоб я могла пройти."
    m 3r "Але коли я це роблю,"
    m 1r "Я все ще роблю тобі боляче."
    show monika 3j
    m "..."
    show monika 3j at thide
    hide monika
    "Всі аплодують, коли вона закінчує."
    $ currentpos = get_pos()
    $ audio.t5b = "<from " + str(currentpos) + " loop 4.444>bgm/5_sayori.ogg"
    stop music fadeout 2.0
        pass
    $ renpy.music.play(audio.t5b, channel="music_poem", fadein=2.0, tight=True)
    "Вона відходить від подіуму, і Сайорі підходить."
    show sayori 3x at l11
    show sayori 3x at f11
    s "Привіт! Я Сайорі, віце-президент клубу!"
    s "Сьогодні я прочитаю {i}'Повільні дні'{/i}."
    s 1a "..."
    s 1b "Прокидаюся вранці, не маючи що сказати."
    s 1x "З мого будинку у світ, займаюся своїми справами."
    s 2x "Я можу здаватися сміливою, але як тільки сонце сяде,"
    s 3r "Ви побачите, що я найлінивіша людина навколо."
    s 1x "Небо над містом, сяє на тлі хмар."
    s 2b "Літаки ревуть вгорі, прямо під покровом."
    s 1b "Я пишу свій вірш, спираючись на дерева."
    s 4r "Зараз більше, ніж будь-коли, я просто хочу піти!"
    s 2x "Ви смажите рибу? Якось я можу сказати..."
    s 1x "Це на вечерю? Який чудовий запах..."
    s 2l "Почуйте, як бурчить мій животик... Він благає про їжу."
    s 1x "Я не хочу турбувати вас, я просто в настрої."
    s 3l "Чому я така вперта? Чому я плачу і стогну?"
    s 1x "Є одна річ, яку я хочу зараз:"
    s 4r "Я хочу додому!"
    show sayori 2a
    s "..."
    show sayori 2a at thide
    hide sayori
    "Сайорі закінчує, і всі знову аплодують."
    "Вона трохи відходить і робить глибокий вдих, перш ніж повернутися на своє місце."
    $ currentpos = get_pos()
    $ audio.t5b = "<from " + str(currentpos) + " loop 4.444>bgm/5_yuri.ogg"
    stop music_poem fadeout 2.0
        pass
    $ renpy.music.play(audio.t5b, channel="music", fadein=2.0, tight=True)
    "Далі вперед виходить Юрі."
    show yuri 4b at l11
    show yuri 4b at f11
    y "Еммм... доброго ранку! М-мене звати Ю-Юрі..."
    show yuri 3w
    "Вона робить глибокий вдих."
    y 3f "Я прочитаю {i}'Пляж'{/i}."
    y 1k "..."
    y 1h "Диво, створене мільйони років тому."
    y 2f "Де утроба Землі хаотично зустрічається з поверхнею."
    y 2b "Під ясним блакитним небом, простір блаженства--"
    y 1h "Але під сірими котячими хмарами, нескінченна загадка."
    y 2k "У найпростіший світ, щоб заблукати"
    y 1j "Це той, де можна знайти все."
    y 1b "Можна побудувати піщаний замок тільки там, де пісок мокрий."
    y "Але там, де пісок мокрий, приходить приплив."
    y 2b "Чи буде він ніжно лизати ваші фундаменти, поки ви не здастеся?"
    y 3r "Або раптова хвиля звалить вас в одну мить?"
    y 1k "У будь-якому випадку, результат один і той же."
    y 1b "Але ми все ще будуємо піщані замки."
    y "Я стою там, де піна обгортає мої щиколотки."
    y 1j "Де мої пальці вдавлюються в пісок."
    y "Солоне повітря терапевтичне."
    y "Бриз ніжний, але потужний."
    y 1l "Я занурюю пальці в кінцеву межу, спокушена пінистими вусиками."
    y 1b "Поверніться назад, і я покину свій спокій, щоб розмити берег."
    y "Рухайтеся вперед, і я повернуся на Землю назавжди."
    show yuri 2a
    y "..."
    show yuri 2a at thide
    hide yuri
    "Всі аплодують, коли вона закінчує."
    "Вона відходить від подіуму і сповзає на своє місце, роблячи великий зітхання полегшення."
    $ currentpos = get_pos()
    $ audio.t5b = "<from " + str(currentpos) + " loop 4.444>bgm/5.ogg"
    stop music fadeout 2.0
        pass
    $ renpy.music.play(audio.t5b, channel="music_poem", fadein=2.0, tight=True)
    "ГГ встає і підходить до подіуму."
    show protag 4o at l11
    show protag 4o at f11
    p "Привіт! Я ГГ. Емм, я прочитаю вірш під назвою {i}'Хороші речі'{/i} Барбари Венс."
    p 1a "..."
    p 1c "Якось я почув, як старий чоловік сказав,"
    p "Формуючи вази з глини"
    p "У тонкі форми піднесене,"
    p "'Послухай, синку, хороші речі потребують часу.'"
    p 2c "Все своє життя я думав про це"
    p "Коли завдання не приносило блаженства,"
    p 1d "Коли робота здавалася надзвичайно важкою"
    p "І я думав, що з мене досить."
    p 2c "Тому я віддавав трохи більше"
    p "Тому, що іноді здавалося рутиною;"
    p "І, знаєте, без сумніву,"
    p 1k "Хороші речі завжди відбувалися."
    show protag 1a
    "..."
    "Він знайшов цей вірш в Інтернеті."
    show protag 1a at thide
    hide protag
    "Він сходить з подіуму, і аплодисменти знову наповнюють кімнату."
    $ currentpos = get_pos()
    $ audio.t5b = "<from " + str(currentpos) + " loop 4.444>bgm/5_natsuki.ogg"
    stop music_poem fadeout 2.0
        pass
    $ renpy.music.play(audio.t5b, channel="music", fadein=2.0, tight=True)
    "Нацукі підходить до подіуму, і в кімнаті знову стає тихо."
    show natsuki 5d at l11
    show natsuki 5d at f11
    n "Привіт! Я Нацукі. І я прочитаю 'Я буду твоїм пляжем!'."
    show natsuki 1c
    n "Твій розум настільки сповнений турбот і страхів"
    n "Що зменшило твоє диво з роками"
    n 1d "Але сьогодні у мене є особливе місце"
    n "Пляж, куди ми підемо."
    n "Берег, що сягає за межі твого зору"
    n 5z "Море, що виблискує яскравим світлом"
    n 1d "Стіни у твоєму розумі розтануть"
    n "Перед сонячним сяйвом."
    n 2d "Я буду пляжем, який змиє твої турботи"
    n 4d "Я буду пляжем, про який ти мрієш щодня"
    n 1z "Я буду пляжем, який змусить твоє серце битися"
    n 1b "Так, як ти думав, що покинуло тебе давно."
    n 2d "Давай поховаємо твої важкі думки в купі піску"
    n 1l "Купайся в сонячних променях і тримай мене за руку"
    n 1d "Змий свою невпевненість у солоному морі"
    n "І дозволь мені побачити, як ти сяєш."
    n 2d "Давай залишимо твої спогади у слідах на піску"
    n 4z "Звільню тебе у моєму вітряному вітрилі"
    n 1l "І згадай причини, чому ти чудовий"
    n 5t "Коли ти притиснешся губами до моїх."
    n 2d "Я буду пляжем, який змиє твої турботи"
    n 4d "Я буду пляжем, про який ти мрієш щодня"
    n 1z "Я буду пляжем, який змусить твоє серце битися"
    n 1b "Так, як ти думав, що покинуло тебе давно."
    n 1d "Але якщо ти дозволиш мені бути поруч з тобою"
    n "Твій власний пляж, твій власний порятунок"
    n 1z "Ти знову навчишся любити себе."
    n 1a "..."
    show natsuki 1b at thide
    hide natsuki
    "Вона сходить, і починаються аплодисменти."
    $ currentpos = get_pos()
    $ audio.t5b = "<from " + str(currentpos) + " loop 4.444>bgm/5.ogg"
    stop music fadeout 2.0
        pass
    $ renpy.music.play(audio.t5b, channel="music_poem", fadein=2.0, tight=True)
    "Нарешті, я встаю зі свого місця і підходжу вперед."
    show monika forward neut lpoint rdown e4b mn b1a at t11
    "Я кидаю погляд на Моніку, яка щасливо посміхається мені."
    "Я отримую невеликий поштовх у впевненості, коли бачу її посмішку."
    "І тому я починаю."
    show monika at thide
    hide monika
    mc "Привіт усім! Мене звати [player]. Сьогодні я прочитаю 'Життя"
    "Я пристрасно зачитую слова, і, закінчивши, сходжу з подіуму."
    stop music_poem fadeout 2.0
        pass
    "Натовп аплодує, і я сідаю назад на своє місце."
    "Коли я сідаю, Моніка встає, підморгує мені і підходить до передньої частини клубної кімнати."
    show monika 4b at l11
    show monika 4b at f11
    play music t3
        pass
    m "Добре, всі!"
    m 3b "На цьому клубні виступи закінчено!"
    m "Я хотів би запросити всіх, хто написав вірш, підійти і поділитися ним теж!"
    m "Ми будемо йти по одному, щоб кожен міг виступити."
    m "Будь ласка, підніміть руку, якщо хочете підійти!"
    show monika 1a at t11
    "У клубній кімнаті на мить стає тихо, перш ніж дівчина з натовпу піднімає руку."
    "Дівчина 1" "\"Емм... я хотіла б поділитися...\""
    show monika 3b at f11
    m "Звичайно! Будь ласка, продовжуйте!"
    show monika 3b at thide
    hide monika
    "Моніка знову сідає, і дівчина починає декламувати."
    "З плином часу кілька людей у кімнаті приходять і йдуть, по черзі читаючи свої вірші."
    "І кекси, які приготувала Нацукі, досить швидко зникають з коробки."
    "Ми планували ділитися лише двічі під час нашої частини фестивалю, щоб розмістити людей."
    "Деякі люди просто сидять і слухають або читають."
    "Інші починають швидко писати вірш, щоб поділитися ним."
    "Як тільки ми досягаємо 15-хвилинної позначки, ми знову ділимося своїми віршами."
    "Ми сідаємо і продовжуємо спостерігати за всіма людьми, які виконують свої вірші, які вони написали."
    "Я все ще ніколи не очікував, що наш клуб буде таким популярним!"
    show monika 3b at t11
    "Моніка щасливо посміхається, допомагаючи однокласникам зайняти місця та спостерігаючи за виступами."
    "Я бачу, що вона щаслива, що захід був таким успішним!"
    show monika at thide
    hide monika
    "Я відкидаюся назад, розслабляюся і слухаю вірші, написані учнями з інших класів."
    scene bg festival
    with wipeleft_scene
    "Незабаром, приблизно за 5 хвилин до кінця, ми починаємо прибирати."
    "Усі учні повільно виходять із кімнати та прямують до наступної події."
    "Члени клубу та я починаємо прибирати безлад, залишений гостями."
    show monika 1d at t11
    m "Залишимо прикраси на завтра."
    m 4b "Молодці на сьогоднішньому фестивалі, всі~!"
    m "Я б сказала, що це був величезний успіх!"
    show monika 1a at thide
    hide monika
    show protag 1a at t41
    show sayori 4r at f42
    show natsuki 2a at t43
    show yuri 1a at t44
    s "Таааак! Мені було так весело!"
    show sayori 2a at t42
    show natsuki 2d at f43
    n "Мені теж було весело!"
    n 5y "Навіть змогла продемонструвати свої навички випікання..."
    show natsuki 2a at t43
    show yuri 2b at f44
    y "Те саме тут."
    y 2d "Я думаю, що це був хороший досвід!"
    show yuri 2a at t44
    show protag 1c at f41
    p "Я добре провів час."
    p 1k "Наступного разу нам слід спробувати зробити щось подібне!"
    show protag at thide
    hide protag
    show sayori at thide
    hide sayori
    show natsuki at thide
    hide natsuki
    show yuri at thide
    hide yuri
    show monika 4k at t11
    m "Я думаю, що ми це зробимо!"
    m 4b "[player], а як щодо тебе?"
    m "Тобі було весело?" nointeract
    menu:
        "Так":
            m "Чудово!"
        "Так":
            m "Чудово!"
    m 5a "Тоді нам доведеться зробити це знову, хехе~!"
    m 3b "Гаразд, усі!"
    m "Я думаю, що це завершує сьогоднішні заходи!"
    m "Успіхів і розваг з рештою фестивалю!"
    m "Я думаю, що наступним є клуб дебатів, тож ви, можете піти в театр, якщо хочете подивитися."
    stop music fadeout 3.0
        pass
    show monika at thide
    hide monika
    "Усі йдуть займатися своїми справами, а Моніка і я залишаємося, щоб замкнути."
    scene bg corridor
    with wipeleft_scene
    show monika 1a at t11
    play music t6
        pass
    "Моніка замикає двері, і ми прямуємо до театру."
    m 1b "Давно я не була в клубі дебатів."
    m 1d "Цікаво, про що вони сперечалися з тих пір, як я пішла."
    m 1b "Б'юся об заклад, вони вже почали."
    show monika 1a
    "Ми підходимо до дверей театру і заходимо всередину."
    scene bg theater
    with wipeleft_scene
    stop music fadeout 4.0
        pass
    "Ми сідаємо і чекаємо початку дебатів."
    "Лише через кілька секунд на сцену виходять двоє студентів."
    "Вони обидва одягнені в професійні костюми та зачесане волосся."
    m "Я думаю, що зараз почнеться."
    "Оголошення лунає над театром."
    "Диктор" "\"{i}Кхм,{/i}{w=0.5} це працює...?\""
    "Диктор" "\"Так! Добре.\""
    "Диктор" "\"Вітаємо всіх на виступі клубу дебатів!\""
    "Диктор" "\"Сьогодні двоє наших студентів будуть сперечатися про вплив викопного палива.\""
    "Диктор" "\"Сподіваюся, це дасть кожному тут деяке уявлення про обидві сторони.{w=0.5} І без зайвих слів, ви можете починати.\""
    play music debate1
        pass
    "Двоє студентів починають свої промови з 2-хвилинним таймером між ними."
    m "Знаєш, коли справа доходить до дебатів, це майже стереотип, що вони завжди повні великих політиків із вигадливими речами."
    m "Але це насправді не так."
    m "Будь-хто може добре дебатувати, і це може бути про що завгодно."
    m "Смішно, одного разу для теми ми вирішили провести дебати про те, чи є суп напоєм."
    m "Це була не моя ідея, але вона стала досить гарячою."
    m "Зрештою, це була нічия."
    m "Я багато чого навчилася сперечатися в ті дні."
    m "Але я рада, що пішла з відти. Занадто багато драми і всякого такого."
    m "Я не шкодую про створення літературного клубу. Це набагато веселіше, ніж це."
    m "І я думаю, коли ти приєднався, це були найбільші дебати, які були в моїй голові, напевно, коли-небудь."
    m "Але я ніколи не пошкодую, що закохалася в тебе~"
    "Вона спирається на моє плече, коли дебати тривають."
    "Зрештою, все починає ставати трохи гарячим."
    m "Знаєш, я думала, що, будучи в клубі дебатів, ці хлопці навчаться сперечатися."
    m "Коли я була там, все ніколи не було таким гарячим."
    m "Здається, після мого відходу все пішло шкереберть."
    "..."
    m "Я думаю, нам слід піти. Ми б нічого не навчилися, якби залишилися довше."
    m "Це стає смішним."
    mc "Гаразд."
    stop music fadeout 4.0
        pass
    show monika 1a at t11
    "Моніка тихо встає зі свого місця, як і я."
    "Вона бере мене за руку і виводить з театру."
    scene bg corridor
    with wipeleft_scene
    show monika 4k at t11
    play music t12
        pass
    m "Ах~"
    m 1b "Приємно трохи розслабитися після дебатів."
    m 1d "У будь-якому випадку, я думаю, що наступним є клуб мажореток."
    m "Але до цього ще хвилин 20."
    show monika 1a
    mc "Хочеш подивитися на прилавки, які встановили вчителі?"
    m 1b "Звичайно."
    show monika 1a
    "Ми витрачаємо кілька хвилин, намагаючись знайти прилавки."
    "Коли я виглядаю у вікно, я помічаю, що вони встановлені у дворі."
    "Їх не надто багато."
    "Я, напевно, міг би порахувати їх усі на своїх руках."
    "Я йду за Монікою на вулицю."
    scene bg outside
    with wipeleft_scene
    "Усі прилавки - це прилавки з їжею з різними видами."
    "Один зі стажерів теж встановив один."
    "Здається, він продає рисові кульки."
    show monika 3b at t11
    m "Гей, [player]!"
    m 3k "Давай підемо і візьмемо трохи з них!"
    show monika 1a
    mc "Звичайно."
    "Ми підходимо до прилавка, і він швидко опановує себе."
    "Стажер" "\"П-{w=0.1}Привіт!{w=0.5} Хочете купити трохи желе, наповнене до-{w=0.5} Я маю на увазі, онігірі?\""
    mc "Два, будь ласка!"
    "Стажер" "\"Гаразд!{w=0.5} Це буде 4 долари, будь ласка!\""
    mc "Ось тримайте."
    "Стажер" "\"Дякую!\""
    "Стажер" "\"Ось ваші онігірі!\""
    "Він передає мені онігірі, і я даю один Моніці."
    m 1k "Дякую!"
    show monika 1j
    mc "Побачимось!"
    "Стажер" "Веселого вам з рештою фестивалю!"
    "Ми трохи гуляємо."
    m 1d "[player], ти хочеш почати прямувати до спортзалу?"
    m "Я думаю, що наступна подія почнеться за кілька хвилин."
    show monika 1a
    mc "Гаразд."
    "Повільно йдучи до спортзалу, ми жуємо наші онігірі."
    scene bg corridor
    with wipeleft_scene
    show monika 1a at t11
    "Йдучи коридором, я помічаю кількох дівчат з клубу мажореток, які також прямують до спортзалу."
    "Моніка трохи підбадьорюється, коли бачить їх."
    show monika 1b at f11
    m "Успіхів з виступом!"
    "Член клубу мажореток" "\"Дякую!{w=0.5} Сподіваємося, вам сподобається!\""
    scene bg gym
    with wipeleft_scene
    "Члени клубу мажореток швидко заходять у кімнату для переодягання."
    stop music fadeout 2.0
        pass
    "Моніка і я займаємо місця на трибунах."
    "Ми закінчуємо онігірі, і Моніка трохи відкидається назад."
    "Здається, ми одні з перших, хто сів, тому тут досить порожньо."
    "Але незабаром люди починають прибувати, оскільки подія ось-ось почнеться."
    play music "mod_assets/music/marching.mp3"
        pass
    "Через кілька хвилин після закриття дверей починає грати музика, і дівчата з клубу мажореток вибігають із зони для переодягання."
    "Вони рухаються в унісон, обертаючи свої палички в такт."
    "Моніка киває головою разом з ними."
    "Вони роблять безліч складних рухів, підкидаючи свої палички одна одній і ловлячи їх синхронно."
    stop music fadeout 5.0
        pass
    "Після закінчення пісні,{w=0.5} вони кланяються, і всі аплодують, коли вони повертаються в кімнату для переодягання."
    "Після цієї короткої перерви вони повертаються, і починає грати інша пісня."
    play music t12
        pass
    "Здається, Моніці дуже подобається дивитися, як вони крутять палички."
    "І, чесно кажучи, музика теж досить хороша."
    m "Б'юся об заклад, вони могли б потрапити на національний рівень зі своїми навичками."
    mc "Ти так думаєш?"
    m "Мгм~"
    m "Не виглядає легко крутити ці речі так довго."
    m "Ооо!"
    m "Вгадай, що я чула~"
    m "Очевидно, один із членів кіноклубу закоханий в одну з дівчат там."
    m "Я не впевнена, в кого саме."
    m "Я просто пам'ятаю, як підслухала це під час перерви в якийсь момент."
    mc "Я бажаю йому удачі в її отриманні!"
    m "Ехехе~"
    "Я намагаюся видивитися кіноклуб і знайти хлопця."
    "..."
    "Ось він."
    mc "Я думаю, що це може бути він там."
    "Я бачу, як він бовтається, і він насправді записує це як на камеру, так і на свій телефон."
    m "Так, схоже на те."
    "Коли я повертаю погляд на клуб мажореток, вони продовжують свій виступ."
    "Один із членів заглядає в бік кіноклубу і підморгує."
    "Я дивлюся на клуб, і хлопець, на якого я вказав раніше, трохи червоніє і показує їй великий палець вгору."
    m "Ці двоє точно закохані одне в одного~"
    mc "О так, це так."
    scene bg gym
    with wipeleft_scene
    "Виступ триває, і закінчується остання пісня."
    "Усі аплодують і виходять зі спортзалу на наступну подію."
    "Коли я озираюся назад, тримаючись за руки з Монікою, я помічаю двох, які дивилися одне на одного."
    "Вони обіймаються, і дівчина щасливо підстрибує."
    "Він зробив це."
    "Яка легенда."
    show monika 1a at t11
    "Моніка перевіряє, на що я дивлюся."
    m 1b "Ооо~!"
    m 3k "Це сталося!"
    m 1j "Хехехе~"
    show monika 1j at f11
    "Моніка обіймає мене, коли ми виходимо."
    m 1k "Але зосередься трохи на мені, добре?"
    show monika 1a
    mc "Хаха~ Як побажаєш."
    m 1j "Уфуфу~"
    scene bg corridor
    show monika 1j at f11
    with wipeleft_scene
    mc "Тож де наша наступна зупинка?"
    m 1b "Я думаю... дай мені перевірити..."
    m 1d "О, клуб аніме!"
    show monika 1c
    mc "Хіба ГГ не хотів приєднатися до цього клубу, перш ніж Сайорі підкупила його кексами?"
    m 1b "Так, це той самий."
    m 1d "Цікаво, що вони запланували."
    m "Ми повинні піти в їхню клубну кімнату, судячи з усього."
    m "Я можу показати дорогу."
    show monika 1c
    mc "Гаразд, ходімо!"
    "Ми прямуємо до клубу аніме."
    scene bg corridor
    show monika 1c at t11
    with wipeleft_scene
    "Моніка веде мене, поки ми не підходимо до відчинених дверей з написом клубу аніме на знаку."
    m 1d "Здається, це місце."
    m "Трохи менш метушливо, ніж я пам'ятаю."
    m 1b "У п'ятницю я почула від одного з наших однокласників, що тут спалахнула бійка з дерев'яними катанами."
    m "Але в будь-якому випадку, здається, тут все спокійно."
    "Ми заходимо всередину і оглядаємося."
    scene bg club_day
    with wipeleft_scene
    "Усі члени клубу встановили невеликий стенд, кожен з яких має або піднос з їжею, або деякі предмети, які вони купили."
    "Усі вони рясно прикрашені аніме-картинками та картонними вирізками різних вайфу."
    mc "Ці хлопці дійсно віддані."
    m "Так."
    m "Я бачу, чому Нацукі не хотіла приєднуватися."
    m "Б'юся об заклад, вона збирається подивитися."
    mc "Так, їй подобаються такі речі."
    mc "Хочеш трохи поїсти?"
    m "Так!"
    "Ми повільно обходимо все, і я беру по одному з усього, щоб ми могли поділитися."
    scene bg corridor
    with wipeleft_scene
    show monika 1a at t11
    "Ми виходимо на вулицю і знаходимо лавку, щоб сісти."
    m 1j "Ммм~"
    m 1b "Це досить добре!"
    m "Ось~!"
    show monika 1a
    "Вона дає мені половину печива, яке, здається, прикрашене у вигляді дівчини з блакитними хвостиками."
    "Я відкушую шматочок."
    "Непогано."
    m 1b "Бачиш?"
    show monika 1a
    mc "Так."
    "..."
    m 1d "Тож, очевидно, я чула, що зараз є школи на човнах."
    m "І у них також є клуби танкерів, де вони їздять на танках і стріляють у речі."
    show monika 1a
    mc "Справді?"
    m 1k "Ні, хехе~ Я просто жартую."
    show monika 1a
    mc "Дякувати Богу."
    mc "Це звучить як дивний аніме-сюжет."
    m 1b "Так, я просто бачила пост на Редіті з деякими аніме-дівчатами в танках."
    m 1d "Якийсь хлопець у коментарях відповів іншому хлопцю передісторію після того, як хтось попросив контекст."
    m 3b "І я думаю, що це насправді аніме, воно називається...{w=0.5}е-е..."
    m 1l "...Я забула його назву!"
    show monika 1a
    mc "Вау."
    mc "Б'юся об заклад, один із хлопців у клубі аніме знає, що це таке."
    m 1b "Напевно."
    m "Я думаю, що я запитаю їх колись на уроці."
    m 3b "Але нам ще потрібно закінчити те аніме про айдолів."
    show monika 1a
    mc "Справедливо."
    "Ми трохи жуємо наші закуски і дивимося, як проходять люди."
    mc "Ти знаєш, куди нам потрібно йти далі?"
    m 1d "Е-е...так, дай мені перевірити..."
    m 1b "Наступними є всі спортивні клуби."
    show monika 1a
    mc "Спортивні клуби?"
    mc "Це знову буде в спортзалі, чи не так?"
    m 1d "Має бути."
    m "Я не думаю, що нам дозволено встановлювати сітки і все таке на вулиці."
    show monika 1c
    mc "Хочеш почати йти?"
    m 1d "Звичайно."
    show monika 1a
    "Ми встаємо з лавки і повертаємося до спортзалу."
    scene bg gym
    with wipeleft_scene
    "Ми повертаємося на своє місце на трибунах, і Моніка спирається на мене."
    "Як тільки спортзал трохи заповнюється, капітан чоловічої баскетбольної команди виходить з капітаном жіночої команди."
    "Капітан хлопців" "\"Дякую всім, що прийшли!\""
    "Капітан хлопців" "\"Дозвольте мені пояснити, як все буде працювати.\""
    "Капітан хлопців" "\"Кожна команда розділиться на дві частини і зіграє одна проти одної в одному матчі у своєму виді спорту.\""
    "Капітан хлопців" "\"Перший, хто заб'є на іншому боці, перемагає.\""
    "Капітан хлопців" "\"Ігри будуть короткими, і ми будемо чергувати кожну команду і вид спорту після кожного матчу.\""
    "Капітан дівчат" "\"Як тільки кожна команда матиме можливість зіграти одна проти одної, ми всі зберемося разом і зіграємо у величезну гру у вибивала!\""
    "Капітан дівчат" "\"Якщо хтось хоче взяти участь у цьому, ви можете просто спуститися і приєднатися!\""
    "Капітан дівчат" "\"Без зайвих слів, давайте почнемо!\""
    "Капітан жіночої команди повертається в роздягальню, а чоловіча баскетбольна команда вибігає і йде на свої сторони."
    "Сині проти зелених."
    "Лунає свисток, і команди кидаються, щоб отримати м'яч."
    "Синім вдається вихопити м'яч і побігти, щоб забити зеленим."
    "Вони промахуються, і зелені забирають м'яч."
    "Після цього сині люто захищають кошик, але зелені забивають дальній кидок."
    "Звичайно, це був 3-очковий, але я не думаю, що це зараховується як такий тут."
    "Натовп радіє, коли зелені перемагають."
    "Після цього вони міняються місцями з жіночою командою, і вони також біжать на свої сторони."
    "Знову сині проти зелених."
    "Як тільки лунає свисток, Моніка штовхає мене."
    show monika 5a at f11
    m "Якщо тобі прийдуть якісь ідеї [player], я можу трохи позаздрити~"
    mc "Не хвилюйся, Моніко, у мене є очі тільки на тебе~"
    m "Круто~"
    show monika at thide
    hide monika
    "Дівчата також змагаються за м'яч."
    "Вони кидаються на нього і забирають його з-під іншої команди."
    "Матч закінчується швидкою перемогою синьої команди."
    "Коли це закінчується, обидві волейбольні команди виходять і починають грати."
    "Вони грають без сітки, і просто хлопці проти дівчат."
    "Вони ставляться до цього так, ніби там насправді була сітка."
    "Одній з дівчат вдається зробити спайк, коли вони забивають очко."
    "Вони перемагають, але цілком очевидно, що хлопці не надто старалися."
    "Усі дуже раді почати гру у вибивала, і коли вони заносять м'яч у кімнату для зберігання, вони виносять велику сумку, повну м'ячів для вибивал."
    "Вони також виносять кілька великих матів."
    "Капітан волейбольної команди виступає."
    "Капітан волейбольної команди" "\"Ми робимо версію з укриттям, щоб зробити її більш складною!\""
    "Капітан волейбольної команди" "\"Але як тільки ви збиваєте мат, він залишається збитим!\""
    "Капітан волейбольної команди" "\"Якщо вас вдарять, ви повинні лягти на підлогу і прикинутися мертвим.\""
    "Капітан волейбольної команди" "\"Ви, хлопці, знаєте решту правил.\""
    "Капітан волейбольної команди" "\"Гаразд! Ходімо, всі!\""
    "Капітан волейбольної команди" "\"Розділіться хлопці проти дівчат.\""
    menu:
        "Грати.":
            "Я дивлюся на Моніку."
            stop music fadeout 10.0
                pass
            show monika 1a at f11
            mc "Хочеш зіграти?"
            m 3k "Так, хочу!"
            m forward lpoint rdown sedu om oe "Приготуйся до нищівної поразки!"
            show monika forward ldown rdown sedu cm oe
            mc "Не цього разу."
            show monika at thide
            hide monika
            "Я знімаю піджак і жилетку, і Моніка робить те саме."
            "Я біжу на бік хлопців і стаю біля стіни."
            show monika forward ldown rhip sedu cm oe at t11
            "Я дивлюся на інший бік і бачу, як Моніка витріщається на мене, готова стрибнути і вбити."
            show monika at thide
            hide monika
            "Лунає свисток, і ми кидаємося хапати м'яч."
            play music war
                pass
            "Я ховаюся, коли повз пролітає м'яч."
            show protag 1z at t11
            "ГГ стрибає поруч зі мною, тримаючи м'яч у руці."
            mc "Радий тебе бачити!"
            p 1i "Я б не пропустив таке за жодні гроші!"
            p 1c "Сайорі теж на іншому боці."
            show protag 1b
            mc "І Моніка."
            p 1u "Зачекай, Моніка теж тут?"
            p 1z "Окей, тепер мені страшно."
            show protag 1b
            mc "Не хвилюйся, ми будемо в безпеці тут."
            "М'яч пролітає повз край, коли я збирався визирнути."
            mc "...Напевно."
            show protag at thide
            hide protag
            "ГГ хапає м'яч і встає, щоб кинути його."
            "Він кидає м'яч і влучає в одну з баскетболісток."
            "Він ховається, і кілька м'ячів пролітають повз."
            p "Це перетворилося на поле бою."
            mc "Так і є."
            "Я беру м'яч, який прокотився повз, і встаю, щоб кинути його."
            "Я бачу, як Нацукі пробігає повз, намагаючись влучити в когось."
            "Моніка також стоїть відкрито, ніби хоче, щоб у неї влучили."
            "Обидві здаються хорошими цілями..."
            menu:
                "Влучити в Моніку":
                    "Я прицілююся в Моніку."
                    show monika 1a at t11
                    "Коли я збираюся кинути м'яч, вона дивиться мені прямо в очі."
                    "Коли моя рука замахується з м'ячем, майже в сповільненій зйомці, у мене стискається серце."
                    "Вона одразу ловить м'яч, розвертається і, як куля, влучає мені прямо в серце."
                    "Я вибув."
                    "Я падаю на підлогу, тримаючись за груди."
                    p "НІІІ!!{w=0.5} [player]!!!"
                    mc "Продовжуйте...бій...за мене..."
                    "Я падаю на спину, і світ навколо мене темніє."
                    scene black
                    with Dissolve(2.0)
                    "Звуки війни лунають навколо мене."
                    "Я чую, як мат, який ми з ГГ використовували як укриття, падає, коли в нього влучають м'ячі з боку дівчат."
                    p "Ай-!"
                    "Я чую голос ГГ, коли він падає у полум'ї битви."
                    "Хлопець" "Нас переважають!"
                    "Чувак" "Давайте, хлопці, у нас вийде, не відступайте зараз!"
                    "Наша команда намагається не здаватися, але лунає свисток, і нам наказують припинити вогонь."
                    scene bg gym
                    with Dissolve(2.0)
                    "Я відкриваю очі і встаю."
                    $ persistent.dodgewin = False
                    jump dodgeend
                "Влучити в Нацукі":
                    "Я готую руку, щоб кинути м'яч у Нацукі."
                    show natsuki 3r at l11
                    "Вона проноситься по підлозі, нападаючи на наш бік."
                    show natsuki 3s
                    "Вона не помічає мене, коли встає після ковзання."
                    "У цей момент я роблю кидок і дивлюся, як м'яч летить, як лазер, до неї."
                    show natsuki 1o at h11
                    "Коли вона готується зробити крок вперед, м'яч вдаряє її в плече, і вона з жахом дивиться на того, хто в неї влучив."
                    show natsuki 1o:
                        2.0
                        easeout_cubic 1.0 yoffset 1000
                    "Вона падає на підлогу, і я ховаюся."
                    hide natsuki
                    p "Гарний кидок!"
                    "ГГ встає і кидає ще один м'яч."
                    "Він ховається після того, як влучає в мат на боці противника."
                    mc "ХТОСЬ, ДАЙТЕ МЕНІ М'ЯЧ!"
                    "Хлопець з баскетбольної команди кидає мені м'яч з невеликого запасу, який він зробив."
                    mc "Дякую!"
                    "Він киває і повертається до бою."
                    "Я знову випробовую свою удачу, встаючи зі свого безпечного місця за матом."
                    "Юрі вискакує з-за укриття, намагаючись кинути м'яч."
                    "Сайорі також бере участь у бою, передаючи один зі своїх м'ячів товаришу по команді."
                    "Я готую м'яч у руці."
                    menu:
                        "Влучити в Юрі":
                            "Коли Юрі знову вискакує з-за мату, я наводжу на неї очі, готовий кинути."
                            show yuri turned ldown rup doub cm oe at t11
                            "Їй вдається влучити в одного з наших."
                            "Я кидаю м'яч, якраз перед тим, як вона намагається сховатися."
                            show yuri turned lup rup pani cm oe at h11
                            "М'яч пролітає над матом, вдаряючи її в плече."
                            show yuri turned lup rup pani cm oe:
                                2.0
                                easeout_cubic 1.0 yoffset 1000
                            "Вона падає за мат, і один з її товаришів по команді поруч з нею також отримує удар."
                            hide yuri
                            "Я ховаюся."
                            "Звуки ударів лунають від мату, коли в нього влучають м'ячі."
                            p "Гаразд, поки що все виглядає досить добре."
                            "Гучний стукіт лунає, коли один з матів праворуч перекидається."
                            mc "Ось і все, немає більше укриття."
                            "Я визираю з-за мату."
                            "Сайорі продовжує передавати м'ячі і намагається підтримати своїх товаришів по команді вогнем."
                            "Моніка ухиляється і кидає м'ячі, жодного разу не промахнувшись."
                            "Наша команда починає рідшати, оскільки її повільно відстрілюють."
                            menu:
                                "Влучити в Моніку":
                                    mc "Я спробую влучити в Моніку, ти виведи з гри Сайорі."
                                    p "Зрозумів."
                                    "ГГ і я беремо м'ячі і готуємося кинути їх у наші цілі."
                                    show monika 3j at t11
                                    "Моніка продовжує ухилятися від будь-якого м'яча, що наближається, і відмовляється здаватися."
                                    show monika forward ldown rhip vsur cm oe at s11
                                    "Вона ковзає на секунду, але встигає втриматися."
                                    "Це мій шанс."
                                    "Я готую свій м'яч і роблю кидок."
                                    "Він проноситься повз інших і летить прямо в неї."
                                    show monika 3a at t11
                                    "В останню секунду вона піднімає руку і безжально ловить його."
                                    "У цей момент я падаю на коліна."
                                    "Я приймаю поразку і падаю на підлогу."
                                    scene black
                                    with Dissolve(2.0)
                                    "ГГ вдається влучити в Сайорі, але Моніка, використовуючи м'яч, який я кинув, кидає його в нього, збиваючи його з ніг."
                                    "Він також падає на підлогу, і, оскільки Моніка досі непереможна, вона відстрілює останніх членів нашої команди."
                                    "Лунає свисток, і дівчата здобувають перемогу над нами."
                                    scene bg gym
                                    with Dissolve(2.0)
                                    "Я відкриваю очі і встаю."
                                    $ persistent.dodgewin = False
                                    jump dodgeend
                                "Влучити в Сайорі":
                                    mc "Я спробую влучити в Сайорі."
                                    p "Зрозумів."
                                    p "Я спробую влучити в Моніку."
                                    "ГГ і я беремо м'ячі і готуємося кинути їх у наші цілі."
                                    show sayori 4o at t11
                                    "Сайорі підтримує запас боєприпасів і намагається влучити в одного з хлопців."
                                    "Вона промахується, і я використовую можливість кинути в неї м'яч, поки вона відволіклася."
                                    "Він проноситься повз деяких з її товаришів по команді, летячи прямо в неї."
                                    show sayori 4p at h11
                                    "Я влучаю їй в груди, і вона трохи відступає."
                                    show sayori 4p:
                                        2.0
                                        easeout_cubic 1.0 yoffset 1000
                                    "Вона падає на купу м'ячів, які зібрала."
                                    hide sayori
                                    "Я швидко беру ще один м'яч і повертаюся, щоб подивитися на ГГ і Моніку."
                                    show monika 3h at t11
                                    "ГГ кидає м'яч у Моніку, яка, здається, збирається ухилитися від нього і кинути свій м'яч в ГГ."
                                    $ time = 1
                                    $ timer_range = 1
                                    $ timer_jump = 'dodgelose'
                                    show screen countdown
                                        pass
                                    menu:
                                        "Влучити в Моніку":
                                            hide screen countdown
                                                pass
                                            "Коли вона починає нахилятися, щоб ухилитися, я швидко готую свій м'яч і кидаю його в те місце, куди вона збирається приземлитися."
                                            show monika 3a
                                            "Вона кидає свій м'яч одночасно зі мною, і я спостерігаю, як ГГ відлітає назад від м'яча, що влучив йому в живіт."
                                            show monika forward lpoint rdown neut e2a at h11
                                            "У той же час я бачу, як м'яч, який я кинув, вдаряє Моніку в центр грудей."
                                            "Прямо в її серце."
                                            show monika 3e
                                            "Її очі блищать, коли вона отримує удар."
                                            show monika forward lpoint rdown nerv cm ce:
                                                2.0
                                                easeout_cubic 1.0 yoffset 1000
                                            "Сльоза падає, коли вона падає на землю зі спокійною посмішкою на обличчі."
                                            "..."
                                            "Цей останній удар зумів трохи підняти моральний дух нашої команди."
                                            "Ми прискорюємо темп і робимо більш ризиковані рухи з-за укриття."
                                            "Незабаром ми ліквідуємо те, що залишилося від команди дівчат."
                                            "Лунає свисток."
                                            "Перемога за нами!"
                                            "Чувак" "УУУУУУУУ!!!"
                                            "Чувак" "Вперед!!!"
                                            "Наша команда радіє нашій перемозі."
                                            $ persistent.dodgewin = True
                                            jump dodgeend
                        "Влучити в Сайорі":
                            "Я наводжу очі на Сайорі."
                            show sayori 4o at t11
                            "Я дивлюся, як вона бере м'яч і кидає його своїй товаришці по команді."
                            "Готуючись влучити в неї, знаходячи ідеальний кут, щоб зробити хороший кидок,"
                            show sayori 1b
                            "Вона дивиться на мене, коли я готуюся кинути в неї м'яч."
                            show yuri turned ldown rup angr cm oe at l11
                            "Коли м'яч летить до неї, з нізвідки вискакує Юрі і блокує м'яч від влучання в неї своїм м'ячем."
                            "Після цього в мене влучає інший м'яч у руку."
                            show sayori at thide
                            hide sayori
                            show yuri at thide
                            hide yuri
                            show monika forward lpoint rdown sedu cm oe at t11
                            "Я повертаюся і бачу Моніку із самовдоволеним виразом обличчя, коли я падаю на землю."
                            scene black
                            with Dissolve(2.0)
                            "Все лунає навколо, коли ми повільно починаємо втрачати членів команди."
                            p "Чорт, в мене влучили..."
                            "Я чую гучний стукіт поруч зі мною, коли падає мат."
                            "Я відчуваю, як м'яч рикошетить від моєї ноги від невдалого кидка."
                            "Якраз коли лунає свисток, що сигналізує про кінець гри."
                            scene bg gym
                            with Dissolve(2.0)
                            "Я відкриваю очі і встаю."
                            $ persistent.dodgewin = False
                            jump dodgeend
        "Сидіти осторонь.":
            "Моніка дивиться на мене."
            show monika 1b at t11
            m "Гей, [player]!"
            m "Давай зіграємо!"
            show monika 1c
            mc "Дякую, не хочу."
            m 1g "Ауу..."
            m "Ну, я все одно йду туди грати."
            m "Ти впевнений?"
            show monika 1f
            mc "Так, вибач, Моніко."
            m 1g "Гаразд, як хочеш."
            show monika at thide
            hide monika
            "Моніка знімає піджак і йде на бік дівчат."
            "Лунає свисток, що сигналізує про початок гри."
            scene bg gym
            with wipeleft_scene
            "Гра закінчується після того, як Моніка завдає останнього удару стороні хлопців."
            "Вона підходить до мене, і крапля поту стікає з її чола."
            show monika 3k at t11
            m "Це було так весело!"
            mc "Я радий, що тобі сподобалося."
            m 1b "Тобі теж варто було приєднатися!"
            m "Було б чудово, якби ти це зробив!"
            mc "Можливо, наступного разу, Моніко."
            m "Гаразд."
            jump exitgym
label dodgelose:
    "Моніка граційно ухиляється від м'яча ГГ і кидає свій прямо в нього."
    show monika 3a
    "ГГ падає на землю від удару в живіт."
    "Я кидаю м'яч у Моніку з усієї сили."
    show monika at h11
    "Вона дивиться прямо на мене, перш ніж легко зловити мій м'яч."
    "Чорт, я вибув."
    "Я падаю на підлогу після того, як вона самовдоволено посміхнулася."
    scene black
    with Dissolve(2.0)
    "Звуки війни лунають навколо мене."
    "Я чую вереск взуття, що бігає навколо, і м'ячі, що стукають як об людей, так і об стіни."
    "Коли я помічаю, що кількість членів нашої команди починає зменшуватися, я розумію, що на боці дівчат також стає менше."
    "Незабаром я чую лише три пари взуття, що бігають навколо."
    "Я помічаю, що двоє з них позаду мене."
    "Це означає..."
    "Я швидко заглядаю на бік дівчат."
    scene bg gym
    show monika 1h at t11
    with Dissolve(2.0)
    "Моніка стоїть як єдина, хто вижив на боці дівчат."
    "Двоє хлопців швидко кидають кілька м'ячів один за одним у неї."
    show monika 3h
    "Вона розвертається, ловлячи один м'яч, ухиляючись від іншого."
    "Зберігаючи той самий імпульс від хлопця, який його кинув, вона запускає м'яч у хлопця, від м'яча якого вона ухилилася."
    show monika 1l
    "З останнім вибулим лунає свисток."
    show monika at thide
    hide monika
    $ persistent.dodgewin = False
    jump dodgeend
label dodgeend:
    stop music fadeout 2.0
        pass
    "І на цьому всі повертаються на трибуни, щоб забрати свої речі."
    play music t8
        pass
    if persistent.dodgewin == True:
        "Я повертаюся туди, де ми з Монікою залишили свої речі, дещо самовдоволений перемогою нашої команди."
        "Моніка теж підходить."
        show monika 1k at l11
        m "О, це було весело!"
        m 3b "Не можу повірити, що ти влучив у мене!"
        m 3k "Гарний кидок!"
        show monika 1a
        mc "Дякую!"
        mc "І гарна гра, було дуже весело грати проти тебе!"
        m 1j "Хехе~"
        m 5a "Я хочу спробувати це знову колись."
        m "І наступного разу я не програю!"
        show monika 1a
        mc "Ха! Удачі!"
        mc "Ті рухи, які ти робила, однак..."
        mc "Це було чудово!"
        m 5a "Дякую~"
        m "Я справді старалася!"
    else:
        "Я повертаюся туди, де ми з Монікою залишили свої речі, з відчуттям поразки."
        "Хоча, мушу визнати, це було дуже весело!"
        "Моніка теж підходить, захекана."
        show monika 1b at l11
        m "Це було так весело!"
        m "Це була епічна битва!"
        show monika 1a
        mc "Ти так кажеш!"
        mc "Тобі вдалося так швидко мене вибити!"
        m 1l "Хехе~ Вибач!"
        show monika 1a
        mc "Хоча ті рухи, які ти робила, були дивовижні!"
        mc "Я знаю, що ти атлетична, але це..."
        mc "Я ніколи не бачив нічого подібного раніше!"
        m 3b "Ну, я теж багато грала у вибивала в дитинстві!"
        m 5a "І я не з тих, хто легко приймає поразку..."
        m "Я думаю, це просто практика!"
        show monika 1a
        mc "У будь-якому випадку, гарна гра!"
        mc "Було весело грати проти тебе!"
    jump exitgym
label exitgym:
    show monika 1a
    "Ми збираємо наші речі та виходимо зі спортзалу."
    stop music fadeout 2.0
        pass
    scene bg corridor
    with wipeleft_scene
    show monika 1a at t11
    play music t12
        pass
    mc "Добре, куди ми йдемо далі?"
    m 1b "У шаховий клуб."
    m 3n "Я думаю, ми пропустили наш шанс зареєструватися для участі, однак..."
    show monika 1m
    mc "Нам потрібно було зареєструватися?"
    m 1n "Так, на папері біля їхніх дверей було написано, що ми повинні були це зробити."
    m 1l "Вибач, я думала, ти вже бачив це!{w=0.5} Тому я нічого про це не казала."
    show monika 1e
    mc "Все гаразд. Шкода, я б хотів спробувати зіграти з тобою!"
    m 1d "Ну, ми завжди можемо піти купити шаховий набір і грати вдома, якщо хочеш."
    show monika 1a
    mc "Так, можливо, влітку ми могли б це зробити."
    mc "Ну, в будь-якому випадку,{w=0.5} я думаю, оскільки ми не можемо цього зробити, ти просто хочеш трохи погуляти школою?"
    m 1b "Звичайно!"
    m 3b "Я думаю, що наступне - це клуб активного відпочинку, тож ходімо на вулицю!"
    show monika 1a
    mc "Добре."
    "Ми виходимо через передні двері."
    scene bg outside
    with wipeleft_scene
    "Приємний вітерець проноситься повз, коли ми робимо крок на вулицю."
    show monika 1j at f11
    "Моніка бере мене за руку, коли ми йдемо стежкою навколо школи."
    "Ми проходимо повз кіоски, які встановили вчителі, і помічаємо кількох інших учнів, які купують там закуски."
    m 1b "Тут так гарно!"
    m "Не надто холодно, але й не пекельна спека."
    show monika 1a
    mc "Так."
    "Ми мовчки йдемо стежкою навколо школи."
    "Моніка порушує тишу."
    m 1b "Тож я ходила в кімнату студентської ради іншого дня, щоб принести деякі документи."
    m 2d "І повітря в кімнаті було таким напруженим, коли я туди зайшла."
    m "Я думаю, я бачила, як скарбник виходив з мертвим поглядом в очах."
    m "Бідного хлопця, мабуть, вилаяли чи щось таке."
    m "І коли я зайшла, було надзвичайно напружено і тихо."
    m 1l "Настільки, що я просто залишила документи і швидко пішла!"
    show monika 1a
    mc "Блін, цікаво, що сталося."
    m 3n "Так, це було жахливо."
    m 1b "Принаймні вони вирішили це."
    m 1d "...Я думаю."
    show monika 1a
    mc "Сподіваюся, що так."
    show monika at thide
    hide monika
    "Ми йдемо до поля."
    "Я помічаю, як деякі учні вдалині щось встановлюють."
    show monika 1c at t11
    mc "Я думаю, що це клуб активного відпочинку там."
    m 1d "Так, я теж так думаю."
    m "Ти чула, однак?"
    m 1b "Очевидно, вони отримали комору для зберігання речей як клубну кімнату."
    show monika 1a
    mc "Справді?"
    m 3b "Так, оскільки їх не так багато, і вони більшість часу проводять на вулиці."
    show monika 1a
    mc "Вау, я не думав, що школа може це зробити."
    m 1d "Здається, що можуть."
    m "Сайорі розповідала мені про це колись."
    m "Один з її друзів є в клубі активного відпочинку."
    m 3d "Я думаю, що це Надешiко там."
    show monika 1a
    mc "Ти її знаєш?"
    m 1b "Так, вона подруга Сайорі, про яку я говорила."
    show monika 1a
    mc "Хм."
    mc "Хочеш подивитися, що вони роблять?"
    m 1d "Звичайно."
    show monika 1a
    "Ми прямуємо до них і сідаємо на лавку поруч."
    show monika at thide
    hide monika
    "Я відкидаюся назад і спостерігаю, як п'ятеро з них встановлюють невелике місце для багаття."
    "Насправді,{w=0.5} не одне місце для багаття."
    "Схоже, що три з них!"
    "Я також помічаю купу зефіру та паличок, які вони мають збоку."
    mc "Ти думаєш, ми зможемо підсмажити трохи зефіру?"
    m "Можливо."
    "Ми сидимо ще кілька хвилин, поки до початку події не залишиться п'ять хвилин."
    mc "Добре, я думаю, ми можемо піти туди зараз."
    m "Так, ходімо!"
    "Ми встаємо з нашої лавки і прямуємо до них."
    "Дівчина 1" "\"Привіт!{w=0.5} Ви двоє прийшли сюди на нашу подію?\""
    m "Так!"
    "Дівчина 2" "\"Ооо!{w=0.5} Наші перші клієнти!\""
    "Дівчина 3" "\"Привіііт!\""
    mc "Привіт!"
    "Дівчина 1" "\"Якщо ви хочете взяти паличку і зефір,{w=0.5} ви двоє можете сісти біля вогню і підсмажити його, якщо хочете.\""
    "Дівчина 1" "\"Це чверть долара за зефір, однак.\""
    "Я дістаю свій гаманець і даю їй долар."
    mc "Чотири, будь ласка!"
    "Дівчина 1" "\"Звичайно! Ось, тримайте!\""
    mc "Дякую."
    show monika 3j at t11
    "Я даю Моніці два з них і паличку."
    show monika 1a at s11
    "Ми присідаємо біля вогню і повільно підсмажуємо їх."
    "Незабаром кілька інших збираються і присідають поруч з нами, щоб готувати."
    show monika at thide
    hide monika
    "Я помічаю, як Сайорі і Надешiко розмовляють біля вогню поруч з нами."
    "Коли мій зефір набуває золотисто-коричневого кольору, я знімаю його з вогню і чекаю, поки Моніка закінчить свій."
    show monika 3a at t11
    "Вона встає і підходить до мене."
    mc "Хочеш піти сісти назад на лавку, на якій ми сиділи?"
    m 3b "Звичайно!"
    show monika at thide
    hide monika
    "Ми сідаємо назад на лавку, і я відкушую один зі своїх зефірів."
    "Смачно!"
    "Моніка також пробує свій, і її очі сяють."
    m "Знаєш, нам точно варто піти в похід колись."
    mc "Так, це було б весело."
    m "Тільки ми двоє спимо під зірками."
    mc "Трохи важко уявити це посеред дня, однак."
    m "Так, це підійшло б набагато краще, якби був вечір."
    m "Трохи псує момент, але ми мало що можемо з цим зробити."
    mc "Так."
    "Ми жуємо наш зефір."
    "Час повільно минає, коли ми слухаємо звуки фестивалю."
    mc "Тож,{w=0.5} куди далі?"
    m "У кулінарний клуб!"
    mc "Добре, ти хочеш піти туди?"
    m "Звичайно."
    "Ми встаємо і прямуємо до дверей."
    show monika 1c at t11
    mc "Я чув щось минулого тижня, що вони роблять кафе."
    m 1d "Так, я думаю, що так і є."
    m 3d "Нацукі сказала мені, що вона і студенти з домашнього господарства збираються взяти на себе управління під час класної частини."
    show monika 1a
    mc "Круто."
    scene bg corridor
    with wipeleft_scene
    "Коли ми йдемо вниз, Моніка тримає мене за руку."
    "Ми доходимо до кімнати домашнього господарства, але двері зачинені."
    show monika 1d at t11
    m "Я не думаю, що вони збираються відкрити, поки не почнеться їхня частина."
    show monika 1c
    mc "Давай просто почекаємо тут до того часу."
    m 1d "Так, це всього лише що? Десять хвилин?"
    show monika 1c
    "Ми стоїмо навколо деякий час, я перевіряю свій телефон, а Моніка перевіряє свій."
    "Незабаром за нами утворюється невелика черга."
    "Ми відкладаємо наші телефони, і я тримаю Моніку за руку, поки ми чекаємо, поки двері відчиняться."
    "Через кілька хвилин це відбувається."
    "Виходить офіціантка."
    "Офіціантка" "\"Привіт! Столик на двох?\""
    mc "Так, будь ласка!"
    "Офіціантка" "\"Сюди, будь ласка.\""
    scene bg class_day
    with wipeleft_scene
    show monika 1a at t11
    "Ми сідаємо, і я дивлюся на меню."
    "Офіціантка" "Дайте знати, коли будете готові зробити замовлення."
    mc "Дякую!"
    "Офіціантка йде обслуговувати когось іншого."
    mc "Бачиш щось, що тобі подобається?"
    m 3b "Думаю, я візьму один із цих англійських мафінів."
    m 1b "А ти?"
    show monika 1a
    mc "Думаю, я візьму те саме, що й ти."
    mc "Вибачте! Ми б хотіли замовити, будь ласка!"
    "Офіціантка повертається з блокнотом."
    "Офіціантка" "\"Гаразд! Що б ви хотіли?\""
    mc "Ми візьмемо два англійських мафіни."
    "Офіціантка" "\"Ще щось?\""
    mc "Давайте дві кави, будь ласка."
    "Офіціантка" "\"Добре! Зараз принесу!\""
    "Офіціантка йде по наше замовлення."
    m 1d "Думаю, у них зміниться меню після того, як студенти з Домашньої Економіки візьмуться за справу."
    m 1b "Нам варто повернутися після!"
    show monika 1a
    mc "Так, варто!"
    mc "І я запитаю, чи буде тут Нацукі."
    m "Добре."
    "Офіціантка повертається з підносом у руці."
    "Офіціантка" "\"Ось ваші мафіни та кава! Смачного!\""
    mc "У мене є запитання."
    "Офіціантка" "\"Питайте!\""
    mc "Нацукі ж у цьому класі, так?"
    "Офіціантка" "\"О, ви з нею друзі?\""
    "Офіціантка" "\"Вона наш головний пекар.\""
    "Офіціантка" "\"Шкода, що вона вирішила приєднатися до іншого клубу.\""
    "Офіціантка" "\"Але вона повернеться пізніше сьогодні на другу частину фестивалю, якщо це те, що тебе цікавить.\""
    mc "Так, мені було просто цікаво. Дякую."
    "Офіціантка" "\"Без проблем, я залишу вас насолоджуватися їжею.\""
    "Офіціантка" "\"І якщо побачите Нацукі, передайте їй, що вона нам тут дуже потрібна.\""
    mc "Передам!"
    "Вона йде, і ми починаємо їсти."
    m forward lpoint rdown vsur cm oe "Оу! Це смачно!"
    mc "Мгм. Ми точно повернемося пізніше."
    m 3k "Так, повернемося~!"
    show monika 1a
    "Ми доїдаємо, і я йду платити за нашу їжу."
    "Офіціантка" "\"З вас 6 доларів.\""
    mc "Тримайте!"
    "Офіціантка" "\"Дякую! Приходьте ще!\""
    "Ми виходимо з кафе, тримаючись за руки."
    scene bg corridor
    with wipeleft_scene
    show monika 1c at t11
    mc "Думаю, це останній клуб, так?"
    m 1d "Так, тепер обідня перерва."
    show monika 1a
    "Ми прямуємо до їдальні."
    "Зазвичай, цей час виділяється для реорганізації та відпочинку."
    "Однак, оскільки наш клас нічого не робить, ми змушені блукати школою годину."
    mc "Гей, Моніко, хочеш вийти на вулицю на трохи?"
    m 1b "Звісно!"
    m 3k "Було б приємно знову подихати свіжим повітрям!"
    show monika 3j
    "Ми виходимо разом."
    scene bg outside
    with wipeleft_scene
    "Я знаходжу зручну лавку в тіні, і ми сідаємо разом."
    "Яскраво світить сонце, і погода тепліша."
    "Також віє прохолодний вітерець, тому не надто спекотно в нашій формі."
    show monika 1a at f11
    mc "Отже, як тільки ми повернемося на фестиваль, що ти хочеш робити?"
    m 2q "Хм..."
    m 1b "Я б сказала, що нам варто повернутися до кафе, яке зробив клас Нацукі."
    mc "Так, хороша ідея."
    show monika 1j
    "Ми сидимо там разом, а вона притуляється до мене."
    "На диво, тут з нами мало учнів."
    "Лише кілька тих, чиї класи також нічого не робили."
    "Хоча більшість із них тримаються у своїх маленьких групках."
    "Не те щоб це мало значення, я проводжу час зі своєю чудовою дівчиною."
    mc "Гей, Моніко..."
    m "Хм?"
    mc "Хочеш трохи пройтися школою знову?"
    m 1k "Ммм... звісно..."
    show monika 1a at t11
    "Ми встаємо і починаємо йти по стежці навколо школи."
    scene bg outside
    with wipeleft_scene
    "Поки ми йдемо, ми бачимо кількох однокласників, які повертаються, щоб поповнити запаси."
    show monika 1k at t11
    m "Схоже, вони готуються до пізнішого."
    show monika 1a
    mc "Так. Якщо я пам'ятаю минулорічний фестиваль, там було багато кіосків з їжею."
    mc "Б'юся об заклад, що вони роблять щось подібне і цього року!"
    m 3k "Так!"
    m 4b "І там мають бути сувенірні крамнички від студентів Промислових Мистецтв."
    show monika 1a
    mc "Справді? Я не думав, що вони будуть робити щось подібне."
    m 1b "Так, я чула це від однієї з моїх однокласниць, яка цим займається."
    show monika 1a
    mc "Круто!"
    scene bg outside
    with wipeleft_scene
    "Ми продовжуємо йти, поки не повертаємося до лавки, з якої почали."
    "Я дивлюся на годинник."
    "{i}12:50{/i}"
    mc "Моніко, давай повертатися, друга частина фестивалю ось-ось почнеться."
    m "О, гаразд."
    m "Думаю, ми можемо починати ставати в чергу, щоб зайняти місце в кафе."
    mc "Так!"
    scene bg corridor
    with wipeleft_scene
    show monika 1j at t11
    "Ми повертаємося всередину і прямуємо до кабінету Домашньої Економіки."
    scene bg corridor
    with wipeleft_scene
    show monika 1a at t11
    "Ми добираємося до кафе якраз вчасно, перш ніж задзвонить дзвоник."
    "Таким чином, ми одні з перших у черзі, щоб увійти!"
    "Waitress" "\"О! Знову привіт!\""
    m 1k "Привіт!"
    show monika 1a
    "Waitress" "\"Отже, столик на двох знову?\""
    m 1b "Так!"
    "Waitress" "\"Сюди, будь ласка.\""
    scene bg class_day
    with wipeleft_scene
    show monika 1a at t11
    "Нас проводять до іншого столика, і ми сідаємо."
    "Офіціантка" "\"Гаразд! У нас зараз діє обіднє меню, якщо хочете поглянути на нього.\""
    mc "Дякую."
    "Вона вручає нам два меню, і я відкриваю своє."
    "Хм..."
    mc "Я візьму сендвіч із сиром на грилі, будь ласка!"
    m 1b "А я візьму один із ваших овочевих сендвічів."
    show monika 1a
    "Офіціантка" "\"Сендвіч із сиром на грилі і сендвіч...\""
    "Офіціантка" "\"...Гаразд! Щось випити?\""
    mc "Два стакани апельсинового соку, будь ласка!"
    "Офіціантка" "\"Добре! Я зараз повернуся з вашою їжею.\""
    stop music fadeout 1.0
        pass
    n "Що ти РОБИШ?"
    play music t7
        pass
    n "Що ЦЕ?"
    "Студент" "\"Сендвіч...\""
    n "ТИ НАЗИВАЄШ ЦЕ СЕНДВІЧЕМ?"
    play sound "sfx/slap.ogg"
        pass
    "{i}*ляпас*{/i}"
    n "ЩО ТИ ТАКЕ?"
    "Студент" "\"Сендвіч-ідіот...\""
    n "Сендвіч-ідіот ЩО?"
    "Студент" "\"Сендвіч-ідіот, шеф Нацукі...\""
    n "Гаразд! ТЕПЕР ПОВЕРТАЙСЯ ТУДИ І ВИПРАВЛЯЙ СВІЙ БЕЗЛАД!"
    "Студент" "\"Т-Так, шеф, вибачте, шеф...\""
    n "Господи..."
    n "Знаєш що?"
    n "Давай я зроблю це. Працюй над наступним замовленням."
    "Студент" "\"Д-Добре. Вибачте...\""
    stop music fadeout 2.0
        pass
    "Минає кілька миттєвостей, і Нацукі виходить з кухні з їжею в руці."
    play music t8
        pass
    n "Гаразд, хто замовляв сендвіч із сиром на грилі та сендвіч?"
    "Офіціантка" "\"Та парочка там.\""
    "Вона вказує на нас."
    show natsuki 1bl at l21
    show monika at t22
    show natsuki at f21
    n "Гей, друзі!"
    n "Це ви замовляли?"
    show natsuki 1bj at t21
    show monika 1b at f22
    m "Так!"
    m 3k "Дякую, Нацукі!"
    show monika 1a at t22
    show natsuki 1bd at f21
    n "Нема за що!"
    n 5bd "Смачного!"
    n 1ba "..."
    n 2bv "Гаразд, люб'язності закінчені."
    n 1bd "Я справді не очікувала побачити вас тут!"
    show monika 1b at f22
    show natsuki 5ba at t21
    m "Так, я не думала, що ти тут головний шеф!"
    show natsuki 1bc at f21
    show monika 1c at t22
    n "Ну, насправді, ні."
    n "Я головний пекар, але не шеф."
    n "Просто я зазвичай допомагаю команді з їжею, поки печу."
    n 5be "Але вони ідіоти, тому мені доводиться виправляти їхні помилки."
    n 3bd "У будь-якому разі..."
    n 5bd "Ви двоє зараз на побаченні?"
    show monika 2j at f22
    show natsuki 5ba at t21
    m "Мгм~"
    show monika 2a at t22
    mc "Саме так!"
    show natsuki 5bx at f21
    n "Цк... Ви двоє..."
    n 5by "Бачу, навіть під час навчання не можете без цього..."
    n 5bd "Гаразд. Залишаю вас насолоджуватися їжею."
    show monika 2c
    n 3bz "І це за рахунок закладу! Тож їжте, скільки хочете!!"
    show natsuki 3bz at lhide
    hide natsuki
    show monika 1d at t11
    n "Бувай!"
    show monika 3d at f11
    m "Стривай! Нацукі!"
    n "І не намагайтесь сперечатися!"
    n "Інакше я дам вам обом ляпас!"
    show monika 1e at t11
    m "Гаразд..."
    mc "Давай насолоджуватися цим."
    mc "Не так часто можна побачити Нацукі такою."
    m 1l "Хех, так..."
    m 1k "Давай їсти!"
    show monika 3j
    "Ми починаємо їсти."
    "Одразу помітно, що це зробила Нацукі, бо все професійно."
    mc "Гей, Моніко, дай спробувати твій сендвіч."
    m 1b "Хм? Звісно!"
    m forward lpoint rdown sedu om oe "Але ти мусиш дати мені спробувати свій теж!"
    show monika 3j
    mc "Добре."
    "Ми міняємося тарілками і кусаємо сендвічі одне одного."
    "Я скажу, що це дуже смачно!"
    "Ми міняємося назад і продовжуємо їсти."
    scene bg class_day
    show monika 1j at t11
    with wipeleft_scene
    "Ми доїдаємо і встаємо."
    mc "Було смачно."
    m 1k "Мгм! Тільки Нацукі може приготувати щось таке хороше."
    show monika 1a
    mc "Так. Гаразд, ходімо, нам ще треба подивитися решту фестивалю!"
    m 1b "Так, ходімо!"
    show monika 1a
    mc "До зустрічі, Нац!"
    show monika forward ldown rdown laug cm oe
    n "Не називай мене так!"
    show monika 1a
    n "І так, побачимося пізніше!"
    scene bg corridor
    with wipeleft_scene
    show monika 1a at t11
    "Ми виходимо і прямуємо до інших класів."
    "Незабаром ми доходимо до класу Сайорі та Юрі."
    show monika 1c
    "Схоже, вони влаштували будинок з привидами."
    mc "Хочеш зайти?"
    m 1k "Звісно, але тільки якщо ти будеш поруч зі мною весь час."
    show monika 1a
    mc "Добре!"
    "Стідент" "\"Ласкаво просимо! Хочете зайти до нашого класу жахів?\""
    mc "Так!"
    "Стідент" "\"Гаразд, тоді заходьте через двері, будь ласка!\""
    mc "Дякую!"
    "Ми з Монікою заходимо в двері."
    stop music
        pass
    scene black
    with wipeleft_scene
    play sound closet_close
        pass
    "Щойно ми зайшли, двері одразу ж зачиняються за нами."
    "Починає говорити голос..."
    "Оповідач" "\"Ласкаво просимо...\""
    "Оповідач" "\"Бачу, сьогодні у нас тут пара...\""
    "Оповідач" "\"Охуху... це буде весело...\""
    "Оповідач" "\"Ви двоє будете проходити через день...\""
    "Оповідач" "\"...у Північній Зонi.\""
    "Майже повна темрява, але мої очі звикають за кілька секунд."
    "Ми проходимо повз маленькі краплі крові."
    "Шлях веде нас до шафи,"
    "Оповідач" "\"Ми починаємо нашу подорож вранці.\""
    "Оповідач" "\"Зрештою, підготовка до дня — важливий крок.\""
    play sound closet_open
        pass
    "Яка, коли ми підходимо ближче, сама по собі м'яко відчиняється..."
    "Оповідач" "\"Але для однієї людини це не означає одягатися до школи...\""
    show s_kill at t21
    show dark zorder 100
    "Оповідач" "\"Можна сказати, вона «висіла» деякий час, перш ніж почалася школа, хе-хе-хе...\""
    hide s_kill
    play sound closet_close
        pass
    hide dark
    "Шафа знову зачиняється."
    "Що за чортівня?"
    "Моє серце трохи стискається, коли я це побачив."
    "Моніка хапає мене за руку."
    "Я шепочу їй."
    mc "Ти в порядку?"
    m "*схлип* Т-Так, я просто... трохи злякалася..."
    mc "Добре, ходімо далі."
    "Оповідач" "\"Перший урок — це не те, що більшість вважають веселим.\""
    "Оповідач" "\"Однак, для деяких учнів це досить, щоб аж кістки забрязчали від страху!\""
    "Поряд зі стежкою лежить підвішений скелет."
    "Скелет" "\"Рааагх!\""
    m "Ой!"
    "Коли скелет тягнеться до нас, Моніка знову стрибає мені на руку."
    "Оповідач" "\"Отже, поки ми проходимо через день, люди зголодніють.\""
    "Оповідач" "\"Коли люди голодні, це означає, що настав час обіду!\""
    "У кутку кімнати, схоже, сидить учень."
    "І він щось їсть..."
    "Я придивляюся ближче і розумію..."
    "...Він їсть плоть іншого учня."
    "Інший учень лежить поруч, з величезною раною на верхній частині тулуба."
    "Господи."
    "Він обертається, трохи гарчить і продовжує гризти учня."
    "Моніка здригається, міцно тримаючись за мою руку."
    "Ми продовжуємо йти вперед."
    "Оповідач" "\"Звісно, кожен учень час від часу потрапляє в аварію.\""
    "Оповідач" "\"Деякі можуть бути навіть смертельними.\""
    "Оповідач" "\"Тому будьте обережні з ножами, діти!\""
    "Ми повертаємо за ріг."
    image deadyuri = "cg/y_kill/3c.png"
    show deadyuri with Dissolve(1.0)
    "Моніка заплющує очі і міцно обіймає мене."
    "Вона шепоче щось собі під ніс..."
    m "Чому..."
    m "Ц-Це не справжнє..."
    m "Це не справжнє..."
    m "Це просто будинок з привидами."
    mc "Ходімо далі."
    mc "Це просто будинок з привидами."
    mc "Ми майже наприкінці."
    m "*Схлип*{w=0.5} Д-Добре..."
    hide deadyuri
    "Ми проходимо повз тіло."
    "Оповідач" "\"Наприкінці дня, дехто може сказати, що це поганий час, щоб прокинутися та поснідати.\""
    "Оповідач" "\"Для деяких людей, це, натомість, справжній бенкет.\""
    "Я бачу дівчину з довгим волоссям, яка стоїть біля імпровізованого вікна."
    "Вона повертає голову, щоб показати криваву посмішку з довгими зубами."
    play sound "sfx/run.ogg"
        pass
    "???" "\"ШИИИИИИИШ\""
    m "ААААА!"
    "Вона женеться за нами до дверей."
    scene bg corridor
    with wipeleft_scene
    show monika forward ldown rdown pani cm oe at f44
    "???" "\"Шиш..*кашель* ха-ха-ха!\""
    show monika forward neut md e1g b1b at t44
    "Вона трохи сміється."
    "???" "\"Вибачте за це.\""
    "???" "\"Сподіваюся, вам було весело!\""
    "???" "\"Ох...\""
    "???" "\"Т-Ти в порядку?\""
    m forward ldown rdown neut mb e1g b1b "Ох, Т{w=0.1}-Так,{w=0.5} я в нормі,{w=0.5} просто було трохи страшно..."
    show monika forward ldown rdown ma e1g b1b at s44
    "???" "\"Гаразд, вибачте за це!\""
    "???" "\"Але сподіваюся, ви повеселились!\""
    m forward ldown rdown neut mb e1g b1b "Так, я-я думаю, що просто піду сяду на деякий час."
    show monika forward ldown rdown ma e1g b1b
    "???" "\"Д-Добре, вибачте за те, що налякала!\""
    "???" "\"Побачимося пізніше!\""
    mc "Дякую, і хороша робота над будинком, він нас добряче налякав!"
    "???" "\"Дякую, побачимося!\""
    "Вона повертається всередину."
    show monika forward ldown rdown cry cm oe at t11
    mc "Ходімо знайдемо лавку."
    m forward ldown rdown neut mb e1g b1b "Дякую..."
    scene bg corridor
    with wipeleft_scene
    show monika forward ldown rdown neut ma e1g b1b at t11
    play music t10
        pass
    "Ми сідаємо."
    show monika at f11
    "Я міцно її обіймаю."
    m "*схлип*{w=0.5} Дякую, [player]."
    menu:
        "Не хвилюйся, я поруч.":
            pass
    show monika forward ldown rdown neut ma e4d b1b
    "Ми сидимо, обнявшись, добрих кілька хвилин, поки вона не заспокоюється."
    menu:
        "Краще?":
            pass
    m forward ldown rdown neut mb e4a b1b "Так..."
    m 1n "Я просто не очікувала знову пережити це."
    m 1r "Бачити їх... такими..."
    menu:
        "Мені шкода...":
            m 1e "Дякую, що ти зі мною..."
            m forward ldown rdown neut mb e1a b1b "Мені набагато краще з тобою..."
            m forward ldown rdown neut mb e4a b1a "Давай побудемо так ще трохи."
        "Ти ж знаєш, що це було не по-справжньому.":
            m 1p "Так, але справа в тому..."
            m 1r "Я боюся своїх минулих вчинків..."
            m "Я наробила стільки помилок... І не хочу їх повторювати..."
            menu:
                "Ти їх не повториш, я це знаю.":
                    m 1l "Сподіваюся..."
                    m 1e "Дуже дякую."
                    m forward ldown rdown neut mb e4a b1a "Давай просто побудемо так ще трохи."
                "Не хвилюйся, це все в минулому.":
                    m 1p "Але я все ще боюсь..."
                    m 1r "Я все ще думаю, що я..."
                    menu:
                        "{i}Міцніше обійняти{/i}":
                            m "Га?"
                            m forward ldown rdown neut mb e4a b1a "Дуже тобі дякую..."
                        "Моніко, ти не зробиш цього.":
                            menu:
                                "Все буде добре. Ти ніколи не зробиш цих помилок знову.":
                                    m 1q "..."
                                    m 1r "Сподіваюся..."
                                    m 3g "І, будь ласка, зупини мене, якщо я зроблю."
                                    menu:
                                        "Не хвилюйся, Моніко.":
                                            m 1e "Дякую, [player]."
                                            m forward ldown rdown neut mb e4a b1a "Можна... ми просто побудемо так ще трохи?"
    show monika forward ldown rdown neut ma e4a b1a
    "Ми сидимо так ще добрих кілька хвилин."
    "Моніка була справді налякана після того будинку з привидами."
    "Але зараз, здається, вона трохи заспокоїлася."
    m 1l "Я вже в порядку."
    show monika 1e
    menu:
        "Гаразд, ходімо погуляємо біля кіосків з їжею.":
            menu:
                "Це має відволікти тебе.":
                    stop music fadeout 2.0
                        pass
                    m "Звісно."
    scene bg outside
    with wipeleft_scene
    play music t8
        pass
    "Ми виходимо на вулицю, щоб побачити гамір усіх кіосків з їжею."
    "Безліч учнів ходять з їжею в руках, а інші — з призами та іншими дрібничками."
    "Біля одного з кіосків ГГ старанно перевертає такоякі та передає готові іншому учневі, який пакує їх і віддає гостям."
    show monika 3b at t11
    m "О! Мені здається, там ГГ!"
    m 3k "Ходімо, привітаємося!"
    show monika 3j
    "Моніка тягне мене за собою, і ми прямуємо до кіоску з такоякі."
    show monika 1a at t22
    show protag 2k at f21
    p "Заходьте по свої такоякі!"
    show protag 1h at t21
    show monika 1b at f22
    m "Гей, ГГ!"
    show protag 1c at f21
    show monika 1a at t22
    p "О, привіт, друзі!"
    p "За такоякі?"
    p 1l "Вони щойно смажені!"
    show protag 1a at t21
    mc "Звісно! Дайте коробку з 6 штук, будь ласка!"
    show protag 1l at f21
    p "Зараз буде!"
    show protag 1a at t21
    "ГГ починає смажити наші такоякі."
    "Він збирає їх і віддає іншому учневі, який складає їх у коробку."
    "Student" "Тримайте! З вас 3 долари!"
    mc "Тримайте."
    "Студент" "Дякую! Гарного дня!"
    mc "І тобі!"
    mc "Побачимося пізніше, ГГ!"
    show protag 1l
    p "Бувай!"
    show protag 1l at thide
    hide protag
    show monika 1j at t11
    "Ми йдемо і сідаємо на ту саму лавку, де були раніше."
    "Моніка відкриває коробку і встромляє зубочистку в такоякі."
    show monika forward lpoint rdown neut mg
    "Вона дмухає на нього і кусає."
    m 1k "Ммм~! Це так смачно!"
    m 3b "Тримай..."
    show monika 3a at f11
    "Вона встромляє ще один на зубочистку і дає мені."
    show monika 1j at t11
    "Я дмухаю на нього і кусаю."
    "Він і справді був смачним."
    mc "Я, здається, ніколи раніше не їв таких такоякі."
    m 1b "Я теж."
    m "Але ж смачно, правда?"
    show monika 1a
    mc "Так!"
    "Ми з'їдаємо такоякі і залишаємося повністю задоволеними."
    mc "То що хочеш робити тепер?"
    m 1d "Не знаю."
    m "Концерти почнуться лише через годину, тож у нас є трохи часу..."
    show monika 1c at h11
    stop music fadeout 2.0
        pass
    s "Гееей!"
    "Нізвідки до нас підбігають Сайорі та Юрі."
    show sayori 4p at l32
    show yuri 3w at l31
    show monika 1c at t33
    s "Хаах{w=0.5}...хаах..."
    show sayori 4w at f32
    show yuri 1o
    play music t9
        pass
    s "Моніко, ти в порядку?!"
    s "Коли ти вийшла з будинку з привидами, я почула схлипування."
    s "Ми ж не так сильно тебе налякали, правда?"
    show sayori 4u at t32
    show yuri 1p at f31
    y "Я теж чула якесь бурмотіння, і ти сховала обличчя в його плечах..."
    show yuri 1o at t31
    show monika 1b at f33
    m "Не хвилюйтеся, я вже в порядку."
    m 1l "Думаю, я просто не дуже люблю жахи, ха-ха..."
    show monika 1a at t33
    show sayori 4w at f32
    s 4w "Вибачтеееее!"
    show sayori 1a at t32
    show monika 1e at f33
    m "Ой, ідіть сюди, ви..."
    show sayori 1t zorder 3 at t32
    show yuri 1u zorder 1 at t42
    show monika 1j zorder 2 at t43
    "Вони всі обіймаються."
    "Залишаючи мене незграбно сидіти на лавці."
    m "[player], ти не приєднаєшся?"
    mc "Звісно."
    show sayori 4q zorder 3 at f32
    show yuri 1u zorder 1 at f42
    show monika 1j zorder 2 at f43
    "Я втискаюся, і ми всі обіймаємося."
    "..."
    show sayori 1a at t32
    show yuri 1a at t31
    show monika 1a at t33
    mc "Гаразд, тепер все добре?"
    show sayori 1q at f32
    s "Мгм!"
    s 2r "Добре, ми вже повертаємося. Розважайтеся!"
    show sayori 1a at t32
    show monika 1b at f33
    m "Добре! До зустрічі!"
    show monika 1a at t33
    show yuri 1b at t31
    y "До побачення!"
    mc "Побачимося!"
    show sayori at lhide
    hide sayori
    show yuri at lhide
    hide yuri
    show monika 1j at t11
    "Сайорі та Юрі повертаються до свого класу, а Моніка сідає поруч зі мною."
    stop music fadeout 2.0
        pass
    mc "Хочеш трохи погуляти, перш ніж почнуться концерти?"
    m 1b "Звісно."
    play music t8
        pass
    show monika 1j at f11
    "Ми встаємо і прогулюємося по зовнішній території фестивалю."
    "Багато людей продають свої вироби та страви."
    "Я купую кілька снеків в одному з автоматів."
    "Збережу їх на потім..."
    "Ми підходимо до сувенірного магазину, який влаштували студенти з Промислових Мистецтв."
    "Студент" "\"Привіт! Бачите щось, що вам подобається?\""
    m 1b "О! Вони всі такі гарні!"
    show monika 1a at thide
    hide monika
    "Одна річ привертає мою увагу."
    "Це гарне намисто зі смарагдово-зеленим каменем, вставленим у шматок дерева."
    "Я дивлюся на цінник."
    "..."
    "Яка вигідна покупка!"
    "Воно на диво дешеве, враховуючи, як добре зроблено!"
    "Мій гаманець зітхає з величезним полегшенням."
    "Поки Моніка розглядає інші сувеніри, я вказую касиру, що хочу купити."
    "Він мовчки киває, бере гроші й передає мені намисто."
    "Цей хлопець дійсно вміє читати настрій."
    "Хм... Може, віддати його їй зараз?"
    menu:
        "Віддати зараз.":
            $ persistent.gifted = True
            show monika 1c at t11
            mc "Гей, Моніко..."
            m 1c "Хм?"
            mc "Обернися на секунду."
            m forward ldown rhip sedu om oe "Хммм? Гарааазд..."
            show monika at thide
            hide monika
            "Вона обертається."
            "Я швидко дістаю намисто і надягаю його на Моніку."
            show monika 1k at f11
            m "А?"
            m "О, [player]..."
            m "Дуже дякую тобі за це!"
            show monika 1j
            mc "Все для тебе!"
            mc "Ти виглядаєш з ним чудово!"
        "Віддати пізніше.":
            $ persistent.gifted = False
            "Хм... Спробую знайти кращий момент, щоб віддати його."
    show monika 1a at t11
    mc "Думаю, концерти скоро почнуться, тож нам варто йти."
    m 1b "Так, варто!"
    show monika 1j
    "Я киваю касиру, і він віддає мені честь, поки ми з Монікою прямуємо до актової зали."
    scene bg corridor
    with wipeleft_scene
    "Коли ми доходимо, там вже довга черга людей, які чекають, щоб зайти."
    "Ми стаємо в чергу і чекаємо на нашу чергу."
    "Студент" "\"Привіт!\""
    "Студент" "\"Ви двоє на концерт?\""
    mc "Так."
    "Студент" "\"Гаразд! Вхідний квиток коштує 1 долар з особи.\""
    mc "Тримай."
    "Студент" "\"Чудово! Можете проходити!\""
    mc "Дякую!"
    scene bg theater
    with wipeleft_scene
    stop music fadeout 2.0
        pass
    "Ми заходимо всередину, і там уже дуже багато людей."
    "Я помічаю порожній ряд праворуч від нас."
    mc "Сядьмо тут."
    m "Звісно."
    "Ми проходимо на середину ряду і сідаємо."
    "Інші учні повільно заповнюють актову залу."
    "Двері зачиняються, і ми сидимо, чекаючи."
    "Незабаром завіса піднімається, і натовп аплодує."
    "Шкільний оркестр і хор з'являються з-під неї."
    "Диригент говорить."
    "Диригент" "\"Дякую всім, що прийшли!\""
    "Диригент" "\"Нашою першою піснею буде головна тема з {i}\"GATE, and thus the JSDF fought there.\"{/i}.\""
    play music "mod_assets/music/gate.ogg"
        pass
    "Він піднімає паличку, і оркестр починає грати."
    "Концерт триває, і ми слухаємо чудову музику, яку грає оркестр."
    "Моніка слухає і, здається, насолоджується музикою."
    "Я радий, що їй так подобається."
    scene bg theater
    with wipeleft_scene
    "Минає година, і остання пісня закінчується."
    stop music fadeout 5.0
        pass
    "Натовп знову аплодує."
    "Диригент" "\"Дякую всім, що прийшли сьогодні!\""
    "Диригент" "\"Але залишайтеся на місці!\""
    "Диригент" "\"Далі виступатиме шкільний клуб легкої музики!\""
    "Диригент" "\"Вони почнуть десь за п'ять хвилин, щоб ми встигли прибрати сцену.\""
    "Завіса закривається, і я чую гамір підставок та інструментів, які поспішають залишити сцену."
    m "Я ніколи не думала, що вони гратимуть аніме-опенінг на шкільному концерті."
    m "Хоча я не скаржуся. У них чудово вийшло."
    m "Мені справді потрібно більше практикуватися на фортепіано, тоді, можливо, я зможу зіграти для тебе щось більше~"
    "Через кілька хвилин завіса знову починає підійматися."
    "З'являється шкільний клуб легкої музики."
    "Соло-гітарист" "\"Привіт усім!\""
    "Соло-гітарист" "\"Ми заснували клуб легкої музики з метою виступити на цьому Музичному Фестивалі.\""
    "Соло-гітарист" "\"Іноді ми працювали неповний робочий день, щоб заробити гроші на наші інструменти.\""
    "Соло-гітарист" "\"Щодня ми п'ємо чай у нашій клубній кімнаті та базікаємо.\""
    "Соло-гітарист" "\"Ми навіть проводили тренувальний табір у будинку для відпочинку Мугі.\""
    "Соло-гітарист" "\"А потім до нас захотіла приєднатися першокурсниця!\""
    "Соло-гітарист" "\"Ми не можемо сказати, що дуже наполегливо тренувалися.\""
    "Соло-гітарист" "\"Але це...\""
    "Соло-гітарист" "\"Ця сама актова зала — наш Музичний Фестиваль!\""
    "Соло-гітарист" "\"Ми будемо співати якнайкраще до самого кінця!\""
    "Соло-гітарист" "\"{i}Fluffy Time{/i}\"!"
    play music "mod_assets/music/fuwafuwatime.ogg"
        pass
    "Вони починають грати одну з пісень, які самі написали."
    "Соло-гітарист" "\"Коли я дивлюся на тебе, моє серце завжди стукає туп-туп\""
    "Соло-гітарист" "\"Це тремтяче відчуття пухнасте-пухнасте, як зефір\""
    "Вони продовжують співати і показують чудовий виступ."
    show monika 3k at t11
    "Моніка дивиться з усмішкою на обличчі й підтримує їх разом із натовпом."
    show monika at thide
    hide monika
    "Я усміхаюся, і ми всі махаємо руками разом з усіма."
    "Пісня закінчується, і вони кланяються."
    stop music fadeout 5.0
        pass
    "Соло-гітарист" "\"Далі...\""
    scene bg theater
    with wipeleft_scene
    "Концерт триває, і ми всі радіємо, коли він наближається до кінця."
    "Соло-гітарист" "\"Дякую всім, що прийшли!\""
    "Соло-гітарист" "\"Давайте ще одну!\""
    "Барабанщик" "\"Ні, Юї! Час вийшов!\""
    "Соло-гітарист" "\"Ой, гаразд!\""
    "Соло-гітарист" "\"Дякую всім!\""
    "Соло-гітарист" "\"До зустрічі!\""
    "Завіса знову закривається, і вони залишають сцену."
    m "Приємно знати, що інші клуби теж більше зосереджені на тому, щоб весело проводити час зі своїми учасниками."
    m "А не просто зациклюватися на одній меті і робити тільки те, що вимагає клуб."
    m "{i}*кашель*{/i} Як, наприклад, один особливий дебатний клуб..."
    m "Можливо, колись ми зможемо влаштувати якусь вечірку разом з клубом легкої музики."
    m "Треба буде подумати про це..."
    "Диктор" "\"Далі — шкільний клуб айдолів!\""
    "Завіса знову піднімається, і з-під неї виходять 5 дівчат у яскравих сукнях."
    "Вокалістка" "\"Привіт!\""
    "Натовп вітає її, поки вона говорить."
    "Вокалістка" "\"Дякую всім, хто прийшов сьогодні!\""
    "Вокалістка" "\"Ми тренувалися день і ніч заради цього!\""
    "Вокалістка" "\"Зазвичай на даху, бо спортзал був зайнятий.\""
    "Вокалістка" "\"День за днем, в дощ чи в сонце, ми все одно старалися з усіх сил.\""
    "Вокалістка" "\"Тож бути тут сьогодні для нас — це цілий світ!\""
    "Вокалістка" "\"Сподіваюся, вам сподобається!\""
    play music "mod_assets/music/step.ogg"
        pass
    "Починається пісня, і вони танцюють, віддаючись цьому повністю."
    "Всі махають руками в такт музиці."
    "Ми з Монікою приєднуємося."
    "Коли пісня закінчується, вони глибоко вдихають і готуються до наступної."
    scene bg theater
    with wipeleft_scene
    stop music fadeout 5.0
        pass
    "Вони закінчують свою фінальну пісню і кланяються."
    "Вокалістка" "\"Дякую, що прийшли!\""
    "Завіса знову падає."
    m "Це нагадує мені про те аніме, яке ми дивимося."
    m "Айдоли з їхніми бадьорими піснями та танцями..."
    m "Я бачу, звідки вони взяли натхнення."
    "Диктор" "\"Далі — Драматичний клуб!\""
    "Завіса піднімається, щоб показати..."
    "Нічого."
    "Хоча я не впевнений, що це дивно."
    "Незабаром, кілька учнів у костюмах виходять і показують комедійний скетч."
    "Моніка сміється в деяких моментах, а я сміюся, коли відбувається щось смішне."
    scene bg theater
    with wipeleft_scene
    play music t12
        pass
    "Після кількох скетчів і довгої вистави, члени драматичного клубу виходять, кланяються і йдуть зі сцени, поки завіса закривається."
    "Диктор" "\"На сьогодні це все, друзі!\""
    "Диктор" "\"Дякую, що прийшли і приєдналися до нас сьогодні ввечері!\""
    "Диктор" "\"Вогнище та танці відбудуться на подвір'ї приблизно через десять хвилин.\""
    "Диктор" "\"На добраніч, усім!\""
    show monika 1j at f11
    "Я тримаю Моніку за руку, поки ми виходимо з актової зали."
    scene bg a_outside
    with wipeleft_scene
    stop music fadeout 2.0
        pass
    show monika 1b at f11
    m "Ох, як це було весело!"
    show monika 1a at t11
    play music t8
        pass
    mc "Так, вони дуже талановиті!"
    m 1j "Мгм~!"
    show monika 1a
    "Здається, фестиваль закінчився."
    "Учні починають закривати свої магазини."
    "Коли ми виходимо на подвір'я, посередині ґрунтової ділянки лежить висока купа колод."
    "Учні починають збиратися навколо неї."
    m 4b "Ходімо!"
    show monika 1a
    "Ми прямуємо до групи, коли сонце починає сідати."
    show monika at thide
    hide monika
    "Ми сідаємо на траву, трохи далі від ділянки."
    "Я дістаю свою пляшку з водою і роблю невеликий ковток."
    "Моніка бере пляшку з моєї руки, коли я закінчую пити, і теж робить ковток."
    m "Схоже, вони збираються його запалити."
    mc "Так."
    mc "Ми будемо танцювати, так?"
    m "Так!"
    m "Але якщо ти не проти, я не хочу приєднуватися до групового танцю."
    mc "Чому?"
    m "Ну..."
    m "...я просто хочу, щоб ти був тільки для мене під час танцю."
    mc "Звісно."
    m "Дякую, [player]~"
    "Вона кладе голову мені на плече."
    "Хтось підходить до купи колод, тримаючи довгу палицю."
    "Один з учителів запалює палицю, і учень штовхає її в купу."
    "Купа починає диміти, а з-поміж колод виривається яскраве полум'я."
    "Ми спостерігаємо, як купа починає горіти, утворюючи великий конус вогню, що здіймається вгору."
    "Це прекрасне видовище."
    "Люди починають збиратися навколо вогню."
    "Сонце повільно ховається за горизонтом."
    "Моніка підводиться з землі і простягає руки."
    show monika hug at f11
    m "Ходімо, [player]~"
    m "Нас чекають танці!"
    "Я беру її за руку, і вона підіймає мене."
    scene bg n_outside
    with wipeleft_scene
    show monika 1a at t11
    stop music fadeout 2.0
        pass
    "Починає грати музика, і люди повільно розбиваються на пари, щоб танцювати."
    play music t11
        pass
    m "Готовий?"
    mc "Так."
    show monika 3k at face
    "Ми беремося за руки, і Моніка підходить до мене, і ми починаємо танцювати навколо вогнища."
    "Багато людей збираються в коло навколо полум'я."
    "Ми з Монікою тримаємося подалі від них, поки вони починають танцювати."
    "Вона трохи прискорює темп, коли музика стає швидшою."
    "Ми танцюємо від душі, поки грає музика."
    "Всі чудово проводять час, коли музика сповільнюється і починається фінал."
    stop music fadeout 2.0
        pass
    if persistent.gifted == False:
        "Коли звучить остання нота, я вирішую скористатися цим моментом."
        mc "Моніко, заплющ очі, будь ласка."
        m 1c "О, добре."
        show monika 1j
        "Вона заплющує очі з усмішкою на обличчі."
        "Я беру намисто і надягаю його на шию Моніки."
        mc "Тепер відкрий їх."
        show monika forward ldown rdown vsur cm oe
        "Коли Моніка відкрила очі, вони широко розширилися."
        show monika 1e
        "Вона дивиться на мене."
        m "[player]..."
        show monika forward ldown rdown neut cm oe at face
        "Вона нахиляється."
    else:
        show monika forward ldown rdown neut cm oe at face
        "Коли звучить остання нота, Моніка нахиляється."
    hide window
    pause 1.0
        pass
    scene black
    with Dissolve(2.0)
    pause 0.5
        pass
    play sound "mod_assets/sfx/kiss.ogg"
        pass
    pause 3.0
        pass
    scene bg n_outside
    show monika 1e at face
    with Dissolve(2.0)
    "Ми відриваємося одне від одного, і чуємо оплески та вигуки, що лунають навколо нас."
    show monika forward ldown rdown neut blaw ma e1b b1b
    "Моніка червоніє, коли розуміє, що ми знаходимося в центрі натовпу."
    "Всі трохи заспокоюються через кілька секунд."
    show monika forward ldown rdown neut ma blus e4a
    "Ми обіймаємося деякий час, поки люди розходяться."
    mc "Це було дивовижно."
    m "Так, це було..."
    "Я стою, обійнявши її, а позаду нас палає вогонь."
    "Її обійми теплі та ніжні."
    "Я відчуваю, ніби можу так заснути."
    "Але, на жаль, не можу."
    play music t12
        pass
    "Територія школи починає порожніти, оскільки люди йдуть додому."
    mc "Хочеш іти додому?"
    m 1l "Так,{w=0.5} думаю, вже починає темніти."
    show monika 1a at t11
    mc "Добре, тоді ходімо."
    stop music fadeout 2.0
        pass
    "Ми прямуємо до шкільних воріт і тримаємося за руки, йдучи додому."
    scene bg n_residential
    with wipeleft_scene
    play music t9
        pass
    "Місяць світить, поки ми йдемо додому."
    show monika 1j at f11
    "Ми йдемо, взявшись під руку, мовчки."
    "Я дістаю снеки, які купив раніше."
    "Я відкриваю пачку чипсів і ділюся ними з Монікою."
    mc "Сьогодні було весело!"
    m "Мгм~!"
    m 1l "Шкода, що школа не проводить більше таких заходів."
    show monika 1a
    mc "Так, це було б весело."
    "Ми жуємо чипси, йдучи вулицею."
    scene bg n_house
    with wipeleft_scene
    play sound closet_open
        pass
    "Я підходжу до дверей і відчиняю їх."
    show monika 1j at t11
    "Я відчиняю двері і пропускаю Моніку всередину."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    play sound closet_close
        pass
    m "Ахх~"
    "Моніка кидає свою сумку і стрибає на диван."
    m "Як добре бути вдома!"
    mc "Мгм."
    "Я підіймаю її сумку і розпаковую всі наші речі на кухні."
    scene bg kitchen
    with wipeleft_scene
    "Я кладу всю їжу та снеки, що залишилися, на стіл."
    m "Я йду нагору переодягнутися."
    mc "Добре."
    "Вона йде нагору."
    "Я залишаюся тут і трохи прибираю на кухні."
    "Моніка повертається і лягає на диван."
    mc "Гаразд, тепер моя черга."
    m "Добре."
    "Я йду нагору."
    scene bg bedroom
    with wipeleft_scene
    "Я переодягаюся в одяг для сну."
    "Заодно прибираю наші сумки."
    "Я повертаюся вниз."
    scene bg livingRoom_lightsOn_TvOn
    with wipeleft_scene
    "Моніка перемикає канали і знаходить аніме, яке ми дивилися в суботу."
    show monika p_1a at t11
    "Я сідаю поруч з Монікою."
    m p_1b "Хочеш продовжити дивитися це аніме?"
    show monika p_1a
    mc "Я не проти."
    m p_2k "Чудово!"
    show monika at thide
    hide monika
    "Я вимикаю світло, і вона натискає «відтворити»."
    scene black
    with wipeleft_scene
    "Шоу знову починається."
    scene m_cg_tvEvent
    with Dissolve(2.0)
    "Моніка бере кілька чипсів, що залишилися, і запихає їх собі в рот."
    "Я беру кілька для себе, і ми разом тихо дивимося."
    "Незабаром починається вставна пісня, і Моніка трохи підспівує."
    "І ось, титри знову починають йти, і ми притискаємося одне до одного, поки грає фінальна пісня."
    scene bg livingRoom_lightsOff
    with wipeleft_scene
    show monika p_1a at t11
    mc "Було чудово."
    m p_1j "Мгм~"
    mc "Я віднесу снеки назад на кухню."
    m p_1b "Добре."
    m p_2k "Я буду чекати на тебе нагорі."
    show monika p_1a
    mc "Добре."
    scene bg kitchen
    with wipeleft_scene
    "Я кладу снеки на стіл, накриваю їх і вимикаю світло."
    scene black
    with wipeleft_scene
    "Я йду нагору."
    stop music fadeout 3.0
        pass
    scene bg bedroom
    with wipeleft_scene
    "Моніка лежить у ліжку і відкриває ковдри для мене."
    m "Ходімо, я втомилася за сьогодні..."
    mc "Зараз."
    scene bg n_bedroom
    "Я клацаю вимикачем світла і притискаюся до Моніки."
    scene black
    with dissolve_scene_full
    m "Сьогодні було весело..."
    mc "Так."
    mc "На добраніч, Моніко."
    m "На добраніч, [player]~"
    "Я засинаю, наші руки обіймають одне одного."
    call d5
