label d7:
    stop music fadeout 2.0
        pass
    scene day7
    with dissolve_scene_full
    window hide
        pass
    pause 5.0
        pass
    scene black
    with dissolve_scene_full
    pause 4.0
        pass
    "Сонце пробивається крізь вікно."
    play music t9 fadein 2.0
        pass
    scene mcg_7
    with Dissolve(2.0)
    "Моніка дивиться на мене з усмішкою, поки я повільно відкриваю очі."
    show mcg_3
    m "Доброго ранку~"
    hide mcg_3
    show mcg_7
    mc "І тобі доброго ранку~"
    hide mcg_7
    show mcg_3
    m "Сьогодні передостанній день у школі."
    m "Літо вже зовсім поруч!"
    hide mcg_3
    show mcg_7
    mc "Ага~"
    hide mcg_7
    show mcg_3
    m "Ходімо снідати."
    hide mcg_3
    show mcg_7
    mc "Добре."
    scene bg bedroom
    show monika p_1a at t11
    with wipeleft_scene
    stop music fadeout 2.0
        pass
    "Ми виповзаємо з ліжка і йдемо вниз."
    scene bg kitchen
    with wipeleft_scene
    play music t8
        pass
    "Я відкриваю холодильник."
    "Хммм..."
    mc "Гей, Моніко..."
    show monika p_1c at t11
    m "Хмм?"
    mc "У нас ще є залишки з учора."
    mc "Хочеш на сніданок?"
    m p_1d "Звісно."
    show monika at thide
    hide monika
    "Я дістаю котлети з учорашнього дня й кладу їх у мікрохвильовку."
    "За кілька секунд дістаю їх і розкладаю по тарілках."
    "Тим часом Моніка робить нам невеликий свіжий салат."
    "Поки вона закінчує салат, я накриваю на стіл і сідаю."
    show monika p_1a at t11
    mc "Знаєш, навіть якщо це просто залишки, все одно смачно!"
    m p_1b "Так, це правда!"
    m p_2d "Дивно, що смак зберігся!"
    show monika p_1c
    mc "Ну, воно ж не лежало тиждень у морозилці."
    m p_1d "І то правда."
    show monika at thide
    hide monika
    "Ми доїдаємо, і я ставлю тарілки в посудомийку."
    "Ми з Монікою підіймаємось наверх."
    scene bg bedroom
    with wipeleft_scene
    "Моніка знову заходить у ванну, і ми продовжуємо ранкову рутину."
    "Я переодягаюсь і збираю речі."
    "Моніка виходить."
    show monika 1d at l11
    m "[player], не забудь узяти всі підручники."
    show monika 1c
    mc "Емм, гаразд?"
    m 1d "Сьогодні будемо готуватися до фінальних іспитів."
    show monika 1c
    mc "Зачекай, іспити вже завтра?"
    m 1d "Так... Ти забув?"
    show monika forward ldown rdown anno cm oe
    menu:
        "Фінальні іспити?!":
            pass
    m forward ldown rdown curi om oe "...Так?"
    m "Ти ж розумієш, що ми все ще у школі?"
    m "Звісно, що будуть фінальні іспити!"
    show monika forward ldown rhip curi cm oe
    menu:
        "Я думав, тут їх немає.":
            pass
    m 1d "Ну, це не така вже й велика справа."
    m "Думаю, сьогодні на уроках ми лише повторюватимемо матеріал."
    m "Іспити теж не мають бути довгими в жодному з предметів."
    m 1d "Слухай, [player],{w=0.5} як у тебе зазвичай виходить у школі?"
    menu:
        "Добре.":
            $ persistent.goodatschool = True
            m 5a "Ооо~"
            m 3k "Це чудово!"
            m 5a "Тоді цей фінальний іспит буде для тебе як шматочок торта~!"
            mc "Сподіваюся."
        "Посередньо.":
            $ persistent.goodatschool = False
            m 1b "А, зрозуміло!"
            m "Думаю, буде досить легко."
            m 4k "Я прослідкую, щоб ти все склав без проблем!"
            mc "Дякую, Моніко."
        "Не дуже добре.":
            $ persistent.goodatschool = False
            show monika 1p at s11
            m "Ох..."
            show monika 1b at t11
            m "Але це не повинно бути проблемою."
            m 5a "Я швидко підтягну тебе до рівня~!"
            mc "Дякую, Моніко."
        "Я вже склав.":
            $ persistent.goodatschool = True
            m 1m "Розумію, значить, для тебе це просто повтор."
            m 5a "Тоді, мабуть, ти будеш допомагати мені~"
        "Я кинув школу.":
            $ persistent.goodatschool = False
            show monika 1p at s11
            m "Ох..."
            m "Ти... кинув школу?"
            m "[player], ти ж знаєш, що освіта важлива, правда?"
            m "Ну, гадаю, тут я мало що можу зробити."
            show monika 1b at t11
            m "Але не хвилюйся!"
            m 3k "Я прослідкую, щоб ти підготувався до цього іспиту!"
            mc "Дякую, Моніко."
    m 1d "Гаразд, ходімо."
    show monika at thide
    hide monika
    "Моніка бере свої речі, і ми спускаємось."
    scene bg kitchen
    with wipeleft_scene
    "Я швидко роблю кілька сендвічів на обід."
    "Повертаюся у вітальню й віддаю Моніці її."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    show monika 1c at t11
    mc "Ось твій сендвіч на обід."
    m 3b "Дякую!"
    m 5a "Так мило з твого боку~"
    show monika 1a
    mc "Завжди радий."
    show monika at thide
    hide monika
    "Ми взуваємось і виходимо з дому."
    stop music fadeout 2.0
        pass
    scene bg house
    with wipeleft_scene
    play music t2
        pass
    "Я замикаю двері, і ми йдемо тротуаром."
    show monika 1d at t11
    m "Схоже, Сайорі та ГГ ще збираються."
    show monika 1c
    mc "Давай почекаємо."
    mc "Сумніваюсь, що це довго."
    m "Так."
    show monika at thide
    hide monika
    "Ми сідаємо біля воріт і чекаємо."
    "Моніка дістає телефон."
    "Вона трохи гортає стрічку й раптом сміється."
    m "Гей, подивися на це!"
    "Вона показує мені картинку."
    "Це мем."
    "Я трохи сміюся, поки вона продовжує гортати."
    "Ми сидимо так хвилин десять, перш ніж ГГ і Сайорі нарешті виходять з дому."
    show monika 1c at t31
    show sayori 1r at f32
    show protag 1a at t33
    s "Доброгоо ранку!"
    show sayori 1a at t32
    mc "Доброго ранку!{w=0.5} Чому ви так довго?"
    show protag 5w at f33
    show sayori turned ldown rdown nerv cm oe
    p "Ну, почнемо з того,{w=0.5} що ця бовдурка не хотіла вставати."
    show sayori turned ldown rdown nerv cm oe at s32
    p "Я мусив витягувати її з ліжка, бо вона думала, що вже канікули!"
    show protag 5v at t33
    show sayori 5b at f32
    s 5b "Ехехе..."
    show sayori turned ldown rdown nerv cm oe at t32
    show protag 5w at f33
    p "Я зайшов у її кімнату через пів години після будильника, а вона там бурмоче уві сні про булочки з корицею!"
    show protag 5v at t33
    show sayori 3h at hf32
    s "І що? Вони ж смачні!"
    show sayori 5d at t32
    s "І сон був гарний..."
    show protag 1b at t33
    show sayori 1a
    show monika 1b at f31
    m "Ну, в будь-якому разі, думаю, нам слід рушати."
    m 3l "Інакше ми запізнимось!"
    scene bg residential_day
    with wipeleft_scene
    "Ми вирушаємо до школи."
    "Моніка йде поруч зі мною, тримаючи мене за руку, коли ми крокуємо вулицею."
    "Учні знову починають з’являтися на дорозі, поки ми йдемо."
    "Ми підходимо до шкільних воріт."
    scene bg outside
    with wipeleft_scene
    "Ми заходимо у двір, і я дивлюся на свій годинник."
    "8:30."
    "Прямо на межі запізнення."
    show protag 3l at t21
    show sayori 3r at t22
    "ГГ і Сайорі поспішають до класу, махаючи нам на прощання."
    show protag at thide
    hide protag
    show sayori at thide
    hide sayori
    "Коли ми з Монікою прямуємо до дверей,{w=0.5} краєм ока я помічаю дещо."
    "Президент учнівської ради мчить через ворота на велосипеді."
    "А позаду нього...{w=0.5} це була віце-президентка?"
    "Та неважливо."
    "Я заходжу всередину разом із Монікою."
    stop music fadeout 2.0
        pass
    scene bg class_day
    with wipeleft_scene
    "Ми сідаємо й чекаємо на вчителя."
    play music t12
        pass
    "Дзвенить дзвінок, і заходить вчитель."
    "Вчитель" "Гаразд, клас."
    "Вчитель" "Сьогодні ми лише готуємось до завтрашніх іспитів."
    "Вчитель" "Тож діставайте книжки й починайте."
    "Вчитель" "Якщо будуть питання — не соромтеся питати."
    "Усі дістають книжки й починають працювати."
    "Дехто об’єднується в групи, інші сидять на самоті."
    show monika 3j at l11
    "Моніка підсуває свою парту до моєї."
    show monika 1a at t11
    "Я дістаю свою книжку й кладу її між нами."
    "Ми починаємо писати й робити нотатки."
    m 1b "Гей, у мене є ідея."
    m 3b "Давай влаштуємо вікторину один одному!"
    show monika 1a
    mc "Хмм..."
    mc "Добра ідея!"
    m 1d "Гаразд, дай подумати над питаннями..."
    show monika 3d
    "Вона починає ставити запитання одне за одним."
    "Я відповідаю."
    "Деякі не вгадую, інші виходять правильно."
    "Ми міняємось ролями, і я також запитую її."
    if persistent.goodatschool == True:
        "На ті, де Моніка помиляється, я намагаюсь пояснити їй, як правильно."
        "Ми ділимось ідеями, як зробити деякі задачі простішими."
        "Я показую Моніці кілька обхідних методів і формул."
    else:
        "На ті, де я помиляюсь, Моніка пояснює мені якомога детальніше."
        "Вона показує способи зробити деякі формули й завдання простішими."
    scene bg class_day
    show monika 1a at t11
    with wipeleft_scene
    "Ми продовжуємо вчитися, змінюючи предмет приблизно щогодини."
    "Дзвінок на обід, і я дістаю свою їжу."
    m 1b "Гей, [player], давай сьогодні пообідаємо десь в іншому місці!"
    show monika 1a
    mc "Хмм?{w=0.5} Гаразд, без проблем."
    m 1k "Ходімо!"
    scene bg corridor
    with wipeleft_scene
    "Я виходжу з Монікою, і ми йдемо коридором."
    scene bg vendingmachine
    with wipeleft_scene
    "Ми звертаємо до сходів."
    show monika 3b at t11
    m "Виглядає, як гарне місце!"
    show monika at thide
    hide monika
    "Ми сідаємо, і я дістаю свій сендвіч."
    "Моніка дістає свій і відкушує шматочок."
    show monika 3j at t11
    m "Мммм~"
    m 3k "Так смачно~!"
    show monika 1a
    mc "Радий, що тобі подобається!"
    show monika at thide
    hide monika
    "Я також беруся за свій сендвіч."
    show monika 3k at face
    m "Кажи «ааа»~"
    "Вона годує мене шматочком шоколаду."
    m 1j "Хехе~"
    show monika 1b at t11
    m "Гаразд, нам варто повертатися до класу."
    show monika at thide
    hide monika
    "Ми збираємо речі й повертаємось до класу."
    scene bg class_day
    with wipeleft_scene
    "Ми знову сідаємо й продовжуємо навчання."
    scene bg class_day
    with wipeleft_scene
    "Заняття закінчуються,{w=0.5} і ми складаємо свої речі назад у рюкзаки."
    show monika 1b at t11
    m "Готовий іти до клубної кімнати?"
    show monika 1a
    mc "Так, ходімо!"
    scene bg corridor
    with wipeleft_scene
    "Ми вирушаємо до клубної кімнати, як завжди."
    stop music fadeout 2.0
        pass
    "Я відкриваю двері й заходжу разом із Монікою."
    scene bg club_day
    with wipeleft_scene
    play music t3
        pass
    "Всередині, здається, нікого немає."
    show monika 1c at t11
    mc "Схоже, ми перші."
    m 1d "Так."
    m "Можемо підготувати парти."
    m 3b "Я планувала зробити сьогодні групове заняття з підготовки."
    m "Тож зрушмо парти разом, щоб легше було працювати."
    show monika 1a
    mc "Зрозуміло."
    show monika at thide
    hide monika
    "Ми починаємо рухати парти."
    "До кімнати заходить Юрі."
    show yuri 1e at l11
    y "Привіт."
    mc "Гей!"
    show yuri at thide
    hide yuri
    "Юрі розкладає свої речі."
    y "Щось сьогодні відбувається?"
    m "Так, ми сьогодні будемо займатись разом."
    y "А, зрозуміло."
    "Ми закінчуємо рухати парти й сідаємо."
    "Моніка сідає поруч зі мною й дістає свої книжки."
    "Як тільки вона закінчує, заходять Нацукі, Сайорі та ГГ."
    show natsuki 5a at t31
    show sayori 1a at t32
    show protag 1d at f33
    p "От таке от сталося."
    p 1d "Ой-{w=0.5} А що тут відбувається?"
    show protag 1b at t33
    m "Сьогодні ми вчимося, тож сідайте!"
    show sayori at thide
    hide sayori
    show protag at thide
    hide protag
    show natsuki at thide
    hide natsuki
    "Усі сідають і дістають книжки."
    "Ми тихенько починаємо робити нотатки та вправи."
    "У кімнаті тихо, усі з головою у книжках."
    s "Моніка, допоможеш мені з цим?"
    m "Звісно."
    "Ми ще деякий час займаємось."
    "Моніка підводиться й привертає увагу всіх."
    show monika 3b at t11
    m "Гаразд, усі!"
    m "Думаю, досить навчання на сьогодні!"
    m 3k "У нас є й інші справи!"
    m 1b "Тож складайте речі, і я поясню, що будемо робити."
    show monika at thide
    hide monika
    "Усі складають свої речі."
    "Я запихаю книжки до рюкзака."
    show monika 1b at t11
    m "Отже, як усі знають, сьогодні — передостанній день."
    m "І оскільки скоро літо, нам треба підготувати клубну кімнату!"
    m "Тому..."
    m 3b "Нацукі, ти відповідаєш за прибирання в шафі."
    show monika 3a
    n "Зрозуміло!"
    m 3b "Сайорі й ГГ, ви двоє підмітаєте й миєте підлогу."
    show monika 3a
    "Сайо і ГГ" "Буде зроблено!"
    m 3b "[player],{w=0.5} ми з тобою рухатимемо й складатимемо парти."
    show monika 3a
    mc "Добре."
    m 3b "А Юрі перевіряє й прибирає всі полиці."
    show monika 3a
    y "Домовилися."
    m 1b "Чудово!{w=0.5} Усі знають, що робити, тож до роботи!"
    show monika at thide
    hide monika
    "Усі" "Добре!"
    "Ми всі беремося до справи й починаємо прибирати."
    "Я піднімаю парту й складаю всі стільці в кутку кімнати."
    "Моніка підсуває парти одна до одної, а я допомагаю складати їх біля стіни поряд зі стільцями."
    "Тим часом я бачу, як Нацукі виносить коробки з шафи."
    "Багато з них — це манґа."
    "Сайорі витирає дошку спереду."
    "ГГ підмітає підлогу."
    "Юрі перевіряє полиці й дістає з них речі."
    show monika 1c at t11
    mc "Що нам робити з учительським столом?"
    m 1d "Просто залиш його тут."
    show monika 1c
    mc "Гаразд."
    stop music fadeout 2.0
        pass
    scene bg club_day
    with wipeleft_scene
    play music t8
        pass
    "Ми закінчуємо прибирати клубну кімнату."
    "ГГ відносить швабру назад у комору прибиральника."
    show natsuki 1c at f21
    show yuri 1e at t22
    n "Гей, Юрі, допоможеш занести мою манґу додому?"
    show natsuki 1a at t21
    show yuri 1f at f22
    y "Звісно.{w=0.5} Вони й справді важкі."
    show natsuki 5z at f21
    show yuri 1e at t22
    n "Дякую!"
    show natsuki 5a at t21
    show yuri 1b at f22
    y "Та нема за що."
    show yuri at thide
    hide yuri
    show natsuki at thide
    hide natsuki
    "ГГ повертається назад у клубну кімнату."
    show monika 1a at t11
    mc "Гаразд, здається, все готово!"
    m 2b "Так, думаю, що це все."
    m 3k "Ходімо додому, всі!"
    show monika 1a
    n "До зустрічі!"
    y "Бувай!"
    "Нацукі та Юрі виходять першими, Юрі несе за Нацукі коробку з манґою."
    show monika at t31
    show sayori 1a at t32
    show protag 1a at t33
    mc "Може, й нам уже час вирушати?"
    show monika 1j at f31
    m "Ага~"
    show monika at thide
    hide monika
    show sayori at thide
    hide sayori
    show protag at thide
    hide protag
    "Ми збираємо речі й виходимо з кімнати."
    scene bg corridor
    with wipeleft_scene
    "Моніка замикає двері, і ми вирушаємо надвір."
    scene bg residential_day
    with wipeleft_scene
    "Сайорі притуляється до ГГ, поки вони йдуть."
    "Вона виглядає трохи втомленою."
    "Моніка обіймає мою руку й схиляє на мене голову."
    "Ми тихо йдемо стежкою й повільно прямуємо додому."
    "Надворі сонячно, і знову віє приємний вітерець."
    "Це нагадує мені, як було під час фестивалю."
    "Наш будинок з’являється вдалині, і ми починаємо наближатися до нього."
    scene bg house
    with wipeleft_scene
    s "До зустрічі, друзі!"
    m "Бувай!"
    "Ми махаємо Сайорі та ГГ на прощання, а я відчиняю двері."
    stop music fadeout 2.0
        pass
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    play music t9
        pass
    "Ми заходимо всередину, і я зачиняю двері."
    show monika 1k at s11
    m "Ахх~"
    m "Так добре повернутися додому~!"
    show monika 1a at t11
    mc "Ага."
    scene black
    with Dissolve(2.0)
    "Моніка кидає речі та обіймає мене."
    m "Мммм~"
    m "Але мушу сказати, що це мені подобається ще більше~"
    mc "Мені теж, Моніко."
    scene bg livingRoom_lightsOn_TvOff
    show monika 1e at face
    with Dissolve(2.0)
    m "Думаю, це моя улюблена частина будь-якого дня~"
    m forward ldown rdown neut cm oe "Іди сюди~"
    scene black
    with Dissolve(2.0)
    play sound "mod_assets/sfx/kiss.ogg"
        pass
    pause 2.0
        pass
    scene bg livingRoom_lightsOn_TvOff
    show monika 1e at face
    with Dissolve(2.0)
    pause 2.0
        pass
    m 1j "Хехе~"
    mc "Ти така мила в цю мить."
    m 1k "Ти теж~"
    show monika 1b at t11
    m "Гаразд, думаю, нам варто трохи освіжитися!"
    mc "Так, хаха."
    show monika at thide
    hide monika
    "Ми обидва беремо свої речі й підіймаємось нагору."
    scene bg bedroom
    with wipeleft_scene
    "Вона кладе речі біля столу та дістає повсякденний одяг."
    show monika 1d at t11
    m "Я піду перевдягнутися у ванну, якщо що."
    show monika 1c
    mc "Добре."
    show monika at lhide
    hide monika
    "Вона заходить у ванну."
    "Тим часом я теж перевдягаюся."
    "Я викладаю книги на стіл і вибираю кілька, які нам ще слід повторити."
    "Я хочу переконатися, що ми з Монікою повністю готові до завтрашніх фінальних іспитів."
    "Вона виходить із ванни в піжамі."
    show monika p_1c at l11
    mc "Не проти ще трохи повчитися?"
    m p_1d "Так, звісно!"
    m p_1b "Я рада допомогти!"
    show monika p_1j at s11
    "Вона сідає та дістає ручку."
    m p_1b "Отже, ось що треба зробити..."
    scene bg bedroom
    with wipeleft_scene
    show monika p_2b at t11
    "Ми ще трохи вчимося."
    m "Добре, думаю, на сьогодні досить."
    show monika p_1a
    mc "Так, гадаю, ми обидва готові до завтра."
    m p_1b "Хочеш повечеряти?"
    show monika p_1a
    mc "Уже так пізно?"
    m p_1d "Так."
    show monika p_1a
    mc "Ну гаразд тоді."
    show monika p_1a at t11
    "Ми складаємо речі й спускаємось на кухню."
    scene bg kitchen
    with wipeleft_scene
    mc "Гаразд, подивимось..."
    "Я відкриваю холодильник, щоб перевірити, що є всередині."
    "Хмммм..."
    "Нічого особливого не хочеться..."
    show monika p_1c at t11
    mc "О!"
    "Мені спала на думку ідея."
    m "Гм?"
    mc "Як щодо запеченої картоплі по-особливому?"
    m p_1b "Добре."
    show monika p_1a
    mc "Помий три картоплини, будь ласка."
    m p_1b "Звичайно."
    show monika at thide
    hide monika
    "Поки Моніка це робить, я натираю сир у миску."
    "Вона подає мені картоплю, і я розрізаю її."
    "Я наповнюю її сиром і кладу на тарілку."
    "Повторюю це ще з двома картоплинами."
    mc "Гаразд, три картоплини."
    mc "Тепер у мікрохвильовку."
    "Я ставлю їх у мікрохвильовку на кілька хвилин, уважно стежачи, щоб вони не вибухнули."
    "{i}БІП БІП БІП{/i}"
    "Я виймаю їх і даю трохи охолонути."
    m "Виглядають смачно."
    mc "Ага."
    mc "Я піду візьму сік."
    m "Можеш узяти й для мене склянку?"
    mc "Звісно."
    "Я наливаю дві склянки яблучного соку для нас обох."
    show monika p_1a at t11
    "Я сідаю й подаю Моніці її сік."
    m p_1k "Дякую!"
    show monika p_1a
    "Ми беремось до картоплі та насолоджуємось вечерею."
    m p_1j "Мммм~"
    m p_2b "Це було смачно!"
    show monika p_1a
    mc "Радий, що тобі сподобалося!"
    mc "Я помию посуд."
    m p_1k "Дякую, любий~"
    show monika at thide
    hide monika
    "Я швидко завантажую посудомийку та повертаюсь нагору з Монікою."
    "По дорозі я вимикаю світло."
    scene bg bedroom
    with wipeleft_scene
    "Моніка стрибає на ліжко й сідає, спершись на стіну."
    m "Гей, [player], у нас ще є трохи часу."
    m "Хочеш щось подивитись перед сном?"
    mc "Звісно."
    m "Ура~!"
    "Я вимикаю світло й вмикаю телевізор."
    scene black
    with wipeleft_scene
    "Я вмикаю аніме, яке ми дивилися раніше, й сідаю поруч із нею."
    "Починається опенінґ, і ми мовчки дивимось."
    "Моніка притуляється до мене, і я обіймаю її."
    m "Це так приємно~"
    m "Просто бути з тобою ось так завжди мене заспокоює."
    mc "У мене так само, Моніко."
    mc "Я тебе кохаю."
    m "Я теж тебе кохаю~"
    "Ми продовжуємо уважно дивитися,{w=0.5} і коли починається ендинг,{w=0.5} вона кладе голову мені на плече."
    m "Це була гарна серія."
    m "Але думаю, на сьогодні досить."
    mc "Так, завтра ж фінальні іспити."
    mc "Сподіваюсь, усе пройде добре."
    m "Ага~"
    "Я вимикаю телевізор і лягаю поруч із Монікою."
    m "На добраніч, [player]~"
    mc "Надобраніч, Моніко..."
    "Я засинаю,{w=0.5} і моя тривога та хвилювання щодо завтрашніх іспитів зникають, поки ми засинаємо, обійнявши одне одного."
    call d8
