label d8:
    stop music fadeout 2.0
        pass
    scene day8
    with dissolve_scene_full
    window hide
        pass
    pause 5.0
        pass
    scene black
    with dissolve_scene_full
    pause 4.0
        pass
    "Сонце повільно пробивається в кімнату."
    "От чорт..."
    "Сьогодні ж фінальні іспити."
    "Я повільно розплющую очі."
    scene mcg_2
    with dissolve_scene_full
    play music t9
        pass
    "Моніка солодко спить поруч зі мною."
    "Мабуть, треба її розбудити."
    mc "Моніко~"
    mc "Ну ж бо, у нас сьогодні фінальні іспити."
    m "Ммммм..."
    show mcg_6
    "Вона обіймає мене руками."
    m "...Тепло..."
    mc "Моніко,{w=0.5} ну давай,{w=0.5} підйом!"
    m "Ммммммммм..."
    hide mcg_6
    show mcg_5
    m "Гаразд..."
    hide mcg_5
    show mcg_3
    m "Але ти винен мені трохи обіймів пізніше."
    hide mcg_3
    show mcg_7
    mc "Домовились, якщо переживемо ці іспити разом."
    hide mcg_7
    show mcg_3
    m "Домовились."
    hide mcg_3
    show mcg_8
    m "Хехехе~"
    scene bg bedroom
    with wipeleft_scene
    "Ми підіймаємось, і Моніка йде у ванну зі своїм одягом у руках."
    "Я теж перевдягаюся."
    "Я дістаю зошит і швидко переглядаю нотатки ще раз."
    "Моніка повертається й кладе піжаму на ліжко."
    show monika 1d at l11
    m "Ми йдемо снідати?"
    show monika 1c
    mc "Так."
    show monika 1a
    "Я швидко кладу зошит назад у сумку й іду за Монікою на кухню."
    scene bg kitchen
    with wipeleft_scene
    "Моніка встигає до холодильника раніше за мене й починає його переглядати."
    show monika 3d at t11
    m "У нас тут є варення."
    m "А ще в коморі, здається, є арахісове масло."
    m "Хочеш таке на сніданок?"
    show monika 1a
    mc "Чому б і ні."
    show monika at thide
    hide monika
    "Я нарізаю хліб, а Моніка відкриває намазки."
    "Я накриваю на стіл, поки вона готує сендвічі."
    show monika 3j at l11
    "Моніка приносить сендвічі, і ми сідаємо за стіл."
    show monika 1a at s11
    mc "Дякую, Моніко~"
    m 1j "Хехе~"
    m 5a "Для тебе — що завгодно, коханий~"
    show monika 1j
    "Ми беремось до їжі й швидко все з’їдаємо."
    show monika at thide
    hide monika
    "Я відношу тарілки та ставлю їх у посудомийку."
    "Моніка йде у вітальню та сідає на диван."
    "Я прибираю й також вирушаю туди."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    "Моніка сидить і переглядає матеріал до іспитів."
    "Я сідаю поруч і теж дістаю нотатки."
    m "Хочеш ще раз пройтися по складних моментах?"
    mc "Давай."
    "Ми знову обмінюємося нотатками й робимо кілька вправ."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    "Моніка дивиться на годинник."
    m "Гей, [player], давай на цьому зупинимось."
    m "Інакше ми запізнимось."
    mc "Точно."
    "Ми складаємо речі."
    m "Хочеш кави?"
    mc "Авжеж."
    "Моніка йде на кухню й варить нам дві чашки."
    show monika 1a at t11
    "Вона приносить їх і подає мені одну."
    m 1b "Тримай."
    show monika 1a
    mc "Дякую."
    show monika at lhide
    hide monika
    "Я швидко випиваю каву, а вона відносить чашки назад на кухню."
    m "Гей, [player]..."
    mc "Гм?"
    show monika 1d at face
    pause 0.5
        pass
    hide window
    scene black
    with Dissolve(1.0)
    play sound "mod_assets/sfx/kiss.ogg"
        pass
    pause 1.0
        pass
    scene bg livingRoom_lightsOn_TvOff
    show monika 1e at face
    with Dissolve(2.0)
    "Моє обличчя червоніє, коли наші губи зустрічаються."
    m forward ldown rdown happ cm ce n3 "Хехе~"
    show monika 3k at t11
    m "Це мені ніколи не набридне~"
    m "Ходімо вже!"
    "Ми беремо речі й вирушаємо до дверей."
    play sound closet_open
        pass
    scene bg house
    with wipeleft_scene
    stop music fadeout 2.0
        pass
    play sound closet_close
        pass
    "Я замикаю двері, і ми вирушаємо."
    scene bg residential_day
    show monika 1a at t11
    with wipeleft_scene
    play music t2
        pass
    s "Гееей!!"
    s "Почекайте!!"
    "Сайорі та ГГ біжать до нас, поки ми йдемо вулицею."
    show sayori 4p at l32
    show monika 1a at t33
    show protag 3z at l31
    s "Хахх... хахх..."
    show sayori 4s at f32
    s "Доброго ранку!"
    s 3r "Нарешті останній день школи!"
    show sayori 3a at t32
    show monika 3k at f33
    m "Так!"
    m 2b "А ви готувалися до іспитів сьогодні?"
    show monika 2a at t33
    show sayori 1q at f32
    s "Ага!"
    show sayori turned ldown rdown nerv cm oe at t32
    show protag 1f at f31
    p "Не повіриш, наскільки Сайорі іноді відволікається."
    p "Варто мені відвернутися на хвилину, а вона вже в телефоні."
    show sayori turned ldown rdown nerv cm oe at f32
    show protag 1b at t31
    s "Ехехе..."
    show sayori 1a at t32
    show protag 1d at f31
    p "Але ми все ж встигли напхати в голови потрібне."
    p 1c "Я впевнений, що впораюся на іспитах."
    p 5g "Не дуже впевнений щодо Сайорі."
    show protag 5a at t31
    show sayori 3c at f32
    s "Я ж казала, все буде добре!"
    show sayori 1a at t32
    mc "Головне, що ви постарались — молодці!"
    show monika 1b at f33
    m "Подивимось, як ми впораємось сьогодні!"
    m "А зараз ходімо швидше, щоб не запізнитись!"
    show monika 1a at t33
    show sayori 1a at t32
    show protag 1a at t31
    "Ми пришвидшуємо крок і прямуємо до школи."
    scene bg outside
    with wipeleft_scene
    show monika 3j at t11
    s "До зустрічі!"
    "Ми махаємо Сайорі та ГГ, коли вони йдуть на свої класи."
    show monika 1a
    mc "Нам теж варто йти."
    m 1d "Так."
    m 5a "Сподіваюся, ти все пам’ятаєш із того, що ми вчили~!"
    mc "Ага."
    stop music fadeout 2.0
        pass
    scene bg class_day
    with wipeleft_scene
    "Я сідаю, а Моніка знову займає парту поруч."
    "Я дістаю нотатки для останнього повторення."
    "До класу заходить учитель, і ми всі замовкаємо та ховаємо книжки."
    "Він роздає тест, і ми чекаємо."
    "Вчитель" "Отже, ви знаєте, що робити."
    "Вчитель" "Ніяких розмов, ніяких телефонів. Просто виконайте завдання й чекайте на наступний урок."
    "Вчитель" "У вас є одна година, щоб закінчити."
    "Вчитель" "Успіхів!"
    "Усі перегортають аркуші, і тест починається."
    scene bg class_day
    with wipeleft_scene
    play music t12
        pass
    "П’ять годин і кілька тестів потому,"
    "Я нарешті закінчив."
    "Я підходжу й здаю свій тест."
    "Повертаюсь на місце."
    "Велика хвиля полегшення накриває мене, коли я вмощуюсь на стілець."
    "Ось і все."
    "Іспити завершено."
    "Я зиркаю на Моніку."
    scene desk_1
    with Dissolve(2.0)
    "Вона дивиться на мене з усмішкою на обличчі."
    show desk_2
    m "Нарешті подивився на мене~"
    hide desk_2
    "Я трохи червонію."
    m "Хехе~"
    mc "Скільки часу в тебе пішло, щоб закінчити?"
    show desk_2
    m "Сказала б, близько 45 хвилин."
    m "Тест був не надто складним."
    m "Але краще помовчимо, щоб не було проблем."
    hide desk_2
    mc "Добре."
    scene bg class_day
    with wipeleft_scene
    "Дзвінок сповіщає про завершення іспитів."
    "Вчитель" "Добре, це все, усі."
    "Вчитель" "Якщо ви в клубі, зараз час іти туди."
    "Вчитель" "Гарних літніх канікул!"
    "Усі збирають речі й виходять з класу."
    show monika 1b at l11
    m "Готовий іти?"
    show monika 1a
    mc "Так, ходімо."
    show monika at thide
    hide monika
    "Я хапаю свою сумку, і ми виходимо в коридор."
    scene bg corridor
    with wipeleft_scene
    "Ми йдемо по коридору."
    "Моніка бере мене за руку, поки ми крокуємо."
    "Зрештою ми дістаємося клубної кімнати."
    scene bg empty_club
    with wipeleft_scene
    "Ми заходимо всередину, і там тихо."
    "Я притуляюсь до стіни й чекаю на інших."
    "Моніка сідає поруч зі мною на підлогу."
    "Минає кілька хвилин, і всі поступово заходять."
    "Коли всі в зборі, Моніка підводиться."
    show monika 4b at t11
    m "Отже!{w=0.5} Усі тут!"
    m "Ну як ваші іспити?"
    show monika at thide
    hide monika
    show natsuki 3c at t11
    n "Легко."
    n 3e "Окрім англійської."
    n 3b "Ота була трохи складна."
    show natsuki turned neut cm oe at t21
    show yuri 2f at f22
    y "Справді? {w=0.5}Мені англійська видалася досить простою."
    show yuri 2e at t22
    show natsuki 5h at f21
    n "Не дивно, що для тебе англійська проста."
    n 5x "Та байдуже.{w=0.5} Я надто втомилась від усіх цих тестів."
    n 3c "А як ти, Сайо?"
    show natsuki at thide
    hide natsuki
    show yuri at thide
    hide yuri
    show sayori 1c at f21
    show protag 1b at t22
    s "Думаю, нормально."
    s 5b "Хоча не дуже впевнена в тесті з математики..."
    s 3c "ГГ? А ти як?"
    show sayori 1a at t21
    show protag 1d at f22
    p "З науками трохи ламав голову."
    p 3y "Просто радий, що все скінчилося."
    show protag 1a at t22
    mc "У мене так само."
    show protag at thide
    hide protag
    show sayori at thide
    hide sayori
    show monika at t11
    mc "Моніко,{w=0.5} а ти як?"
    m 1j "Я досить упевнена!"
    m 1d "Принаймні нічого справді складного не було."
    m 1b "Але тепер, коли іспити позаду, давайте подумаємо, що робитимемо наступного тижня!"
    m "Коли всім зручно зібратися?"
    show yuri 1f at f21
    show monika 1a at t22
    y "Мені підійде будь-коли."
    show yuri at thide
    hide yuri
    show sayori 1r at f21
    s "Я хочу щось зробити вже завтра!"
    show sayori at thide
    hide sayori
    show natsuki 1c at f21
    n "Мені теж завтра підходить."
    n "Але в неділю я допомагаю в пекарні."
    n "Тож завтра або після неділі я вільна."
    show natsuki at thide
    hide natsuki
    show monika 1b at t11
    m "Отже, домовились зібратись завтра?"
    show monika 1a
    "Усі кивають."
    m 1b "Добре тоді!"
    m "Я думала, можемо сходити на пікнік, якщо всі не проти!"
    show monika 1a
    n "Я за!"
    s "Я теж!"
    p "Мені підходить."
    y "Я також не проти."
    mc "Я теж за."
    m "Чудово! Тоді вирішено!"
    m "Завтра ми йдемо на пікнік!"
    m "Я всім напишу місце, щойно знайду гарну локацію."
    m 1d "І... гадаю, на сьогодні це все, що я планувала."
    m "А тепер скоро мають бути фінальні оголошення—"
    show monika 1c at h11
    "Знову лунає дзвінок інтеркому, й ми чуємо голос учителя."
    show monika at thide
    hide monika
    "Інтерком" "Ну що ж, усі, навчальний рік завершено."
    "Учитель через інтерком виголошує довгу, нудну промову про кінець року."
    "Інтерком" "У будь-якому разі, сподіваюсь, усім сподобалось навчання, і гарних вам канікул!"
    "Інтерком знову лунає, і дзвінок сповіщає початок чудових літніх канікул."
    "Ми всі збираємо речі й виходимо."
    scene bg corridor
    with wipeleft_scene
    "Моніка замикає двері, і ми всі разом прямуємо до воріт."
    scene bg outside
    with wipeleft_scene
    show monika 1b at f41
    show sayori 1a at t42
    show yuri 1a at t43
    show natsuki 1a at t44
    m "Гаразд, не забудьте завтра взяти закуски!"
    show natsuki at thide
    hide natsuki
    show yuri at thide
    hide yuri
    show monika 1a at t31
    show sayori at t32
    show protag 1a at t33
    "Юрі й Нацукі йдуть додому, махаючи нам на прощання."
    n "Бувайте!"
    mc "Ви готові йти додому?"
    p 1c "Так!"
    show protag 1a
    mc "Ходімо!"
    scene bg residential_day
    with wipeleft_scene
    "Ми з Монікою йдемо вулицею, тримаючись за руки."
    "Сайорі й ГГ позаду нас тихо крокують."
    "Тепер, коли школа скінчилась, я можу трохи розслабитись із Монікою."
    "Враховуючи, що в неділю ми нічого не плануємо, варто придумати щось для нас двох."
    "Хмммм..."
    "Подумаю над цим пізніше."
    "Зрештою, наші будинки з’являються в полі зору."
    scene bg house
    with wipeleft_scene
    show sayori 3r at f21
    show protag 1a at t22
    s "Бувай!!"
    show sayori 1a at t21
    m "До зустрічі!"
    show sayori at lhide
    hide sayori
    show protag at lhide
    hide protag
    stop music fadeout 2.0
        pass
    "Ми махаємо на прощання Сайорі й ГГ, і я відмикаю двері."
    play sound closet_open
        pass
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    play music t9
        pass
    play sound closet_close
        pass
    "Ми заходимо всередину й обоє з полегшенням видихаємо."
    show monika 1k at t11
    m "Нарешті школа скінчилась!"
    m 5a "І тепер ти весь мій~"
    mc "А ти вся моя~"
    m 1j "Уфуфу~"
    m 1k "Ми маємо одне одного~"
    show monika 1a
    mc "Так."
    m 1b "Ходімо перевдягнемось із цих душних форм!"
    show monika 1a at t11
    mc "Гаразд."
    show monika forward ldown rdown neut om ce at face
    hide window
    play sound "mod_assets/sfx/kiss.ogg"
        pass
    pause 1.0
        pass
    show monika 1b at t11
    m "Ходімо~"
    scene bg bedroom
    with wipeleft_scene
    "Моніка заходить у ванну, а я, як завжди, перевдягаюсь у спальні."
    "Закінчивши, я висипаю речі з сумки й починаю розкладати всі зошити й записи."
    "Моніка повертається в кімнату й теж спорожняє свою сумку."
    "За якийсь час ми все розклали та закинули форму в кошик для білизни."
    show monika h1_1c at t11
    mc "Добре. Думаю, це все."
    mc "Що хочеш робити тепер?"
    m "Хмм."
    m h1_1d "Не впевнена."
    m forward blueshirt ldown rdown dist om oe "Ми сьогодні прийшли додому раніше, тож ще трохи рано вечеряти."
    m h1_1d "Можемо трохи прибратися по дому."
    show monika h1_1c
    mc "Звісно."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    "Я беру пилосос із шафи та включаю його."
    "Моніка бере ганчірку й починає витирати пил."
    "Я натискаю кнопку включення пилососа й починаю прибирання."
    "Прибиратися так — дивовижно приємний спосіб провести час з користю."
    "Ще краще, коли це робиш із людиною, яку любиш."
    "Загалом на прибирання йде близько двох годин."
    show monika h1_1k at t11
    m "Нарешті закінчили!"
    m h1_1d "Я вже трохи голодна."
    m "Будемо вечеряти?"
    show monika h1_1c
    mc "Добре."
    mc "Гадаю, у нас ще залишилися залишки їжі, давай їх докінчимо."
    scene bg kitchen
    with wipeleft_scene
    "Ми заходимо на кухню, і я перевіряю холодильник."
    "Ох..."
    mc "Емм, Моніко..."
    mc "Гадаю, ми вже з’їли всі залишки."
    m "Справді?"
    mc "Хочеш, щоб я швидко приготував щось на сковорідці?"
    m "Звісно."
    m "Я залишуся у вітальні."
    mc "Добре."
    "Я беру сковорідку й кілька овочів з холодильника."
    "Ставлю сковорідку на плиту, додаю трохи олії й розігріваю."
    "Нарізаю овочі, кидаю їх на сковорідку смажитися й чекаю кілька хвилин, поки вони підрум’яняться."
    "Знімаю сковорідку з плити та ставлю на стіл."
    mc "Готово!"
    mc "Моніко, вечеря готова!"
    m "Гаразд!"
    show monika h1_1a at l11
    "Моніка заходить на кухню."
    m h1_1j "Ммм~"
    m h1_1b "Смачно пахне!"
    mc "Смачного!"
    "Ми накладаємо їжу на тарілки та вечеряємо."
    m h1_3d "Я подумала, куди можемо піти на пікнік клубом завтра."
    m h1_1b "Можемо піти в парк у центрі міста."
    m "Я була там раз і мені дуже сподобалося."
    show monika h1_1a
    mc "Хмм..."
    mc "Центр міста досить далеко, чи не так?"
    mc "Ми будемо їхати автобусом?"
    m h1_1d "Так, думаю, це найкращий варіант."
    show monika h1_1a
    mc "Добре тоді."
    mc "Не забудь написати всім."
    m h1_1j "Мг."
    show monika h1_1a
    "Вона дістає телефон і починає друкувати повідомлення."
    m h1_1b "Готово."
    m "Пішли на балкон трохи поседимо?"
    m "Я заварю каву, гаразд?"
    show monika h1_1a
    mc "Звісно."
    mc "Тоді я приєднаюся."
    show monika at thide
    hide monika
    "Я піднімаюся на балкон, поки Моніка готує нам каву."
    scene bg balcony
    with wipeleft_scene
    "Сідаю на один із стільців та трохи розслабляюся."
    "Сонце світить яскраво, а вітерець легенько колише повітря."
    show monika h1_1j at t11
    "Моніка виходить з дому і ставить чашку на стіл."
    mc "Дякую!"
    m h1_1b "Завжди будь ласка~"
    show monika h1_1a at s11
    "Вона теж сідає."
    m h1_1b "Сьогодні гарна погода."
    show monika h1_1a
    mc "Так, справді."
    hide window
    pause 2.0
        pass
    m h1_1b "Цього літа буде неймовірно."
    m h1_3k "Ми двоє, просто проводимо його разом."
    m h1_1k "Мрія здійснилася~"
    show monika h1_1a
    mc "Так і є."
    hide window
    pause 5.0
        pass
    "Ми тихо сидимо, смакуючи каву."
    "Моніка кладе руку поверх моєї."
    "Я трохи червонію й відкидаюся на спинку стільця."
    "Пташки співають, а інколи повз проходять люди й балаканина лунає на фоні."
    "Це... просто приємно."
    "Моніка теж трохи розслабляється, і ми дивимося на велике блакитне небо."
    scene bg sky
    with Dissolve(2.0)
    "Я думаю, що можемо зробити на вихідних із нею."
    "..."
    "Кафе, куди ми ходили минулого разу, було дуже гарне."
    "Там були столики на вулиці, правда?"
    "Можливо, я зможу взяти її туди."
    "Але поки залишу це сюрпризом."
    scene bg balcony
    show monika h1_1a at t11
    with wipeleft_scene
    "Минає трохи часу, і сонце починає опускатися за горизонт."
    mc "Моніко, я піду всередину перевдягнутись."
    m h1_1d "Добре."
    m "Я теж піду всередину."
    scene bg bedroom
    with wipeleft_scene
    "Я кидаю Моніці піжаму, і вона йде у ванну."
    "Я перевдягаюсь і трохи прибираю кімнату."
    show monika p_1a at t11
    "Моніка повертається і сідає на ліжко."
    m p_1d "Хочеш перед сном подивитися телевізор у вітальні?"
    show monika p_1a
    mc "Звісно."
    scene bg livingRoom_lightsOn_TvOn
    with wipeleft_scene
    "Моніка стрибає на диван і вмикає телевізор."
    mc "Я принесу трохи закусок."
    m "Гаразд."
    scene bg kitchen
    with wipeleft_scene
    "Я відкриваю шафу й беру трохи чіпсів."
    scene bg livingRoom_lightsOff
    with wipeleft_scene
    "Моніка сидить на дивані й вмикає аніме, яке ми дивилися."
    m "Ми на третій серії, правда?"
    mc "Гадаю, так."
    m "Добре."
    "Починається третя серія, і я сідаю поруч із нею."
    scene m_cg_tvEvent
    with Dissolve(2.0)
    "Відкривається опенінг, і ми слухаємо музичну послідовність."
    "Під час серії ми хрумкаємо принесені чіпси."
    "Моніка уважно дивиться телевізор."
    "Я вирішую обережно притулитися до неї."
    scene black
    with wipeleft_scene
    "У цей час Моніка ніжно опускає мою голову до свого коліна."
    m "Хехехе~"
    m "Тобі подобається?"
    "Її стегна ніжно обіймають мою голову, як теплий обійм."
    "Вона м’яко гладить мою голову, поки ми продовжуємо дивитися."
    "Це найкращий, найрозслаблюючий досвід у моєму житті."
    "Сумніваюся, що щось зможе перевершити це."
    "Миска зі закусками спорожніла, і починається фінальна сцена."
    "Я дуже обережно піднімаюся з колін Моніки."
    scene bg livingRoom_lightsOff
    with wipeleft_scene
    mc "Дякую, Моніко..."
    m "Завжди будь ласка, коханий~"
    "Я забираю пусту миску й відношу її на кухню."
    scene bg kitchen
    with wipeleft_scene
    "Ставлю миску у посудомийку й вимикаю світло."
    scene black
    with wipeleft_scene
    "Я піднімаюсь нагору в спальню."
    scene bg n_bedroom
    with wipeleft_scene
    "Моніка притискається до мене в ліжку, і я приєднуюся до неї."
    scene black
    with wipeleft_scene
    stop music fadeout 2.0
        pass
    "Вона згортається поруч зі мною, і я обіймаю її."
    m "Мммм..."
    m "Я обожнюю це~"
    m "Давай просто залишимося так."
    m "Не хочу, щоб це закінчилося."
    menu:
        "І я теж, Моніко.":
            menu:
                "Я люблю тебе.":
                    m "Я теж тебе люблю..."
    "Ми залишаємося разом."
    "Мені здається, що нічого у світі не може нас розлучити зараз."
    "Я чую, як дихання Моніки стає спокійнішим."
    "І мої очі повільно закриваються, я все більше розслабляюся."
    "Невдовзі я засинаю, переходячи у наступний день..."
    call d9
