label d9:
    stop music fadeout 2.0
        pass
    scene day9
    with dissolve_scene_full
    window hide
        pass
    pause 5.0
        pass
    scene black
    with dissolve_scene_full
    pause 4.0
        pass
    "Мої очі повільно відкриваються на світлі кімнати."
    scene mcg_2
    with dissolve_scene_full
    play music t9
        pass
    "Моніка тримає мене в обіймах міцно."
    "Її дихання спокійне."
    "Я помічаю, як вона злегка піднімає повіки."
    show mcg_6
    "Вона усміхається та ще щільніше пригортається."
    hide mcg_6
    show mcg_5
    m "Не забувай, ти мені винний ще трохи обіймів~"
    hide mcg_5
    show mcg_6
    mc "Знаю."
    "Її обійми теплі, і я не можу не розслабитися."
    scene black
    with Dissolve(2.0)
    "Я обіймаю її у відповідь і закриваю очі."
    hide window
    pause 5.0
        pass
    "Хвилинку..."
    scene mcg_6
    with Dissolve(1.0)
    "Я дивлюсь на годинник на стіні."
    "10:23."
    "Скільки ми проспали?"
    mc "Гей, Моніко, не забувай, сьогодні у нас пікнік у центрі міста."
    show mcg_4
    m "Га?"
    m "Котра година..."
    m "Ой, лихо!"
    stop music fadeout 2.0
        pass
    scene bg bedroom
    with wipeleft_scene
    show monika p_1k at t11
    play music t12
        pass
    m "Це було приємно."
    m p_1g "Хотілося б, щоб це тривало трохи довше."
    show monika p_1a
    mc "Так."
    m p_1d "Я піду перевдягнуся."
    show monika p_1c
    mc "Добре."
    show monika at lhide
    hide monika
    "Вона заходить у ванну."
    "Я теж скористаюся часом, щоб перевдягнутися."
    mc "Гей, Моніко,{w=0.5} я піду приготую сніданок."
    m "Що ти будеш готувати?"
    mc "Не знаю, подивлюсь, що є в холодильнику."
    m "Добре."
    scene bg kitchen
    with wipeleft_scene
    "Я спускаюся вниз і відкриваю холодильник."
    "..."
    "Ох!"
    "Зроблю сендвічі на сніданок."
    "Беру каструлю й дві яйця з холодильника."
    "Ставлю каструлю на плиту й кладу туди яйця варитися."
    "Беру два шматочки хліба та намазую на них масло."
    "Кладемо два листки салату на хліб."
    "Нарізаю помідор і трохи огірка."
    "Кладемо їх на сендвічі, знімаю каструлю з плитою."
    "Моніка спускається вниз."
    show monika h1_3b at l11
    m "Ох!{w=0.5} Виглядає смачно!"
    show monika h1_1a
    mc "Ще не готово!"
    show monika at thide
    hide monika
    "Вона сідає за стіл."
    "Я нарізаю яйця та кладу їх на сендвічі."
    "Беру кілька редисок, нарізаю й додаю зверху."
    "Беру трохи сиру й натираю його на все."
    "В результаті виходять два товсті сендвічі з сиром, що стікає з боків."
    "Обережно ставлю їх на тарілки та приношу Моніці."
    show monika forward blueshirt ldown rdown vsur cm oe at t11
    m "Ох~"
    m h1_1b "Виглядає чудово!"
    show monika h1_1a
    mc "Дякую! Давай їсти!"
    show monika h1_1j
    "Моніка обережно бере сендвіч і відкушує шматок."
    show monika forward blueshirt ldown rdown neut e2a ma
    "Невеликі шматочки сиру та редиски падають з сендвіча, поки її очі сяють."
    "Я тихо посміхаюсь."
    show monika h1_1j
    "Вона продовжує жувати, і я їм свій сендвіч."
    show monika at thide
    hide monika
    "Я ставлю наші тарілки у посудомийку."
    mc "Гей, Моніко, що ти хочеш взяти на пікнік сьогодні?"
    show monika h1_1c at t11
    m "Хмм..."
    m h1_3d "Як щодо цезар салату?"
    show monika h1_1a
    mc "Добре."
    mc "Я почну його готувати."
    show monika at thide
    hide monika
    "Вона бере телефон і починає друкувати."
    m "О!{w=0.5} Сайорі написала мені раніше, вона принесе кавун."
    mc "Чудово!"
    mc "Хтось ще щось приносить?"
    m "Не знаю про інших."
    mc "Хмм... можливо, одного цезар салату буде замало."
    mc "Зроблю ще картопляний салат."
    m "Добре."
    "Я починаю готувати салати."
    "Телефон Моніки дзвонить."
    m "Це Юрі."
    "Вона відповідає та виходить з кухні."
    m "Привіт?"
    m "О!{w=0.5} Добре!"
    m "Зачекай, а від коли у тебе це є?"
    m "Ого!"
    m "Звісно!{w=0.5} Тоді зустрінемося ззовні."
    m "Бувай!"
    "Моніка кладе трубку."
    show monika h1_3b at l11
    m "Юрі сказала, що вона може відвезти нас у парк."
    show monika h1_1a
    mc "У Юрі є водійські права?!"
    m h1_1d "Я знаю!{w=0.5} Для мене це теж новина!"
    m "Але все одно, вона сказала, що зустріне нас зовні через 2 години."
    m "Вона привезе мінівен своєї родини."
    show monika h1_1a
    mc "Добре. {w=0.5}Можеш допомогти з салатами?"
    m h1_1b "Звісно!"
    show monika at thide
    hide monika
    "Вона починає готувати картопляний салат, поки я закінчую цезар."
    "Я накриваю салат та допомагаю Моніці завершити її частину."
    "Також накриваю й це, відкладаю вбік."
    m "Я піду перевдягнуся в щось гарніше."
    mc "Добре."
    "Я беру кілька приладів і кладу їх у пластиковий пакет, поки Моніка піднімається нагору."
    "Я ставлю все на стіл і виходжу з кухні."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    "Я беру рюкзак і складаю туди необхідне."
    "Моніка спускається вниз із своїм блокнотом і ручкою."
    show monika o2_1c at l11
    "Вона кладе його до рюкзака разом із кількома іншими речами."
    m o2_1d "Гадаю, це все, що нам реально потрібно."
    mc "Є ідеї для активностей?"
    m forward redskirt ldown rdown dist cm oe "Хммм..."
    m o2_1d "Сіду трохи поміркую."
    mc "Добре."
    show monika at thide
    hide monika
    "Вона знову бере блокнот і сідає на диван."
    "Тим часом я повертаюся на кухню."
    scene bg kitchen
    with wipeleft_scene
    "Беру кілька пластикових пляшок і наповнюю їх водою."
    stop music fadeout 2.0
        pass
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    "Кладу їх у рюкзак і сідаю поруч із Монікою."
    show monika o2_1c at t11
    mc "Щось придумала?"
    m o2_1d "Ні, ще ні..."
    m "А ти?"
    show monika o2_1c
    mc "Можливо, пограємо в ловишки чи щось таке."
    m o2_1c "Хмм..."
    "Вона записує це в блокнот."
    show monika o2_1d
    "Ми ще кілька хвилин лежимо на дивані та записуємо всі ідеї, що спадають на думку."
    show monika o2_1c
    "Я дивлюся на годинник."
    "Юрі скоро повинна приїхати."
    mc "Гей, Моніко, збирайся. Юрі буде тут будь-якої миті."
    m o2_1d "Добре."
    show monika at thide
    hide monika
    "Моніка швидко кладе блокнот у сумку."
    "Я беру одну з мисок із салатом, і вона бере іншу."
    "Я накидаю рюкзак на плече й взуваю черевики."
    "Моніка робить те саме, і ми виходимо з дому."
    play sound closet_open
        pass
    scene bg house
    with wipeleft_scene
    play sound closet_close
        pass
    play music t8
        pass
    show monika o2_1a at t11
    "Я закриваю двері й ми йдемо до воріт."
    "Незабаром Юрі приїжджає на чорному мінівені."
    "Здається, Нацукі сидить поруч із водієм."
    "Вона відчиняє двері, і ми сідаємо."
    m o2_1k "Привіт!"
    show monika o2_1a
    n "Йо!"
    y "Привіт, де Сайорі та ГГ?"
    mc "Я піду і покличу їх."
    y "Добре. {w=0.5}Моніко, можеш покласти речі назад."
    m o2_1b "Дякую, Юрі!"
    show monika o2_1a
    "Я передаю Моніці салат і рюкзак, а сам йду до будинку Сайорі."
    scene bg house
    with wipeleft_scene
    "Я дзвоню у двері."
    show protag 1ba at t11
    "ГГ відкриває двері, і я бачу Сайорі, яка взуває черевики позаду нього."
    mc "Ви готові йти?"
    p 1bc "Так, ми скоро вийдемо."
    show protag at thide
    hide protag
    "Сайорі виходить, несучи кавун, а ГГ зачиняє двері за ними."
    "Ми йдемо до машини Юрі."
    scene bg house
    with wipeleft_scene
    s "Гейееей!"
    "Сайорі кладе кавун у багажник."
    "Вона сідає в мінівен, за нею йде ГГ."
    "Вони займають місця позаду, а я сідаю посередині біля Моніки."
    "Я зачиняю двері і пристібаю ремінь безпеки."
    y "Можемо рушати?"
    m "Гадаю, все є."
    y "Добре тоді."
    "Вона заводить машину, і ми їдемо."
    scene black
    with wipeleft_scene
    "Поїздка проходить гладко."
    s "Я так схвильована!"
    n "І я теж."
    n "У мене є маленький сюрприз, коли ми приїдемо!"
    s "Ооо!{w=0.5} Що це?{w=0.2} Що це?"
    n "Поки не скажу!{w=0.5} Зіпсую сюрприз!"
    n "Але я точно знаю, що тобі сподобається, Сайорі!"
    s "Ммммммм... гааааразд."
    "Ми підходимо до входу в парк, Юрі паркується на найближчій стоянці."
    "Ми виходимо з мінівена та беремо наші речі з багажника."
    "Сайорі знову несе кавун, а Моніка і я беремо салати."
    mc "Давай, я понесу це."
    m "Дякую, [player]!"
    "Я беру миску з салатом від Моніки і ношу майже всі наші речі."
    "Нацукі тримає білу коробку, а Юрі і ГГ беруть рюкзаки."
    "Ми прямуємо до входу."
    scene bg park
    with wipeleft_scene
    "Ми помічаємо пікніковий столик біля кількох дерев."
    mc "Підійдемо туди."
    "Ми йдемо і ставимо речі на стіл."
    "Я розкладаю речі з рюкзака і ставлю салати поруч із коробкою Нацукі."
    show sayori 1ba at t31
    show yuri 1sa at t32
    show natsuki 1ba at t33
    "Після цього сідаю поруч із Монікою."
    s 3br "Все виглядає так смачно!"
    show sayori 1ba
    p "Так, дійсно."
    p "Хочете, щоб я нарізав кавун?"
    n 1bd "Так, давай!"
    "ГГ заглядає у свій рюкзак."
    show sayori 1bb
    show yuri 1se
    show natsuki casual turned neut b1c
    p "Ой, блін..."
    p "Де він..."
    p "Сайорі, ти випадково не взяла ніж?"
    s 1bc "Ем... здається, ні..."
    show sayori 1ba
    y 1sf "Зачекай секунду, я думаю, що у мене є."
    show yuri 1sf at lhide
    hide yuri
    "Юрі швидко біжить до своєї машини."
    show yuri 1sa at l32
    "Вона повертається з набором ножів."
    y 1sb "Ось."
    show yuri 1sa
    "Вона дістає ніж і передає його ГГ."
    "Він ріже кавун на скибки і кладе їх на тарілку."
    p "Дякую, Юрі."
    y 1sb "Нема за що. Я принесла цілий набір, на всяк випадок."
    y "Я також принесла набір для бадмінтону."
    show yuri 1sa
    n 1bd "Чудово! Після їжі можна буде пограти кілька раундів!"
    show natsuki 1ba
    m "Я за!"
    s 1br "Так!"
    show sayori 1ba
    mc "Але спочатку їмо! У нас є цезар і картопляний салат."
    "Я знімаю плівку, і всі беруть тарілки та виделки."
    "Беремо трохи кожного і починаємо смакувати."
    show natsuki 1bd
    stop music fadeout 2.0
        pass
    n "Хочете почути, що сталося минулого тижня в моєму магазині?"
    n 1bc "Я сиділа ззаду, робила трохи домашки з математики..."
    show sayori 1bb
    show yuri 1se
    n "І в магазин заходить хлопець, шукає хліб."
    n "Мама його вітає..."
    play music t7
        pass
    n 2be "Потім він каже їй замовкнути і що йому потрібен якийсь хліб!"
    n 1bc "Мама, залишаючись спокійною, каже, що такого хліба немає."
    n 1bf "Вона починає розповідати, що є, {w=0.5} а він її перебиває, кажучи прибрати глютен!"
    n "Мама каже, що він безглютеновий."
    n 1be "А він починає кричати, що йому байдуже, чи безглютеновий!"
    n "Вона трохи злиться на нього."
    n 1bf "Потім він дістає камеру з магазину на долар і каже, що буде записувати."
    n 1bc "Тато заходить, а він питає, що йому треба."
    n 1bb "Тато каже, що він менеджер."
    n 1be "Хлопець каже, щоб прибрати глютен з хліба."
    n "Тато каже, що хліб безглютеновий не можна змінити."
    n 1bf "Він знову бурчить про те, що ми дурні."
    n 1bc "Тато пропонує крекери без глютену."
    n 1be "Він каже, що не хоче крекерів."
    n "Тато питає, чи хоче він глютен чи ні."
    n "Він каже ні."
    n "Тато ще раз перелічує безглютенові продукти."
    n 1bf "Хлопець знову злішає."
    n "Мама погрожує викликати поліцію."
    n 1be "Він знову сердиться, кажучи, що все в магазині від глютену гірше."
    n "Мама знову каже про крекери без глютену."
    n 1bf "Він бере їх."
    n 1bb "Тато каже, що коштує 5 доларів."
    n 4bc "І знаєте, що сталося?"
    n 1bp "Він відмовився платити і вийшов з магазину."
    show natsuki 1bo at h33
    n 1bo "Що за чорт!"
    n 2be "Хто таке робить?"
    show natsuki 1bc
    m "Все закінчилося добре?"
    n 1bb "Так. Сподіваюся, він більше не прийде."
    n 5bx "Тсс... який придурок..."
    stop music fadeout 2.0
        pass
    n 1bl "Взагалі, говорячи про пекарню, впевнена, вам всім цікаво, що я сьогодні принесла!"
    s casual turned lup rup neut mc e2a "Ооо! Так! Покажи! Покажи!"
    n 1bz "Тримайте!"
    play music t12
        pass
    show sayori casual turned lup rup lsur cm oe at h31
    "Вона відкриває коробку і показує маленький шоколадний торт!"
    s casual turned lup rup neut mc e2a "Ооооо! Він виглядає так смачно!"
    "Сайорі починає тягнутися до нього."
    n 1bf "Ні!"
    play sound "sfx/slap.ogg"
        pass
    show sayori 1bp at h31
    "Нацукі шльопає Сайорі по руці."
    s "Ой!"
    show sayori 1be
    n 1be "Зачекай, Сайорі."
    n 5bb "Я не дам тобі кусати, поки не поріжу."
    show sayori 1ba
    n 1bl "До речі, Юрі, можеш передати мені ніж, будь ласка?"
    show natsuki 1bj
    y 1sj "Звичайно."
    show yuri 1sa
    "Вона передає ніж Нацукі."
    show natsuki 1bj at f33
    "Нацукі ріже його на 6 шматків, і ми всі беремо по одному."
    show natsuki 1bj
    "Я ставлю свій на тарілку з салатом, щоб не змазати торт залишками."
    "Ми всі насолоджуємось, {w=0.5} і мушу сказати, що це один із найсмачніших тортів, які я пробував!"
    s 4br "Ммммм~ Це так смачно!"
    show sayori 1ba
    m "Ти перевершила себе, Нацукі!"
    n 5bt "Дякую, друзі! Мабуть, я зроблю ще один, коли буде час."
    show natsuki 1bk
    p "До речі, Нацукі, у тебе є четвертий том 'Parfait Girls'?"
    n 1bx "Пффффт!"
    n 5by "У мене є всі, що вийшли досі!"
    n "Це, як… сімнадцять томів?"
    p "Ой, мені треба наганяти!"
    n 1bl "Якщо хочеш, можеш зайти в магазин завтра, дам тобі четвертий том."
    show natsuki 1bj
    p "Звичайно. Дякую, Нац!"
    n 1bv "Не називай мене так!"
    n 5bq "І так, без проблем."
    show natsuki 1bj
    y 1sf "Хтось хоче пограти в бадмінтон?"
    show yuri 1se
    m "Я за!"
    m "У мене ще були кілька ідей, але думаю, бадмінтон буде веселіше."
    "Інші теж погоджуються."
    y 1sb "Добре, я піду візьму набір."
    show yuri at lhide
    hide yuri
    "Юрі знову біжить до машини і швидко повертається з набором."
    show sayori at thide
    hide sayori
    show natsuki at thide
    hide natsuki
    show yuri 1se at t11
    mc "Хочеш, я допоможу поставити?"
    y 1sf "Так."
    m "Я теж допоможу!"
    show yuri at thide
    hide yuri
    "Моніка підходить, і ми троє розкладаємо кейс."
    "Я встромляю стержні в землю та тримаю їх, поки Моніка забиває кілочки каменем."
    "Юрі заплутує сітку, намагаючись її розплутати, перш ніж прив’язати на місце."
    "У нас йде близько 5 хвилин на встановлення."
    show monika o2_3d at t11
    m "Добре, у нас чотири ракетки.{w=0.5} Це означає, що двоє з нас мають сидіти поза грою кожен раунд."
    m "Гратимемо в парі."
    m o2_3k "Я з [player]!"
    show monika o2_3j
    mc "Виглядає так, що вибору немає, га?"
    m o2_3k "Ні!"
    show monika o2_3j
    mc "Тоді добре."
    show monika at thide
    hide monika
    show sayori 1br at t21
    show protag 1ba at t22
    s "ГГ і я разом!"
    show sayori at thide
    hide sayori
    show protag at thide
    hide protag
    show yuri 1se at t21
    show natsuki 1ba at t22
    m "Виглядає, що ви двоє разом."
    y 1sf "Мені це підходить."
    show yuri 1sa
    n 4by "Так, ми вас обох порвемо на шматки!"
    show natsuki 4ba
    m "Тоді я викликаю тебе першою, Нацукі!"
    n 4bd "Ха!{w=0.5} Починаємо!"
    show natsuki at thide
    hide natsuki
    show yuri at thide
    hide yuri
    "Моніка і я беремо наші ракетки та волан."
    "ГГ і Сайорі стають на протилежний бік сітки."
    show monika o2_1a at t11
    mc "Готова почати?"
    m o2_2k "Так!"
    show monika at thide
    hide monika
    show yuri 1sa at t21
    show natsuki 1ba at t22
    "Моніка робить подачу, і розпочинається розіграш."
    show yuri 1se at t21
    show natsuki 1bf at t22
    "Ми відбиваємо волан туди-сюди, поки я не завдаю сильного удару і не отримуємо очко."
    show natsuki 1bd at h22
    "Нацукі подає, і починається новий розіграш."
    show yuri 1se at h21
    "Моніка швидко відбиває волан, а я поспішаю до наступного."
    "Ми продовжуємо, поки ГГ не оголосить."
    show yuri 1se at t21
    show natsuki 1bc at t22
    p "Все!"
    p "[player] і Моніка виграли 21:17."
    show monika o2_1a at t33
    show yuri 1sa at t31
    show natsuki 5by at t32
    n "Тсс, гарна гра. Гадаю, цього разу ви виграли."
    show natsuki 1ba
    m o2_1b "Кажу ж!"
    show monika o2_1j at f33
    "Моніка обіймає мою руку."
    n 4bv "Йдіть у бік!"
    mc "Добре, добре."
    show monika at thide
    hide monika
    show yuri at thide
    hide yuri
    show natsuki at thide
    hide natsuki
    "Я передаю ракетку ГГ, а Моніка передає свою Сайорі."
    show yuri 1se at t41
    show natsuki 1ba at t42
    show protag 1ba at t43
    show sayori 1ba at t44
    "Моніка і я спостерігаємо, як Юрі робить подачу."
    show yuri 1se at t41
    show natsuki 1ba at t42
    show protag 1ba at t43
    show sayori 1ba at h44
    "Розпочинається розіграш, і гра стає цікавою!"
    show yuri 1se at t41
    show natsuki 1ba at h42
    show protag 1ba at t43
    show sayori 1ba at t44
    "Волан летить туди-сюди, іноді падаючи на траву і приносячи очко команді, яка його відбила."
    show yuri 1se at t41
    show natsuki 1ba at t42
    show protag 1ba at h43
    show sayori 1ba at t44
    "Я веду рахунок очок."
    "Невдовзі команди зрівнялися по 21 очку."
    m "1 очко для Сайорі і ГГ!"
    m "Хто набере 2 очки підряд — той і виграє!"
    show yuri 1sa at t41
    show natsuki 1bd at t42
    show protag 1bc at t43
    show sayori 3bo at t44
    "Вони збуджуються і починають розіграш знову."
    "Юрі набирає одне очко, потім ГГ — ще одне."
    "Все ще рівно."
    show natsuki 1bo at h42
    "Нацукі починає діяти агресивніше, сильно замахуючись ракеткою по волану."
    "Вона набирає два потрібні очки, щоб виграти."
    show yuri 1se at t41
    show natsuki 1bc at t42
    show protag 1bb at t43
    show sayori 1bb at t44
    mc "Гра завершена!"
    mc "Нацукі і Юрі виграли 24:22."
    s 1bl "Ох, гарна гра!"
    y 1sa "Ммхм!"
    show yuri 1sf at t11
    show sayori at thide
    hide sayori
    show natsuki at thide
    hide natsuki
    show protag at thide
    hide protag
    y "Ми знову змінюємося?"
    show yuri 1se
    m "Так."
    y 1sf "Добре.{w=0.5} [player], хочеш мою ракетку?"
    show yuri 1se
    mc "Звичайно."
    "Юрі передає ракетку мені, а Моніка бере ракетку Нацукі."
    show yuri at thide
    hide yuri
    "Я займаю позицію, а Моніка робить те ж саме."
    show protag 1bb at t21
    show sayori 1bb at t22
    n "І сьогодні, на DDSN, два пари змагаються в бадмінтон!"
    "Нацукі вигукує це як коментатор гри."
    n "Переможець отримує право хвалитися!{w=0.5} БИТВА!"
    show protag 1bl
    show sayori 1br at h22
    "Ми трохи сміємося, коли Сайорі подає."
    "{i}*Хляп!*{/i}"
    show sayori 1ba at t22
    show protag 1ba at t21
    "Я відбиваю волан, і битва починається."
    "Моніка і я мчимося, намагаючись відбити волан кожного разу."
    "Звісно, я час від часу промахуюся, так само і Моніка."
    "Але я відчуваю, що ми виграємо."
    "Я зовсім втратив рахунок, намагаючись не дати волану впасти на землю."
    s turned casual neut ldown rdown neut mb e1a b1d "Х’я!"
    m "О ні, ти не пройдеш!"
    show sayori 1bp at h22
    "Моніка швидко відбиває волан прямо до Сайорі."
    "Він відскакує від її живота на землю."
    show sayori at thide
    hide sayori
    show protag at thide
    hide protag
    show natsuki turned casual ldown rdown neut mc e4c b3b at t22
    show yuri 1sa at t21
    n "І ПРЕЗИДЕНТ ПЕРЕМАГАЄ!"
    n "21:19! Такого ще не було!"
    n 1bl "Юрі, маєш коментарі щодо цього неймовірного повороту?"
    show yuri 3sp at h31
    y "Ем? Уууууу...."
    "Юрі трохи здивована вибухом Нацукі."
    n "Ну?"
    "Нацукі жестикулює рукою, ніби тримає мікрофон."
    show natsuki 1bj
    show yuri 1sq at t21
    y "Г-Гарна гра?"
    show yuri at thide
    hide yuri
    show natsuki at thide
    hide natsuki
    "Ми всі вибухаємо сміхом."
    show monika o2_1k at t11
    m "Здається, право хвалитися за нами~"
    show monika o2_1a
    mc "Гадаю так!"
    show monika o2_2k
    "Моніка жартома показує м’язи Сайорі та ГГ."
    "Ми всі сміємося, і Моніка оживляється."
    m o2_1b "Ооо! У мене є ідея, що ми можемо зробити!"
    m o2_2b "Спробуємо гру Mad Libs!"
    show monika o2_1a
    n "Що це таке?"
    m o2_1b "Це гра 'заповни пропуски', щоб створити дуже випадкову історію!"
    m "Я швидко знайду одну."
    show monika o2_1a
    "Моніка дістає телефон."
    m o2_1b "Ооо, знайшла гарну!"
    m "[player], чому б тобі не почати першим?"
    show monika o2_1a
    mc "Добре."
    m o2_2b "Отже, спершу нам потрібен іменник."
    $ noun1 = ""
    while not noun1:
        $ noun1 = renpy.input('Іменник.',length=15).strip(' \t\n\r')
    m "Місце."
    $ place1 = ""
    while not place1:
        $ place1 = renpy.input('Місце.',length=15).strip(' \t\n\r')
    m "Дієслово у минулому часі."
    $ verb1 = ""
    while not verb1:
        $ verb1 = renpy.input('Дієслово у минулому часі.',length=15).strip(' \t\n\r')
    m "Іменник."
    $ noun2 = ""
    while not noun2:
        $ noun2 = renpy.input('Іменник.',length=15).strip(' \t\n\r')
    m "Ім’я."
    $ name1 = ""
    while not name1:
        $ name1 = renpy.input('Ім’я.',length=15).strip(' \t\n\r')
    m "Дієслово."
    $ verb2 = ""
    while not verb2:
        $ verb2 = renpy.input('Дієслово.',length=15).strip(' \t\n\r')
    m "Ще один іменник."
    $ noun3 = ""
    while not noun3:
        $ noun3 = renpy.input('Іменник.',length=15).strip(' \t\n\r')
    m "Ще одне дієслово."
    $ verb3 = ""
    while not verb3:
        $ verb3 = renpy.input('Дієслово.',length=15).strip(' \t\n\r')
    m "Іменник."
    $ noun4 = ""
    while not noun4:
        $ noun4 = renpy.input('Іменник.',length=15).strip(' \t\n\r')
    m "Частина тіла."
    $ body1 = ""
    while not body1:
        $ body1 = renpy.input('Частина тіла.',length=15).strip(' \t\n\r')
    m "Прикметник."
    $ adj1 = ""
    while not adj1:
        $ adj1 = renpy.input('Прикметник.',length=15).strip(' \t\n\r')
    m "Рідний (наприклад, дядько або щось подібне)."
    $ rel1 = ""
    while not rel1:
        $ rel1 = renpy.input('Рідний.',length=15).strip(' \t\n\r')
    m "Активність."
    $ activity1 = ""
    while not activity1:
        $ activity1 = renpy.input('Активність.',length=15).strip(' \t\n\r')
    m "Мережевий ресторан."
    $ rest1 = ""
    while not rest1:
        $ rest1 = renpy.input('Мережевий ресторан.',length=15).strip(' \t\n\r')
    m "Дієслово у минулому часі."
    $ adj2 = ""
    while not adj2:
        $ adj2 = renpy.input('Дієслово у минулому часі.',length=15).strip(' \t\n\r')
    m "Місяць."
    $ mon1 = ""
    while not mon1:
        $ mon1 = renpy.input('Місяць.',length=15).strip(' \t\n\r')
    m "Дієслово із закінченням '-ing'."
    $ verb4 = ""
    while not verb4:
        $ verb4 = renpy.input('Дієслово.',length=15).strip(' \t\n\r')
    m "Іменник."
    $ noun5 = ""
    while not noun5:
        $ noun5 = renpy.input('Іменник.',length=15).strip(' \t\n\r')
    m "Дієслово у минулому часі."
    $ verb5 = ""
    while not verb5:
        $ verb5 = renpy.input('Дієслово у минулому часі.',length=15).strip(' \t\n\r')
    m "Прикметник."
    $ adj3 = ""
    while not adj3:
        $ adj3 = renpy.input('Прикметник.',length=15).strip(' \t\n\r')
    m "Дієслово."
    $ verb6 = ""
    while not verb6:
        $ verb6 = renpy.input('Дієслово.',length=15).strip(' \t\n\r')
    m "Іменник."
    $ noun6 = ""
    while not noun6:
        $ noun6 = renpy.input('Іменник.',length=15).strip(' \t\n\r')
    m "Множина іменників."
    $ noun7 = ""
    while not noun7:
        $ noun7 = renpy.input('Множина іменників.',length=15).strip(' \t\n\r')
    m "І все!"
    m "Я прочитаю це вголос."
    m o2_1r "{i}Гм-м-м{/i}..."
    m o2_2b "Один [noun1] у [place1] був заарештований сьогодні вранці після того, як він [verb1] перед [noun2]."
    m "[name1] мав історію [verb2], але ніхто — навіть його [noun3] — не міг уявити, що він [verb3] із [noun4], застряглим у його [body1]."
    m "Я завжди думала, що він [adj1], але ніколи не думала, що зробить щось подібне. Навіть його [rel1] була здивована."
    m "Після короткого [activity1] копи слідували за ним до [rest1], де він, за повідомленнями, [adj2] у фритюрниці."
    m "У [mon1] жінка була притягнута за подібний злочин."
    m "Але замість того, щоб [verb4] із [noun5], вона [verb5] із [adj3] собакою."
    m "У будь-якому випадку, уявляємо, що після того, як він [verb6] із [noun6], багато [noun7] ймовірно потребуватимуть терапії."
    show monika forward redskirt ldown rdown laug om ce
    "Ми всі сміємося, слухаючи цю дурнувату історію."
    show monika o2_1b at t21
    show yuri 1se at t22
    m "Добре! Юрі, твій хід!"
    show yuri 1sb
    "Моніка повторює процес для Юрі та складає історію."
    show yuri at thide
    hide yuri
    show monika o2_2b at t11
    m "Гаразд, ось що у нас вийшло!"
    m "Це був дурнуватий, холодний листопадовий день."
    m "Я прокинувся від прекрасного запаху жареної горобці в ванній внизу."
    m "Я побіг сходами, щоб подивитися, чи можу допомогти готувати вечерю."
    m o2_2k "Мама сказала: 'Подивися, чи Данилі потрібна свіжа подружка.'"
    m "Тож я виніс тацю зі склянками квасу в їдальню."
    m "Коли я туди прийшов, я не міг повірити своїм очам!"
    m o2_2k "Там горіхи танцювали на житті!"
    show monika forward redskirt ldown rdown laug om ce
    "Дурнуватість триває."
    show monika at thide
    hide monika
    show yuri 1sb at t21
    show sayori 1ba at t22
    y "Я думаю, я знайшла гарний варіант!"
    show yuri 1sa
    s 4br "Ооо! Дозволь мені вибрати!"
    show yuri 1sb
    show sayori 2bx
    "Сайорі робить своє, а Юрі складає все докупи."
    show sayori at thide
    hide sayori
    show yuri 2sl at t11
    y "{i}Гм-м-м...{/i}"
    y 3sb "Чи це скульптура, чи автомобільний лоскут, рукоділля завжди є працею гелікоптера."
    y "Але іноді найбільш дивною частиною створення мистецтва є вирішення, що вибухати наступним!"
    y "На щастя, інтернет може надати допоміжну голову."
    y "В мережі є безліч дошок настрою та фото-гонгів для натхнення."
    show yuri at t21
    show monika o2_3l at t22
    y "Не важливо, чи ти переробляєш стегна Моніки, малюєш ядерні ракети чи влаштовуєш вечерю для 69 осіб, інтернет дасть безліч порад."
    show monika at thide
    hide monika
    show yuri at t11
    y "І якщо відчуваєш себе красивою, можна створити власні дизайни ножів."
    y 3sd "З нескінченною кількістю нових проектів, єдина проблема буде знайти чашку, щоб завершити їх усі."
    scene bg park
    with wipeleft_scene
    "Ми ще деякий час сміємося над створеними історіями."
    show monika o2_1d at t21
    show natsuki 1ba at t22
    m "Отже, Нацукі, ти сказала, що завтра будеш зайнята, так?"
    show monika o2_1c
    n 1bb "Так, мушу допомогти в магазині."
    show natsuki at thide
    hide natsuki
    show monika forward redskirt ldown rdown dist om oe at t11
    m "Добре, нічого завтра..."
    m o2_1d "Я так розумію, що всі вільні в понеділок?"
    show monika o2_1c
    "Ми всі киваємо у згоді."
    m o2_2b "Гаразд! Як щодо плавання?"
    show monika o2_1a at t21
    show sayori 4br at t22
    s "Ооо! Я хочу це зробити!"
    show sayori at thide
    hide sayori
    show yuri 1sf at t22
    y "Тоді я, мабуть, мушу завтра купити купальник. Я давно не плавала."
    show yuri at thide
    hide yuri
    show monika o2_2b at t11
    m "Добре! Підемо до того, що біля школи. Він найближчий."
    show monika o2_1a
    p "Гаразд."
    show monika o2_1c at t21
    show natsuki 5bc at t22
    n "До речі, друзі, думаю, нам слід почати збиратися. Досить пізно."
    "Ми всі піднімаємося та прибираємо безлад, який зробили."
    "Я накриваю залишки салатів і кавуна харчовою плівкою та пакую ножі Юрі."
    "Моніка забирає наші сумки та відносить їх до машини."
    "ГГ, Сайорі та Юрі розбирають сітку для бадмінтону і теж беруть із собою."
    "Ми вміщуємо все в багажник та сідаємо на ті самі місця, що й раніше."
    scene black
    with wipeleft_scene
    "Юрі заводить мінівен, і ми вирушаємо."
    s "Ооо! У мене є весела ідея, яку ми можемо зробити!"
    m "Що це?"
    s "Ми можемо пограти в Mantracker у тому парку біля нашого будинку одного вечора!"
    n "Ооо! Якщо ми це робимо, я буду викладатися на повну."
    y "Про який парк йдеться?"
    m "Є один парк поруч із нашим будинком, здається, ми проїжджали його по дорозі в центр."
    m "Він досить великий, і ми добре знаємо район."
    m "Ти та Нацукі просто приходите до нас додому, а ми разом підемо туди, коли будемо грати."
    y "Ага, добре."
    "Незабаром ми доїжджаємо до нашої вулиці, і Юрі зупиняється перед будинком Сайорі."
    scene bg house_dawn
    with wipeleft_scene
    "Я беру наші речі з багажника, поки Моніка трохи розмовляє з Сайорі."
    show monika o2_1a at t11
    mc "Давай заберемо наші речі всередину і повернемося ще трохи пограти."
    m o2_1b "Добре."
    "Моніка і я швидко заходимо, щоб прибрати наші речі."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    pause 1.0
        pass
    scene bg kitchen
    with wipeleft_scene
    pause 1.0
        pass
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    pause 1.0
        pass
    scene bg house_dawn
    with wipeleft_scene
    "Ми повертаємося назовні, і Моніка спирається на машину."
    show natsuki 1bl at t42
    show yuri 1sa at t41
    show monika o2_1a at t44
    show sayori 1ba at t43
    n "Отже, якщо хтось хоче завітати завтра, я не проти."
    n 1bd "Краще ніж працювати на передній стійці самій."
    show natsuki 1ba
    s 1bx "Я обов'язково прийду!"
    s 4br "Твої солодощі від мене не втечуть!"
    show natsuki 5bz at t42
    show yuri 1sd at t41
    show monika o2_1k at t44
    show sayori 4ba at t43
    "Ми всі трохи посміялися з коментаря Сайорі."
    show natsuki 1ba at t42
    show yuri 1sb at t41
    show monika o2_1c at t44
    show sayori 1bb at t43
    y "Думаю, нам час йти, у мене теж залишилися деякі справи вдома."
    show yuri 1sa
    show sayori 4bg at s43
    s "Ой, вже?"
    show sayori 4bf at t43
    n 5bc "Так, вибач Сайорі.{w=0.5} Уже пізно.{w=0.5} Отже, у понеділок ми йдемо плавати, правда?"
    show sayori 1ba
    show natsuki 5ba
    m o2_1b "Так!"
    show monika o2_1a
    n 1bd "Гаразд! Тоді ми йдемо."
    n "Бувайте!"
    y 1sb "До побачення!"
    m "Па-па!"
    show natsuki at thide
    hide natsuki
    show yuri 1sa at thide
    hide yuri
    show monika o2_1a at t33
    show sayori 1ba at t32
    show protag 1ba at t31
    "Вони закривають двері і йдуть вулицею."
    p 1bd "Мабуть, нам теж варто зайти всередину, так?"
    show protag 1ba
    m o2_2b "Мм. Можливо, завтра ми щось зробимо, якщо всі згодні."
    m o2_1b "Як думаєш, [player]?"
    menu:
        "Вибач, але завтра ми будемо зайняті.":
            $ persistent.goondate = True
            show monika o2_1c
            show sayori 1bb
            show protag 1bb
            mc "У мене є кілька планів, тож, можливо, наступного разу."
            show sayori 4bh at s32
            s "Ооо, добре."
            show sayori 1bx at t32
            s "Тоді зустрінемося у понеділок, щоб піти плавати!"
            show sayori 1ba
            m o2_1b "Так."
            m o2_3b "Ми йдемо всередину. Побачимось пізніше!"
            show monika o2_1a
            s 1br "Бувайте!"
            show sayori 1ba
            p 1bc "На добраніч!"
            show protag 1ba
            mc "До зустрічі!"
        "Звісно.":
            $ persistent.goondate = False
            s 4br "Ура!"
            s 3bx "Хочеш зустрітися приблизно о полудні?"
            show sayori 1ba
            m o2_2b "Добре. І я придумаю щось для нас на вечір."
            m o2_2a "На добраніч вам обом!"
            show monika o2_1a
            p 1bc "На добраніч!"
            show protag 1ba
            s 1br "Бувайте!"
    show protag at thide
    hide protag
    show sayori at thide
    hide sayori
    show monika at t11
    stop music fadeout 2.0
        pass
    "Моніка і я повертаємося всередину після того, як помахали ГГ і Сайорі."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    play music t9
        pass
    if persistent.goondate == True:
        show monika o2_1d at t11
        m "То що саме ти планував на завтра?"
        show monika o2_1c
        mc "Я сподівався, що ми підемо на побачення."
        m o2_1d "О!"
        m o2_1b "Добре!"
        menu:
            "Розкрити місце.":
                $ persistent.revealloc = True
                show monika o2_1a
                mc "Пам’ятаєш кафе, куди ми ходили кілька днів тому?"
                mc "Я сподівався, що ми можемо сісти та провести час разом."
                m o2_1j "Мммм~ Мені подобається ця ідея!"
                m o2_1b "Не можу дочекатися!"
            "Зберегти таємницю.":
                $ persistent.revealloc = False
                show monika o2_1a
                mc "Я хочу зберегти місце в таємниці."
                mc "Думаю, тобі сподобається!"
                m o2_5a "Ооо~ Добре тоді~"
                m "Я в захваті!"
    else:
        show monika o2_2k at t11
        m "Ооо! Я така рада!"
        show monika o2_1a
        mc "Так. Думаю, ми ніколи не були в пекарні Нацукі."
        m o2_1d "Ти права, ніколи."
        m "Вона ніколи нас не запрошувала раніше."
        show monika o2_1c
        mc "Не так вже й важливо."
        show monika o2_1a
        mc "Але приємно з її боку."
        m o2_1b "Так."
    show monika o2_1a
    mc "Втім, давай вечеряти."
    m o2_1b "Не проти, якщо я приготую?"
    mc "Не бачу причин проти."
    m "Чудово!"
    m "Я переодягнуся і одразу займуся цим!"
    show monika o2_1a
    mc "Добре."
    show monika at lhide
    hide monika
    "Моніка йде нагору, а я заходжу на кухню."
    scene bg kitchen
    with wipeleft_scene
    "Я розпаковую салатні миски і перекладаю залишки салатів у пластикові контейнери."
    "Ставлю їх у холодильник і повертаюся у вітальню, щоб прибрати інші речі."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    "Моніка проходить повз і заходить на кухню, поки я відкриваю сумку."
    "Я чую ритмічні удари ножа по овочах, розпаковуючи все."
    "Я ставлю зошит Моніки на стіл і прибираю інший непотріб, який ми принесли."
    play sound "mod_assets/sfx/frying.ogg" loop
        pass
    "Приємний запах манить мене на кухню після того, як я все прибрав."
    scene bg kitchen
    show monika h1_3a at t11
    with wipeleft_scene
    "Моніка стоїть за плитою та смажить у фритюрі кабачки в паніровці."
    mc "Виглядає смачно!"
    m h1_2k "Дякую~"
    m h1_2b "Думаю, що це добре поєднуватиметься з нашими салатами."
    show monika h1_3a
    mc "Добре."
    "Я починаю прибирати залишки інгредієнтів на столі."
    "Борошно, яйця, панірувальні сухарі..."
    "Кабачки швидко смажаться, і Моніка перекладає їх на тарілку з паперовим рушником, щоб ввібрати олію."
    "Вона ставить наступну партію смажитися."
    stop sound
        pass
    "Після завершення вона ставить тарілку на стіл."
    m h1_1d "Е-е, залиш олію в сковорідці. Я профільтрую її пізніше, щоб використати знову."
    show monika h1_1c
    mc "Добре."
    show monika h1_1a
    "Ми сідаємо, і я кладу на тарілку трохи салату та скибочку кабачка."
    "Я насолоджуюсь смаком кабачка та салату Цезар."
    m h1_2b "Ооо! Має ідею!"
    m "Хочеш крутони?"
    menu:
        "Так.":
            m "Гаразд!"
            "Моніка швидко бере тостер і ставить два шматки хліба."
            m h1_1l "Я забула зробити їх раніше для салату Цезар."
            show monika h1_1a
            mc "Ага, добре."
            "{i}*ПІНГ*{/i}"
            "Моніка дістає тости і нарізає їх на кубики."
            m h1_3d "Вони трохи прісні, але гаразд."
            m h1_1b "Ось, будь ласка."
            show monika h1_1a
            "Вона ставить тарілку поруч із салатом."
            mc "Дякую, Моніка."
            m h1_2k "Будь ласка!"
            show monika h1_1a
            "Я беру кілька і додаю у свій салат."
            "Вона робить те ж саме, і ми продовжуємо їсти."
        "Ні.":
            m h1_1l "О, добре."
            m h1_1k "Тоді забудь."
            show monika h1_1a
            "Я продовжую їсти разом із Монікою."
    show monika at thide
    hide monika
    "Після кількох хвилин ми закінчуємо, і я складаю тарілки в посудомийну машину."
    "Моніка кладе залишки в холодильник і йде нагору."
    "Я йду за нею після ввімкнення посудомийки."
    scene bg bedroom
    with wipeleft_scene
    show monika h1_1c at t11
    "Моніка перебирає речі у шафі."
    mc "Шукаєш щось?"
    m h1_1d "Так. Мод сказав, що я маю взяти купальник, але, здається, у мене його немає."
    menu:
        "То...":
            menu:
                "Завтра нам треба купити тобі купальник?":
                    pass
    m "Якщо я випадково не знайду його тут."
    m h1_2d "Я вже переглянула шухляди, нічого немає."
    m h1_2r "Схоже, завтра буде насичений день."
    if persistent.goondate == True:
        m h1_1n "Особливо з тим, що ти запланував для нас завтра."
    else:
        m h1_1n "Особливо після відвідування пекарні Нацукі завтра."
    menu:
        "Якось впораємося.":
            pass
    m h1_1d "Так. Але я продовжу шукати."
    show monika h1_1c
    mc "Добре."
    show monika at thide
    hide monika
    "Поки Моніка продовжує ритися у шафі, я сідаю за стіл і вмикаю комп’ютер."
    "Якраз коли я збираюся відкрити Google, Моніка роздратовано встає з присіду біля шафи."
    show monika h1_1r at t11
    m "Я здаюся."
    m "Краще завтра купимо новий купальник."
    show monika h1_1c
    mc "Ти знаєш, де хочеш його купити?"
    m h1_2d "Я знаю, що в торговому центрі є кілька магазинів із хорошими варіантами, тож можемо піти туди."
    show monika h1_1c
    mc "Ми поїдемо поїздом?"
    m h1_1d "Так. Поруч є станція, тож це буде найшвидше."
    m "Можемо завжди взяти автобус."
    show monika h1_1c
    mc "Поїзд буде надійніший, ніж автобус."
    m h1_1d "Добре."
    m h1_1c "Хммм..."
    m h1_2d "Можеш дати мені сісти за комп’ютер на хвилинку?"
    show monika h1_1c
    mc "Так, ось."
    m h1_1d "Дякую."
    show monika at thide
    hide monika
    "Я встаю зі стільця, а Моніка сідає."
    "Вона шукає магазин, про який говорила."
    "Я вирішую відвести погляд, бо трохи соромно."
    m "Так, у них дійсно великий вибір."
    m "Думаю, знайду щось, що тобі сподобається~"
    "Моє обличчя червоніє."
    mc "Мабуть, я вимкну все вниз..."
    m "Ооо? Справді? Не залишишся? Хе-хе~"
    m "Жартую, сідай."
    mc "Добре."
    "Вона справді любить мене піддражнювати."
    scene bg livingRoom_lightsOn_TvOff
    with wipeleft_scene
    "Я вимикаю світло, і помічаю дещо перед тим, як знову ввімкнути його."
    "Схоже, Моніка залишила свій зошит на столі."
    menu:
        "Переглянути його.":
            "Вона не буде проти, якщо я перегляну."
            "..."
            "Там є вірші, ще вірші, список покупок..."
            "...І ідеї, які ми придумали сьогодні вранці."
            "Решта блокноту порожня."
            "Чого я очікував?"
            "Та байдуже."
            "Я перегортаю на останню сторінку."
            "{i}Я люблю тебе, [player]~ <3{/i}"
            "..."
            "Я віднесу це наверх для неї..."
        "Не перегортати.":
            "Віднесу її наверх."
            "Не думаю, що їй сподобається, якщо я перегляну її речі."
    "Я вмикаю світло і йду нагору."
    scene bg bedroom
    with wipeleft_scene
    show monika p_1c at t11
    "Схоже, Моніка змінила піжаму поки я це робив."
    mc "Ти залишила свій блокно вниз."
    m p_1d "О, здається, так."
    m p_1b "Дякую, що підняв його для мене."
    show monika p_1a
    mc "Завжди будь ласка."
    mc "Я піду переодягатися зараз."
    m p_1b "Добре."
    show monika p_1a
    "Я заходжу у ванну, щоб переодягнутися у піжаму."
    scene black
    with wipeleft_scene
    "Я швидко переодягаюся і повертаюся назад."
    scene bg bedroom
    with wipeleft_scene
    "Моніка лежить у ліжку, гортаючи телефон."
    scene bg n_bedroom
    "Я вимикаю світло і лягаю поруч з нею."
    scene black
    with wipeleft_scene
    "Як тільки я заліз у ліжко, вона кладе телефон."
    m "Мабуть, побачимо, як пройде завтра."
    mc "Так."
    m "І не забувай, ти ще винна мені обіймашки зранку!"
    mc "Я знаю, я знаю."
    mc "На добраніч, Моніка."
    m "На добраніч, моя любов~"
    "Я засинаю з її обіймами."
    call d10
